[
  {
    "nameEt": "Üldõpe",
    "nameEn": "General Study",
    "orderNr": 1,
    "objectivesEt": "Eesmärgid\t\nLuua eeldused eriala õpinguteks ning toetada üliõpilase toimetulekut ja arengut õpikeskkonnas, suunates teda rakendama akadeemilise enesejuhtimise võtteid. \nToetada kutsealal vajalikke suhtlus- ja koostööoskusi ning info- ja kommunikatsioonitehnoloogiate rakendamisoskust.\n\nÕpiväljundid\t\nÜliõpilane:\n•\ttuleb toime õpikeskkonnas, mõistab õppekava ülesehitust ja õppetöökorraldust ning oskab leida ja kasutada õpingute läbimiseks vajalikku informatsiooni, rakendades enesejuhtimise võtteid;\n•\trakendab töösuhteid reguleerivaid õigusakte ja töökeskkonnale esitatavaid nõudeid;\n•\tvaldab riigikeelt nii kõnes kui kirjas kõrgtasemel, rakendab oma teadmisi ja oskusi suulisel ja kirjalikul suhtlemisel; \n•\trakendab vajalikke digipädevusi erialatöös vajalikul tasemel;\n•\tsuudab ühes võõrkeeles ennast selgelt väljendada, loetust kokkuvõtteid kirjalikult ette valmistada ning suuliselt ette kanda, vastata küsimustele ja argumenteerida;\n•\tjärgib kirjalike tööde vormistamise põhinõudeid ja akadeemilisi tavasid üliõpilastööde koostamisel.",
    "objectivesEn": "Objectives:\nTo create prerequisites for specialty studies and support student’s development in the learning environment teaching them to utilise the techniques of self-direction.\nTo support the development of professional communication and cooperation skills, and utilization of ICT.\n\n\nLearning outcomes:\nThe student\n•\t•\tmanages the learning environment, understands the structure of the curriculum and study arrangements, and is able to find and use necessary information to pass the studies utilising self-directed techniques;\n•\tutilises job related legislative acts and work environment requirements,\n•\thas high level knowledge of the official language both orally and in written form, and is able to utilise the knowledge and skills in oral and written communication;\n•\tutilises necessary professional digital competences at a required level;\n•\tis able to express themselves clearly, compose written summaries, present them orally, answer the questions and give arguments in one foreign language;\n•\tfollows the basic rules of documenting the written papers and follows academic regulations in writing student assignments.",
    "outcomesEt": "Eesmärgid\t\nLuua eeldused eriala õpinguteks ning toetada üliõpilase toimetulekut ja arengut õpikeskkonnas, suunates teda rakendama akadeemilise enesejuhtimise võtteid. \nToetada kutsealal vajalikke suhtlus- ja koostööoskusi ning info- ja kommunikatsioonitehnoloogiate rakendamisoskust.\n\nÕpiväljundid\t\nÜliõpilane:\n•\ttuleb toime õpikeskkonnas, mõistab õppekava ülesehitust ja õppetöökorraldust ning oskab leida ja kasutada õpingute läbimiseks vajalikku informatsiooni, rakendades enesejuhtimise võtteid;\n•\trakendab töösuhteid reguleerivaid õigusakte ja töökeskkonnale esitatavaid nõudeid;\n•\tvaldab riigikeelt nii kõnes kui kirjas kõrgtasemel, rakendab oma teadmisi ja oskusi suulisel ja kirjalikul suhtlemisel; \n•\trakendab vajalikke digipädevusi erialatöös vajalikul tasemel;\n•\tsuudab ühes võõrkeeles ennast selgelt väljendada, loetust kokkuvõtteid kirjalikult ette valmistada ning suuliselt ette kanda, vastata küsimustele ja argumenteerida;\n•\tjärgib kirjalike tööde vormistamise põhinõudeid ja akadeemilisi tavasid üliõpilastööde koostamisel.",
    "outcomesEn": "Objectives:\nTo create prerequisites for specialty studies and support student’s development in the learning environment teaching them to utilise the techniques of self-direction.\nTo support the development of professional communication and cooperation skills, and utilization of ICT.\n\n\nLearning outcomes:\nThe student\n•\t•\tmanages the learning environment, understands the structure of the curriculum and study arrangements, and is able to find and use necessary information to pass the studies utilising self-directed techniques;\n•\tutilises job related legislative acts and work environment requirements,\n•\thas high level knowledge of the official language both orally and in written form, and is able to utilise the knowledge and skills in oral and written communication;\n•\tutilises necessary professional digital competences at a required level;\n•\tis able to express themselves clearly, compose written summaries, present them orally, answer the questions and give arguments in one foreign language;\n•\tfollows the basic rules of documenting the written papers and follows academic regulations in writing student assignments.",
    "typeNameEt": "Üldained",
    "typeNameEn": "General Subjects",
    "totalCredits": 21,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 21,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Muu (kasutajal on võimalik ise kirjeldada mooduli liiki)",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 37364,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ019",
          "nameEt": "Tööohutus ja töötervishoid",
          "nameEn": "Labour Health and Safety",
          "description": null,
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": null,
          "objectivesEt": "Anda teadmised töökeskkonda reguleerivate õigusaktide sisust ning töökeskkonnale esitatavatest töötervishoiu- ja tööohutuse nõuetest ning oskused rakendada omandatud teadmisi erialastes situatsioonides.",
          "objectivesEn": "The aim of the subject is to provide knowledge of the content of legislation regulating the working environment and occupational health and safety requirements for the working environment, as well as the skills to apply the acquired knowledge in professional situations.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Töökeskkonnaalase tegevuse korraldus riigi ja ettevõtte tasandil. Vastutus tööohutusnõuete rikkumise eest. Töötervishoiu ja tööohutuse seadus. Tööõnnetuste ja kutsehaigestumise registreerimine ja uurimise kord. Ohuolukord ja tööõnnetuste ennetamine.Töötervishoiu- ja tööohutusalase väljaõppe ja täiendusõppe kord ettevõttes. Töötajate tervisekontrolli kord. Esmaabi korraldus ettevõttes. Töötervishoiu ja tööohutuse nõuded rasedate ja rinnaga toitvate naiste tööks. Töökoha ergonoomia. Nõuded töökohale ja töövahenditele. Nõuded kuvaritöökohale. Raskuste käsitsi teisaldamine. Töökeskkonna hindamine. Füüsikalised, keemilised, bioloogilised, füsioloogilised ja psühhosotsiaalsed ohutegurid, riskide maandamise võimalused. Isikukaitsevahendid. Riskianalüüs ja sisekontroll. Tuleohutus ja elektriohutus.",
          "descriptionEn": "Organization of occupational health and safety at the state and company level. Liability for violation of occupational safety requirements. Occupational Health and Safety Act. Organization of first aid in the company. Procedures for health surveillance of workers. Pregnant and breastfeeding women and people with disabilities in employment. Requirements for the workplace and work equipment. Occupational health and safety requirements for the display workplace. Danger and accident prevention. Work environment assessment and analysis. Main risk factors and their impact on workers' health. Methodology for risk analysis and action plan preparation. General electrical and fire safety requirements.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 37364
      },
      {
        "optional": false,
        "subject": {
          "id": 30405,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ002",
          "nameEt": "Andme- ja tekstitöötlus",
          "nameEn": "Data and Word Processing",
          "description": "-",
          "credits": 6,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Arendada erialaseks tööks vajalikke info- ja kommunikatsioonitehnoloogia alaseid praktilisi oskusi ning organisatsiooni asjaajamist puudutavad rakendusoskusi.",
          "objectivesEn": "To develop ICT skills needed in professional work and applied administration skills in an organisation.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\trakendab tekstitöötluse, tabelarvutuse ja esitluse tarkvara võimalusi ülesannete lahendamisel;\n•\trakendab infootsingu põhimõtteid internetist vajaliku teabe leidmisel;\n•\trakendab iseseisvalt nõudeid eriliigiliste dokumentide koostamisel lähtuvalt teabekandjast ning järgib elektroonilise asjaajamise põhimõtteid.",
          "outcomesEn": "The student having passed the course:\n•\tutilises the opportunities of word processing, spreadsheet and presentation software in handling tasks;\n•\tapplies the principles of data search on the Internet to find the information needed;\n•\tindependently employs the requirements to prepare different document types according to the information medium, and follows the principles of electronic administration.",
          "descriptionEt": "Tekstitöötluse põhimõisted, teksti vormistamise põhivõtted. Akadeemiliste tööde vormistamise põhimõtted. Tabelite ja jooniste koostamine ja kujundamine. Failihaldus ja töökeskkonna seaded. Arvutiturve. Tabelarvutuse alused. Valemite koostamine, funktsioonide kasutamine. Diagrammide loomine. Esitluse koostamine ja kujundamine. Interneti ja e-posti kasutamine tööalaseks suhtlemiseks ja infohankimiseks. Ohutustehnika ja ergonoomika arvutiga töötamisel. Tarkvara õiguskaitse.\r\nEestis kehtivad asjaajamise korraldust reglementeerivad normdokumendid. Dokumendi mõiste. Dokumendi plangid, elemendid, vormistamine. Eriliigiliste dokumentide koostamise ja vormistamise nõuded arvutil ja paberkandjal. Elektrooniline dokumendiregister. Dokumentide registreerimine, menetlemine ja säilitamine. Elektrooniline dokumendihaldus. Dokumendisüsteem. Meilietikett. Telefonietikett. Nõupidamiste korraldamine ja protokollimine.",
          "descriptionEn": "Basic terms of word processing, main techniques of text formatting. Principles of formatting academic papers. Preparation and design of tables and figures. File management and settings. Computer security. Spreadsheet essentials. Spreadsheet formulas and functions. Diagrams. Preparation and design of presentations. Internet and emails for business communication and information search. Safety and ergonomics in working with computers. Software legislation.\nEstonian regulatory requirements for records management. Concept of documenting. Document templates, elements, formatting. Preparation and formatting of different electronic and paper documents. Register of electronic document system. Document registration, management and archiving. Electronic document management. Document system. Email etiquette. Business phoning etiquette. Organising meetings and taking minutes.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30405
      },
      {
        "optional": false,
        "subject": {
          "id": 37365,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ020",
          "nameEt": "Õiguse alused ja tööõigus",
          "nameEn": "Legal Bases and Employment Law",
          "description": null,
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": null,
          "objectivesEt": "Eesmärk on anda teadmisi õiguse mõistetest ja töösuhteid reguleerivatest õigusaktidest ning oskused rakendada omandatud teadmisi erialastes situatsioonides.",
          "objectivesEn": "The aim is to provide knowledge of the concepts of law and employment legislation and skills to apply the acquired knowledge in a professional situation.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Õiguse mõiste. Õiguse allikad. Õigussüsteem. Õiguse valdkonnad. Õigusnormid. Õigusaktid. Kohtusüsteem. Õigussuhte subjekt, objekt. Subjektiivne õigus ja juriidiline kohustus. Tsiviilõiguse põhiinstituudid. Tsiviilseadustiku üldosa seadus. Tsiviilõiguse subjektid e füüsilised ja juriidilised isikud. Isikute õigus - ja teovõime. Esemed. Tehingud. Tehingu mõiste ja vorm. Tahteavaldused. Tehingu tühisus ja tühistamine. Esindamine. Tähtaeg, tähtpäev. Aegumine. Tööõiguse olemus. Tööõiguse asend õigussüsteemis. Töölepingu seadus. Töölepingu eristamine muudest teenuse osutamise lepingutest. Töölepingu mõiste ja sõlmimine. Töötaja ja tööandja kohustused.Töö- ja puhkeaeg. Muutuvtunnikokkulepe. Puhkused. Töötaja vastutuse piirangud.Töölepingu lõppemine ja üleminek. Töölepingu ülesütlemise viisid ja kord.Tühisus ja vaidlustamine. Vaidluste lahendamine ja riiklik järelevalve. Vastutus. Varaline vastutus. Võlaõigusseadus. Töövõtuleping. Käsundusleping.",
          "descriptionEn": "The concept of law. Sources of law. Legal system. Fields of law. Legal norms. Legislation. The judicial system. The subject, object of the legal relationship. Subjective right and legal obligation. Basic Institutes of Civil Law. Law on the General Part of the Civil Code. Subjects of civil law e natural and legal persons. The right of individuals - and legal capacity. Items. Transactions. Concept and form of transaction. Declarations of intent. Nullity and cancellation of the transaction. Representation. Deadline, deadline. Expiration. Nature of labor law. The position of labor law in the legal system. Employment Act. Distinguishing an employment contract from other service provision contracts. Concept and conclusion of employment contract. Obligations of the employee and the employer. Working and rest time. Variable hours agreement. Holidays. Limitations of the employee's liability. Termination and transfer of the employment contract. Ways and procedure of terminating the employment contract. Nullity and contestation. Dispute resolution and national oversight. Responsibility. Property liability. Law of Obligations Act. Work contract. Agency agreement.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 37365
      },
      {
        "optional": false,
        "subject": {
          "id": 37366,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ021",
          "nameEt": "Ametisuhtlus",
          "nameEn": "Official Communication",
          "description": null,
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": null,
          "objectivesEt": "Arendada suulist ja kirjalikku ametisuhtluse oskust ning täiendada teadmisi keele kui olulise töövahendi kohta.",
          "objectivesEn": ".To develop oral and written professional communication skills and to improve knowledge about language as an important work tool.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Suhtlemise olemus, ülesanded ja liigid. Ametliku suhtlemise eripärad. Suhtlemistasandid. Verbaalne ja mitteverbaalne suhtlemine. Suhtlemisoskused: kontakti loomine, hoidmine ja lõpetamine, kuulamine, eneseväljendamine, enesekehtestamine ja toimetulek vastupanuga. Suhtlemistõkked suulisel ja kirjalikul suhtlemisel, nende teadvustamine ja vältimine (sh viisakusreeglid ja -vormelid). Koosoleku korraldamine (kutse, kinnitamine, päevakord, sõnavõtud, memode koostamine). E-kirjade saatmine ja neile vastamine. Erialaste ettekannete ja väitluste ettevalmistamine ning pidamine. \nKeelelise enesekontrolli allikad (sõnastikud, käsiraamatud, Interneti-teave, keelenõuanne). Avaliku esinemise alused, valik kõne koostamise tehnilisi võtteid (alustamine ja lõpetamine; kordused: anafoor, sõnapaarid; näitlikustamine: metafoor, tsitaat vms, lugu). Eesti ortograafia põhiprintsiibid. Tüüpilised loogika- ja stiilivead ning liiasused kirjalikus ja suulises tekstis. Võõrkeelte mõju ja kantseliidi vältimine. Sõnavara ja keeleregistri valimine. Võõr-, tsitaat- ja uudissõnad. Nimed asjaajamiskeeles. Veaohud arvude ja lühendite ortograafias, tühikud ja ühikud trükitestis. Loetelude vormistamine.",
          "descriptionEn": "Nature, tasks and types of communication. Peculiarities of official communication. Levels of communication. Verbal and non-verbal communication. Communication skills: establishing, maintaining and ending contact, listening, expressing yourself, asserting yourself and dealing with resistance. Communication barriers in oral and written communication, their awareness and avoidance (including politeness rules and formulas). Organization of the meeting (invitation, confirmation, agenda, speeches, preparation of memos). Sending and replying to emails. Preparation and holding of professional presentations and debates.\nSources of language self-testing (dictionaries, manuals, Internet information, language advice). Basics of public speaking, a selection of technical techniques for preparing a speech (starting and ending; repetitions: anaphora, word pairs; demonstration: metaphor, quote, etc., story). Basic principles of Estonian orthography. Typical logical and stylistic errors and redundancies in written and spoken text. The influence of foreign languages ​​and the prevention of chancellitis. Choosing a vocabulary and language register. Foreign, quotation and news words. Names in business language. Dangers of errors in the spelling of numbers and abbreviations, spaces and units in the typing test. Forming lists.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": "Õppematerjalidega töötamine, harjutused ja testid, kommentaarid, referaat, ametikiri, kõne koostamine, essee.",
          "independentStudyEn": "Working with study materials, exercises and tests, comments, report, writing a paper, essay.",
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 37366
      },
      {
        "optional": false,
        "subject": {
          "id": 30404,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ001",
          "nameEt": "Akadeemiline enesejuhtimine",
          "nameEn": "Academic Self-Management",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Toetada üliõpilase toimetulekut ja arengut õpikeskkonnas suunates teda rakendama akadeemilise enesejuhtimise võtteid.",
          "objectivesEn": "To support student's coping and development in the learning environment by directing them to apply academic self-management techniques.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\ttuleb toime õpikeskkonnas, mõistab  õppetöökorraldust ja oskab leida õpingute läbimiseks vajalikku informatsiooni;\n•\tmõistab eriala vajalikkust ja arengut, õppekava eesmärki, õpiväljundeid ja  ülesehitust;\n•\t tunneb enesejuhtimise võtteid ja õppimise eripära kõrgkoolis;\n•\tkoostab KTJ põhjal näidised erinevat liiki akadeemiliste kirjalike tööde kohta;\n•\tmõistab (isiku)andmete kaitse vajalikkust ja isikuandmete töötlemise aluseid.",
          "outcomesEn": "The student having passed the course:\n•\tcopes with the learning environment, understands organisation of studies and is able to find study information for passing the studies;\n•\tunderstands the necesity and development of the speciality, the objective of the study programme, learning outcomes and structure;\n•\tknows self-management techniques and the features of studying at a higher educational institution;\n•\tprepares samples of different types of written academic papers following the guidelines for academic written papers;\n•\tunderstands the necessity of personal data protection and the basics of data processing.",
          "descriptionEt": "Õppetöö korraldus ja seda reguleeriv seadusandlus.  Praktika sisu ja korraldus (õppepraktika ja praktika ettevõttes). Eriala arengutrendid. Õppeprotsessi kavandamine, õpioskused ja -harjumused. Ajajuhtimine. Täiskasvanud õppija enesemotivatsioon ja eesmärkide püstitamine. Akadeemiline kirjutamine. Arvutivõrgu ja infosüsteemi kasutamine, sh autentimine. Isikuandmete käitlemise alused (isikuandmete töötlemise, edastamise, säilitamise, kustutamise põhimõtted ja nõuded, andmesubjekti õigused).",
          "descriptionEn": "Organisation of studies and legislation. Practical training and its organisation (college based practical training and in-company practical training). Developmental trends of the speciality. Planning of the study process, learning skills and habits. Time management. Self–motivation and setting objectives as an adult learner. Academic writing. Utilisation of computer network and information system, including authentification. Basics of personal data processing (principles and requirements of personal data processing, delivering, archiving and deleting, data subject rights).",
          "studyLiterature": null,
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30404
      },
      {
        "optional": false,
        "subject": {
          "id": 30406,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ003",
          "nameEt": "Akadeemiline suhtlus inglise keeles",
          "nameEn": "Academic Communication in English",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Arendada erialaseks suhtlemiseks vajalikku suulist ja kirjalikku eneseväljendusoskust.",
          "objectivesEn": "To develop professional oral and written communication.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\tkasutab erialases suhtluses sobivat sõnavara nii kõnes kui kirjas; \n•\tselgitab eriala valdkonnaga seonduvaid probleeme suuliselt ja kirjalikult;\n•\toskab koostada ja vormistada enamlevinud erialaseid dokumente;\n•\ttunneb esitlusele esitatavaid nõudeid ning rakendab neid esitluse koostamisel ja ettekandmisel.",
          "outcomesEn": "A student having passed the cource:\n- exploits appropriate vocabulary in oral and written professional communication;\n- explains professional problems orally and in written form;\n- is able to prepare common professional documentation;\n- knows the requirements of presentation and implements them in the preparation process and delivery.",
          "descriptionEt": "Akadeemilise inglise keele iseärasused ja oskused\nAkadeemilise suhtluse väljendusvahendid ja erialases suhtlemises kasutatav keel\nErialase suunitlusega õppekirjanduse läbitöötamine ja refereerimine\nEsitluse struktuur ja kava koostamine\nEsitluse koostamine\nNõuded slaididele\nSuulise esitluse läbiviimine\nEsitluse hindamine\nErialaste dokumentide koostamine",
          "descriptionEn": null,
          "studyLiterature": "1.\tSmith, A. (2013) Best Commercial Practice. ELI\n2.\tMcCarthy, M., O’Dell, F. (2011) Academic Vocabulary in Use. Cambridge University Press\n3.\tMascull, B. (2017). Business Vocabulary in Use. Advanced. Cambridge University Press",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-Iseseisvate tööde juhendid, ülesanded ja nõuded on leitavad õppematerjalides ja neid tutvustatakse esimeses kontaktõppe tunnis. Iseseisvate tööde esitamine on kohustuslik ning on eelduseks lõpparvestuse saamisele.",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30406
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 220,
        "nameEt": "Personalijuhtimine",
        "nameEn": "Personnel Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      },
      {
        "id": 218,
        "nameEt": "Finantsjuhtimine",
        "nameEn": "Financial Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Põhiõpe",
    "nameEn": "Core Study",
    "orderNr": 2,
    "objectivesEt": "Eesmärgid\t\nLuua eeldused ärijuhtimise eriala omandamiseks.",
    "objectivesEn": "Objectives:\nTo create prerequisites for acquiring the business administration specialty.",
    "outcomesEt": "Eesmärgid\t\nLuua eeldused ärijuhtimise eriala omandamiseks.",
    "outcomesEn": "Objectives:\nTo create prerequisites for acquiring the business administration specialty.",
    "typeNameEt": "Erialaained",
    "typeNameEn": "Specialty subjects",
    "totalCredits": 84,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 84,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Muu (kasutajal on võimalik ise kirjeldada mooduli liiki)",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 30751,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ014",
          "nameEt": "Turundus",
          "nameEn": "Marketing",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada arusaam turunduse olemusest, strateegilisest ning taktikalisest planeerimisest ja meetodite kasutamisest.",
          "objectivesEn": "Develop an understanding of the nature of marketing, strategic and tactical planning and the use of methods.",
          "outcomesEt": "Aine läbinud üliõpilane: \r\n•\tdemonstreerib süvateadmisi turunduse valdkonnas; \r\n•\tanalüüsib turundustegevuse mõju ettevõtte tegevusele ja hindab ettevõtte võimalusi ning ohte turul;\r\n•\tanalüüsib sihtturgu, sihtgruppe ja tarbijate ostukäitumist ning seda mõjutavaid tegureid ja ostuotsustusprotsessi;\r\n•\tsegmenteerib ja positsioneerib turgu ja määratleb turunduseesmärgid ja strateegiad konkurentsisituatsioonist lähtuvalt;\r\n•\tselgitab turunduskompleksi kujunemist, -juhtimist, mõjureid ja omavahelisi seoseid, koostab turundusplaani.",
          "outcomesEn": "Student who has passed the subject:\n• demonstrates in-depth knowledge in the field of marketing;\n• analyzes the impact of marketing activities on the company's operations and assesses the company's opportunities and threats in the market;\n• analyzes the target market, target groups and consumer purchasing behavior and the factors influencing it and the purchasing decision process;\n• segments and positions the market and defines marketing goals and strategies based on the competitive situation;\n• explains the formation, management, influencers and interrelationships of the marketing complex, prepares a marketing plan.",
          "descriptionEt": "Turundus. Turu segmenteerimine. Turunduse strateegiline juhtimine ja -protsess. Turunduskompleksi juhtimine.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30751
      },
      {
        "optional": false,
        "subject": {
          "id": 30750,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ013",
          "nameEt": "Ettevõtlus",
          "nameEn": "Entrepreneurship",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused toime tulla Eesti ettevõtluskeskkonnas ning anda oskus ettevõtet edukalt asutada ja käivitada.",
          "objectivesEn": "To create opportunities to cope in the Estonian business environment and to provide the ability to successfully establish and start a company.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\tanalüüsib ettevõtluse olukorda ja selle kohta majanduses;\n•\tdemonstreerib ettevõtlusega seotud süvateadmisi vastavalt Eesti majandusruumile ja seadusandlusele;\n•\tvõrdleb ettevõtlusvorme ja valiku põhimõtteid;\n•\tteab ettevõtluse alustamise ja toimimise põhimõtteid ning protsesse ettevõtte käivitamise ja toimimise tasandil.",
          "outcomesEn": "Student who has passed the subject:\n• analyzes the business situation and its situation in the economy;\n• demonstrates in-depth knowledge related to entrepreneurship in accordance with the Estonian economic space and legislation;\n• compares business forms and selection principles;\n• knows the principles of starting and operating a business and the processes at the level of starting and operating a business.",
          "descriptionEt": "Ettevõtlus ja selle olulisus majanduse kontekstis. Eesti ettevõtlusvormid ja ettevõtete asutamise ning käivitamise põhimõtted. Ettevõtluskeskkond, selle analüüsimine. Ettevõtte toimimise mehhanismid. Ettevõtlusriskid.\r\n ",
          "descriptionEn": "Entrepreneurship and its importance in the context of the economy. Estonian business forms and the principles of founding and starting up companies. Business environment, analyzing sales. Mechanisms of business operation. Business risks.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30750
      },
      {
        "optional": false,
        "subject": {
          "id": 30743,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ006",
          "nameEt": "Majandusmatemaatika",
          "nameEn": "Mathematical Economics",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused majandusmatemaatiliste mudelite kasutamiseks erinevate majandusülesannete lahendamisel.",
          "objectivesEn": "Create opportunities to use economic mathematical models in solving various economic tasks.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\trakendab protsentarvutuste põhivõtteid majandusülesannete lahendamisel;\r\n•\tkoostab erinevaid majandusmatemaatilisi mudeleid, \r\n•\tlahendab majandusmatemaatilisi ülesandeid ja analüüsib neid.",
          "outcomesEn": "-",
          "descriptionEt": "Protsentarvutuste põhitõed ja praktilised ülesanded. Proportsionaalne jaotamine.\r\nFunktsioonid majandusteoorias. Determinandid. Maatriksarvutuse alused. Lineaarvõrrandisüsteemid, nende lahendamine. Lineaaralgebra majandusülesanded. Matemaatiline planeerimine majanduses.",
          "descriptionEn": "Basics of percentage calculations and practical exercises. Proportional allocation.\nFunctions in economic theory. Determinants. Basics of matrix calculus. Systems of linear equations, their solution. Economic problems of linear algebra. Mathematical planning in economics.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "E",
        "subjectId": 30743
      },
      {
        "optional": false,
        "subject": {
          "id": 30752,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ015",
          "nameEt": "Äriplaan",
          "nameEn": "Business Plan",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused toime tulla Eesti ettevõtluskeskkonnas ning anda äriidee arendamise, ettevõtte asutamise ja käivitamise ning äriplaani koostamise oskus.",
          "objectivesEn": "To create opportunities to manage in Estonian entrepreneurial environment and provide students with skills to develop business ideas, establish and run an enterprise, and design a business plan.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\tarendab välja äriidee alustavale või juba tegutsevale ettevõttele; \n●\tanalüüsib äriplaanis toodet, ärikeskkonda, turgu, kliente ning konkurente; \n●\tkoostab tegevuskava äriidee elluviimiseks ja koostab investeeringute plaani ja finantsprognoosid;\n●\tkoostab turundus- ja personaliplaani ning analüüsib äriidee elluviimisega seonduvaid riske.",
          "outcomesEn": "The student having passed the course:\n•\tdevelops a business idea for the start-up or existing enterprise;\n•\tin their business plan analyses the product, business environment, market, customers and competitors;\n•\tprepares the action plan to carry out the business idea and writes the investment plan and provides financial forecasts;\n•\tprepares the marketing and personnel plan and analyses the risks concerning the implementation of the business idea.",
          "descriptionEt": "Äriplaan, selle koostamise vajalikkus ettevõttele äri planeerimise/ arendamise taustal. Äriidee olemus ja tunnused. Äriplaani koostamise põhimõtted, põhivead. Toode, teenus, turu- ja konkurentsi analüüs äriplaanis. Turundusplaani, personaliplaani ja finantsplaani koostamine äriplaanis. Investeeringute plaan. Finantsplaneerimine ja prognoosid (s.h müügiprognoos, rahavoogude- ja kasumiprognoosimine; bilansiprognoos).",
          "descriptionEn": "Business plan, its necessity for the company to plan/develop their business. Essence and features of the business idea. Principles and main mistakes of business plans. Product, service, market and competition analysis in the business plan. Preparation of marketing, personnel and financial plans in the business plan. Investment plan. Financial planning and forecasts (incl. sales forecasts, cash flow and revenue forecasts; balance sheet forecasts).",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30752
      },
      {
        "optional": false,
        "subject": {
          "id": 30739,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ002",
          "nameEt": "Juhtimine",
          "nameEn": "Management",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused kaasaegseid organisatsiooni- ja juhtimisteooriad kasutades lahendada loovalt erinevaid sh ettearvamatuid juhtimisolukordi, võttes vastutuse üksikisikute ja rühmade kutsealase juhtimise eest.",
          "objectivesEn": "-To create opportunities to creatively solve various management situations, including unpredictable management situations, using modern organizational and management theories, taking responsibility for the professional management of individuals and groups.",
          "outcomesEt": "Aine läbinud  üliõpilane:\n•\torienteerub juhtimisteooria arengutes ja erinevate koolkondade seisukohtades ning oskab neid kriitiliselt hinnata;\n•\tselgitab juhtimisprotsessi läbi erinevate juhtimisfunktsioonide;\n•\tmõistab otsustamise olulisust juhtimistöös, otsustusprotsessi ning erinevaid otsustusmeetodeid erinevates otsustusolukordades ning vastutuse võtmise olulisust otsuste langetamise ja inimeste kutsealase arendamise juhtimise eest; \n•\tmääratleb organisatsioonides tekkinud probleemsituatsioone, analüüsib neid ning tuginedes peamistele juhtimisteooriatele pakub välja võimalikke sh novaatorlikke lahendusviise;\n•\tdemonstreerib süvateadmisi personalijuhtimise olemusest, eesmärkidest ja personalijuhtimisega seotud põhimõistetest;\n•\ton salliv hoiakute ning väärtuste mitmekesisuse suhtes organisatsioonis.",
          "outcomesEn": "-orienteerub juhtimisteooria arengutes ja erinevate koolkondade seisukohtades ning oskab neid kriitiliselt hinnata;\n•\tselgitab juhtimisprotsessi läbi erinevate juhtimisfunktsioonide;\n•\tmõistab otsustamise olulisust juhtimistöös, otsustusprotsessi ning erinevaid otsustusmeetodeid erinevates otsustusolukordades ning vastutuse võtmise olulisust otsuste langetamise ja inimeste kutsealase arendamise juhtimise eest; \n•\tmääratleb organisatsioonides tekkinud probleemsituatsioone, analüüsib neid ning tuginedes peamistele juhtimisteooriatele pakub välja võimalikke sh novaatorlikke lahendusviise;\n•\tdemonstreerib süvateadmisi personalijuhtimise olemusest, eesmärkidest ja personalijuhtimisega seotud põhimõistetest;\n•\ton salliv hoiakute ning väärtuste mitmekesisuse suhtes organisatsioonis.\nTo create opportunities to creatively solve various management situations, including unpredictable management situations, using modern organizational and management theories, taking responsibility for the professional management of individuals and groups.\n• orients himself / herself in the development of management theory and the positions of different schools and is able to critically evaluate them;\n• explains the management process through various management functions;\n• understands the importance of decision-making in management, the decision-making process and different decision-making methods in different decision-making situations, and the importance of taking responsibility for decision-making and managing people's professional development;\n• defines problem situations that have arisen in organizations, analyzes them and, based on the main management theories, proposes possible, including innovative solutions;\n• Demonstrates in-depth knowledge of the nature, objectives and basic concepts of human resource management;\n• is tolerant of the diversity of attitudes and values in the organization.",
          "descriptionEt": "Juhtimine. Juhtimisfunktsioonid. Sotsiaalne vastutus. Juhi eetika. Otsustamine. Planeerimine. Juhtimine eesmärkide kaudu. Strateegiline juhtimine. Organiseerimine. Muutuste juhtimine. Eestvedamine ja liidriksolek. Kontrollimine. Personalijuhtimise olemus ja areng. Töö analüüs. Personali planeerimine. Personali värbamine ja valik. Personali hindamine. Personali hüvitamine, sh töötasustamine. Personali arendamine, koolitus ja karjäär. Personaliarvestus.",
          "descriptionEn": "Management. Management functions. Social responsibility. Leadership ethics. Decision making. Planning. Leadership through goals. Strategic management. Organization. Change management. Leadership and leadership. Verification. The nature and development of human resource management. Work analysis. Personnel planning. Staff recruitment and selection. Staff appraisal. Compensation of staff, including remuneration. Staff development, training and careers. Personnel accounting.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "E",
        "subjectId": 30739
      },
      {
        "optional": false,
        "subject": {
          "id": 30747,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ010",
          "nameEt": "Erialane inglise keel",
          "nameEn": "Professional English",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Arendada kutsealaseks suhtlemiseks vajalikku suulist ja kirjalikku eneseväljendusoskust.",
          "objectivesEn": "To develop professional oral and written communication.",
          "outcomesEt": "-Aine läbinud üliõpilane: \n•\tkasutab erialases suhtluses sobivat sõnavaras nii kõnes kui kirjas; \n•\tselgitab eriala valdkonnaga seonduvaid probleeme suuliselt ja kirjalikult;\n•\toskab koostada ja vormistada enamlevinud ärialaseid dokumente (avaldus, e-kiri, memo) kasutades sobivat sõnavara;\n•\ttunneb esitlusele esitatavaid nõudeid ning rakendab neid esitluse koostamisel ja ettekandmisel.",
          "outcomesEn": "A student having passed the course:\n- exploits appropriate vocabulary in oral and written professional communication;\n- explains professional problems orally and in written form;\n- is able to prepare common business documents (application, email, memo etc.);\n- knows the requirements for presentation and implements them in preparation process and delivery of the presentation.",
          "descriptionEt": "Teemad majandusmudelid, erasektor, FIE, usaldusühing, aktsiaselts, kooperatiiv, frantsiis, äriühendused, hargmaised firmad, väikeettevõtted, organisatsiooni struktuur, avalik sektor, riigiettevõtted. Värbamine, värbamisagentuurid, sihtotsing, töökuulutus, tööavaldus, kaaskirja tüübid, CV liigid, töövestlus, töölepingud. Ametlik ja vaba register, ametikiri, päring, vastus päringule.",
          "descriptionEn": "Economic systems, private sector, sole trader, partnership, limited liabilities, cooperative, franchising, multinationals, SMEs, organisational structure, public sector. Recruitment, recruitment agencies, headhunting, job advertisement, covering letters, CVs, job interview, contracts. Formal and informal register, business letter, enquiries, replies to enquiries.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30747
      },
      {
        "optional": false,
        "subject": {
          "id": 30749,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ012",
          "nameEt": "Strateegiline juhtimine",
          "nameEn": "Strategic Management",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused strateegilise juhtimise alaste teadmiste omandamiseks, et seeläbi toetada organisatsiooni tegevuse innovatiivsust ja jätkusuutlikkust.",
          "objectivesEn": "To create opportunities for acquiring knowledge about strategic management in order to support the innovativeness and sustainability of the organization's activities.",
          "outcomesEt": "Aine läbinud üliõpilane: \r\n•\tdemonstreerib kriitilist arusaama äritegevuse strateegilise juhtimise kontseptsioonidest ning oskab neid loovalt rakendada ettevõtte strateegiate väljatöötamisel ning elluviimisel;\r\n•\tformuleerib ettevõtte missiooni ja visiooni ning selgitab keskkonna mõju organisatsiooni konkurentsivõimele;\r\n•\toskab rakendada omandatud teadmisi strateegilisest juhtimisest funktsionaaltasandi strateegia loomisel, oskab seada organisatsioonile strateegilised eesmärgid ning vastavalt nendele valida strateegia ning koostada tegevuskava.",
          "outcomesEn": "-",
          "descriptionEt": "Sissejuhatus strateegilisse juhtimisse. Strateegilise juhtimise tasandid. Strateegia ja postrulaadid. Visioon, missioon. Eesmärgid, prioriteedid. Mõõdikud ja väärtused. Strateegilised otsused ja otsustajad. Keskkond ja konkurents. Strateegia liigid. Strateegiline juhtimine. Organisatsiooni ülesehitus. Kontrollisüsteemi loomine. Strateegilised muudatused. Väikeettevõtte strateegiline juhtimine, omaniku visioon, muudatuste elluviimine, agentuurikonflikt. Arengukava mõiste ja olemus. Erinevate arengukavade võrdlus. Strateegia ja eesmärkide väljatöötamine ning ülesannete püstitamine.",
          "descriptionEn": "Introduction to Strategic Management. Levels of strategic management. Strategy and postrules. Vision, mission. Goals, priorities. Metrics and values. Strategic decisions and decision makers. Environment and competition. Types of strategy. Strategic management. Organizational structure. Creating a control system. Strategic changes. Small business strategic management, owner vision, change implementation, agency conflict. The concept and nature of the development plan. Comparison of different development plans. Developing strategy and goals and setting tasks.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30749
      },
      {
        "optional": false,
        "subject": {
          "id": 30759,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ021",
          "nameEt": "Raha, finantsinstitutsioonid ja turud",
          "nameEn": "Cash, Financial Institutions and Markets",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda ülevaade rahast, finantsinstitutsioonidest ja turgudest sobiva finantsteenuse valimiseks.",
          "objectivesEn": "To give an overview of cash, financial institutions and markets in order to choose appropriate financial services.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\tteab finantsinstitutsioonide funktsioone;\n●\tomab ülevaadet rahvusvaheliste arvelduste põhimõtetest;\n●\trakendab süvateadmisi finantsvahenduse teenustest;\n●\tmõistab kindlustuse funktsioone ja liike.",
          "outcomesEn": "The student having passed the course:\n•\tknows the functions of financial institutions;\n•\thas an overview of the principles of international transactions;\n•\tutilises deep knowledge of financial mediation services; \n•\tunderstands the functions and types of insurance.",
          "descriptionEt": "Raha, selle omadused, kvaliteedinõuded, funktsioonid ja liigid, alternatiivraha. Finantsvahenduse olemus. Finantsturg. Turuosalised krediidi- ja kindlustusturul, erinevad finantsvahendajate tüübid. Pankade tekkimine. Panga funktsioonid, varad, kohustused. Finantssektori tooted ja teenused ning nendega seotud riskid, sh hoiuse- ja laenuteenused, nende erinevad liigid. Liising ja faktooring. Rahvusvahelised arveldused. Eesti finantssüsteemi areng. Keskpank ja selle funktsioonid. Raharingluse ja pangandussüsteemi reguleerimine. Pankade aruandlus. Finantsjärelevalve ja Finantsinspektsiooni ülesanded. Kindlustuse funktsioonid ja liigid. Kindlustusteenused.",
          "descriptionEn": "Cash, its properties, quality standards, functions and types, alternatives to cash. Essence of financial mediation. Financial market. Parties in credit and insurance market, different types of financial mediators. Emergence of banks. Functions, assets and liabilities of banks. Products and services of financial sector and their risks, including deposit and loan services, their different types. Leasing and factoring. International transactions. Development of Estonian financial system. Central bank and its functions. Regulation of currency circulation and banking system. Banking reports. Financial supervision and the tasks of Financial Supervision and Resolution Authority. Functions and types of insurance. Insurance services.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30759
      },
      {
        "optional": false,
        "subject": {
          "id": 30754,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ016",
          "nameEt": "Tarneahela juhtimine",
          "nameEn": "Supply Chain Management",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada teadmised ja oskused tarneahela juhtimiseks.",
          "objectivesEn": "-Develop knowledge and skills for supply chain management.",
          "outcomesEt": "-Aine läbinud üliõpilane:\n•\trakendab tarneahela juhtimise ja logistikaga seotud mõisteid äriprotsesside seotuse selgitamisel ning juhtumiülesannete lahendamisel;\n•\tselgitab nõudluse ja pakkumise vahelisi seoseid ning tootmisvoo juhtimist;\n•\tkirjeldab ja analüüsib tarneahela põhiliike;\n•\trakendab logistikaga seonduvaid normdokumente;\n•\tseostab oskuslikult korraldatud tarneahela juhtimise ettevõtte tulemuslikkusega.",
          "outcomesEn": "-Student who has passed the subject:\n• applies concepts related to supply chain management and logistics in explaining the connection between business processes and solving case tasks;\n• explains the relationship between supply and demand and production flow management;\n• describes and analyzes the main types of supply chain;\n• implements normative documents related to logistics;\n• links skilfully organized supply chain management to company performance.",
          "descriptionEt": "Logistika põhimõisted. Hanke-, tootmis- ja jaotuslogistika. Logistilised protsessid ja kulud ettevõttes. Logistiliste teenuste ostmine ja allhanked (outsourcing). Tööd ja tegevused logistilises ketis. Tarneahela strateegiline juhtimine. Nõudluse ja pakkumise juhtimine ettevõttesiseselt ja ettevõtete vahel. . Ostu- ja müügi haldamine tarneahelas. Infosüsteemide kasutamine tarneahela võrgustikus. Kliendisuhete juhtimine ja tarneahela partnerite vaheline lõimumine. Säästliku mõtteviisi arendamine tarneahela juhtimises.",
          "descriptionEn": "-Basic concepts of logistics. Procurement, production and distribution logistics. Logistic processes and costs in the company. Purchasing and outsourcing of logistics services. Works and activities in the logistics chain. Strategic supply chain management. Demand and supply management within and between companies. Purchase and sales management in the supply chain. Use of information systems in the supply chain network. Customer relationship management and integration between supply chain partners. Developing a sustainable mindset in supply chain management.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30754
      },
      {
        "optional": false,
        "subject": {
          "id": 30758,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ020",
          "nameEt": "Finantsarvestus ja maksundus",
          "nameEn": "Financial Accounting and Taxation",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Anda vajalikud teadmised ja oskused ettevõtte finantsarvestusest ja maksundusest finantsotsuste tegemiseks.",
          "objectivesEn": "To provide the necessary knowledge and skills in corporate financial accounting and taxation to make financial decisions.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\ttunneb raha, varude ja materiaalse põhivara arvestusega kaasnevaid põhimõisteid, hinnanguid, arvestusmeetodeid; \n•\toskab etteantud majandustehingute põhjal koostada finantsaruandeid;\n•\tmõistab Eesti maksusüsteemi ning  maksumaksja õigusi ja kohustusi;\n•\tarvestab maksud ja maksed ning võrdleb nende vastavust õigusaktidegndlusele;a;täidab ja esitab maksudeklaratsioonid lähtuvalt õigusaktidest.",
          "outcomesEn": "Student who has passed the subject:\n• knows the basic concepts, estimates and accounting methods associated with the calculation of money, inventories and property, plant and equipment;\n• is able to prepare financial statements on the basis of given economic transactions;\n• understands the rights and obligations of the Estonian tax system and the taxpayer;\n• calculates taxes and payments and compares their compliance with the legislation, a) fills in and submits tax returns in accordance with the legislation.-",
          "descriptionEt": "Finantsarvestus\nKäibevara arvestus ja hindamine: raha arvestus, varude arvestus ja hindamine (varude jäägi ja kulu arvestamine kasutades FIFO ja kaalutud keskmise soetusmaksumuse meetodit, võrreldes tulemusi finantsaruannete seisukohalt). Põhivara arvestus ja hindamine: materiaalse ja immateriaalse põhivara ning kulumi arvestus (rakendades lineaarset, kahekordselt alaneva jäägi, kasutusaastate järjenumbrite summa ning tegevusmahupõhist meetodit, hinnates saadud tulemusi finantsaruannete seisukohalt). Kohustiste, tulude ja kulude arvestus. Etteantud majandustehingute põhjal finantsaruannete koostamine tabelarvutusprogrammis Excel ja raamatupidamisprogrammis Merit Aktiva. \nMaksundus\nFüüsilise isiku tulu maksustamine. Ettevõtlus ja maksustamine (tööjõukulud, erisoodustused, töölähetused, kingitused/annetused ja ettevõtlusega mitteseotud kulud, dividendid ja muud kasumieraldised). Sotsiaalmaks, töötuskindlustus ja kogumispensioni makse. Käibemaksmaksukohustuslaseks registreerimine ja registrist kustutamine, käibemaksumäärad ja maksuvaba käive. Eestis toimunud kaupade ja teenuste käibe maksustamine. Eksport. Import. Ühendusesisene kauba käive ja soetamine. Sisendkäibemaks. Arved. Käibemaksu arvutamine ning arvestamine. Käibemaksu tagastamine. Spetsiaalsed tarbimismaksud ja omandimaksud. Maksusüsteem. Maksuhalduri ja maksumaksja õigused ning kohustused, maksuseaduste rikkumised ja rakendatavad sanktsioonid. Maksuvõla ajatamine, sissenõudmine ja kustutamine,  vaidemenetlus.",
          "descriptionEn": "Financial accounting\nAccounting and valuation of current assets: cash accounting, inventory accounting and valuation (calculation of inventory balance and cost using FIFO and weighted average cost method, comparing results for financial statements). Accounting and measurement of property, plant and equipment: accounting for property, plant and equipment and intangible assets and depreciation (applying a straight-line, doubly decreasing balance, the sum of years of use and the activity-based method, evaluating the results for financial statements). Calculation of liabilities. Preparation of financial statements on the basis of given economic transactions in the spreadsheet program Excel and in the accounting program Merit Aktiva.\nTaxation\nTaxation of personal income. Entrepreneurship and taxation (labor costs, special benefits, business trips, gifts / donations and non - business expenses, dividends and other profit allocations). Social tax, unemployment insurance and funded pension payments. VAT registration and de-registration, VAT rates and tax-free turnover. Taxation of turnover of goods and services in Estonia. Export. Import. Intra - Community turnover and acquisition of goods. Input VAT. Bills. Calculation and calculation of VAT. VAT refund. Special consumption taxes and property taxes. Tax system. Rights and obligations of the tax authority and the taxpayer, violations of tax laws and applicable sanctions. Deferral, recovery and cancellation of tax debt, challenge procedure.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "E",
        "subjectId": 30758
      },
      {
        "optional": false,
        "subject": {
          "id": 30756,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ018",
          "nameEt": "Projektijuhtimine",
          "nameEn": "Project Management",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused projektitöö ja projektijuhtimise põhialuste loovaks rakendamiseks projektide koostamisel ja juhtimisel, võttes vastutuse tulemuste eest.",
          "objectivesEn": "To create opportunities for creative implementation of the basics of project work and project management in the design and management of projects, and taking responsibility for the results.",
          "outcomesEt": "Aine läbinud üliõpilane: \n●\torienteerub projektitöö ja projektijuhtimise valdkonna põhimõistetes;\n●\tmõistab projektipõhise juhtimise olemust ja protsessi;\n●\tsõnastab projekti probleemi ja eesmärgi, koostab projekti tegevuskava ja eelarve; \n●\tanalüüsib projekti sidusrühmi ning teostamisega kaasnevaid eeldusi ja riske; \n●\thindab projekti finantseerimisvõimalusi lähtudes hetke majandussituatsioonist ning vormistab nõuetekohase projekti;\n●\tomab ülevaadet tähtsamatest fondidest, taotluse tüüpidest Eestis ning suunab taotluse sobivale finantseerijale.",
          "outcomesEn": "The student having passed the course:\n•\tis familiar with the basic terms in the field of project work and project management;\n•\tunderstands the essence and process of project based management; \n•\tdefines the problem and objective of the project, prepares the project action plan and budget;\n•\tanalyses project stakeholders and the prerequisites and risks of carrying out the project;\n•\tevaluates financing opportunities of the project considering current economic situation, and writes a good project proposal;\n•\thas an overview of the most important funds and types of applications in Estonia, and sends the application to the appropriate financer.",
          "descriptionEt": "Projekti mõiste, olemus, tunnused, komponendid, projektide liigid.Projekti eesmärk, tegevused, oodatavad tulemused. Projektipõhise juhtimsie eripärasd. Projekti kavandamine, kavandamise eeldused, ülesanded, ajakava, vahendite planeerimine, kulude analüüs. Projekti eelarve koostamine, kululiigid, analüüs, kontroll ja aruandlus. Projekti koostamiseks vajalik taustinfo, projektide rahastamine Eestis. Projektijuhtimine, projekti edukuse tagamine, töö koordineerimine, koosolekud, koosolekute liigid. Projekti meeskond, meeskonnatöö, kommunikatsioon. Projekti kvaliteedi hindamine. Taotluste koostamine ja menetlemine, projekti elluviimine, aruandlus, projekti lõpetamine, projekti lõpparuanne. Võimalikud probleemid projektitöös.",
          "descriptionEn": "Project concept, nature, features, components, types of projects. Project goal, activities, expected results. Peculiarities of project-based management. Project planning, planning assumptions, tasks, schedule, resource planning, cost analysis. Project budgeting, cost categories, analysis, control and reporting. Background information necessary for project preparation, project financing in Estonia. Project management, ensuring the success of the project, coordination of work, meetings, types of meetings. Project team, teamwork, communication. Project quality assessment. Preparation and processing of applications, project implementation, reporting, project completion, project final report. Possible problems in project work.",
          "studyLiterature": "Kivimäe, S. (toim). (2003), Koosta oma projektitaotlus. Väike käsiraamat alustajatele. EMSL \nMarks, T. (2012) 20:20 Project Management, London; Philadelphia: Kogan Page\nPerens, A (2019) Praktiline projektijuhtimine, Tallinn: AS Pakett\nPerens, A (2001) Projekti juhtimine, Tallinn: Kirjastus Külim\nRahvusvahelise projektijuhtimise käsiraamat (2000), Siseministeerium\nThomas, R., Angus, B., Knight, J., (2013) Kasumlik projektijuhtimine, Tallinn: kirjastus  Äripäev",
          "evaluationEt": "Hindamiskriteerium/-ülesanne'                         Lävendikriteerium\n1.\tProjektipaketi  vastavus nõuetele -           projektipakett on koostatud rahastaja kehtivale taotlusvormile ning vastab rahastaja nõuetele; eelarve vastab rahastaja poolt seatud projekti toetustingimustele; taotlus on suunatud sobivale finantseerijale; taotlusdokumentide pakett on nõuetekohaselt vormistatud\n                                                                                paberkandjale; põhitaotlusele on lisatud kaaskiri koos tööjuhendis nõutavate lisadokumentidega;\n\n2.\tProjekti esitluse  vastavus nõuetele-       projektitaotluse tutvustus on koostatud esitlusprogrammis PowerPoint vmt ning esitlus mahub ette antud aja piiridesse. Esitluses tuuakse välja põhiinfo taotluse kohta. Esitluse koostamisel on lähtutud tööjuhendis esitatud nõuetest. Projekt on esitletud ja edukalt kaitstud.",
          "evaluationEn": "1. Eligibility of the project application -            the project application has been prepared on the valid application form of the financier and complies with the requirements of the financier; the budget meets the grant conditions set by the donor; the application is addressed to a suitable funder; the package of \n                                                                                application documents is duly completed on paper; the main application is accompanied by a cover letter with the additional documents required in the work instructions; \n2. Compliance of the project presentation with the requirements -         the presentation of the project application has been prepared in the presentation program PowerPoint, etc. and the presentation falls within the given time limits. The presentation provides basic information about the application. \n                                                                                                                             The presentation has been prepared in accordance with the requirements set out in the work instructions. The project has been presented and successfully defended.",
          "independentStudyEt": "Iseseisev töö ja hindamismeetodid:\nAinekursuse lõpptulemus kujuneb järgmistest hindamiskomponentidest: \n1)\tRühmatöödes ja ajurünnakutes osalemine \n2)\tIseseisev töö: konkreetse rahastaja nõuetele vastav projektitaotlus koos eelarvega \n3)\tProjekti esitlus kontakttunnis",
          "independentStudyEn": "Independent work and assessment methods:\nThe final result of the subject course consists of the following assessment components:\n1) Participation in group work and brainstorming\n2) Independent work: a project application meeting the requirements of a specific donor with a budget\n3) Presentation of the project in a contact hour",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30756
      },
      {
        "optional": false,
        "subject": {
          "id": 37517,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ063",
          "nameEt": "Tootmise korraldamine ja kvaliteeedijuhtimine",
          "nameEn": "Production Organization and Quality Management",
          "description": null,
          "credits": 6,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": null,
          "objectivesEt": "Anda teadmisi ja oskusi tootmiskorraldusest ning tutvustada erineva valdkonna tootmisettevõtete tootmiskorralduse iseärasusi. Kujundada tervikliku kvaliteedijuhtimise mudeli põhimõtetele tuginedes oskus siduda juhtimistegevusi kvaliteedijuhtimisega.",
          "objectivesEn": "To provide knowledge and skills about production organization and to introduce the peculiarities of production organization of production companies in different fields. Design the ability to link management activities with quality management based on the principles of the comprehensive quality management model.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Tootmiskorralduse põhimõisted, olemus, eesmärgid. Tootmises kasutatavad peamised ressursid. Tootmiskorralduses kasutatavad meetodid. Tootmiskorralduslik protsess, protsessi strateegia. Erineva valdkonna töötleva tööstuse tootmiskorralduslikud iseärasused. Protsesside tüübid ja nende kasutamine erinevates valdkondades. Protsesside üldine ülesehitus. Tootmise planeerimine, korraldamine, analüüsimine ja juhtimine. Tootmistsükkel ja tootmistüübid.Kvaliteedijuhtimise areng ja kasutatavad mõisted. Klient ja huvipooled. Tervikliku kvaliteedijuhtimise põhialused. Tervikliku kvaliteedijuhtimise mudelid ja raamistikud. Kvaliteedijuhtimise planeerimine. Kvaliteedijuhtimissüsteemi kavandamine, elluviimine, ja parendamine (sh sise- ja välishindamine). Organisatsiooni tulemuslikkuse hindamine.",
          "descriptionEn": "Basic concepts, nature, goals of production management. The main resources used in production. Methods used in production management. Production management process, process strategy. Production organizational features of the processing industry of different fields. Types of processes and their use in different fields. General structure of processes. Production planning, organization, analysis and management. Production cycle and production types. Development of quality management and concepts used. Customer and stakeholders. Fundamentals of total quality management. Total quality management models and frameworks. Quality management planning. Planning, implementation and improvement of the quality management system (including internal and external evaluation). Evaluation of organizational performance.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 37517
      },
      {
        "optional": false,
        "subject": {
          "id": 30740,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ003",
          "nameEt": "Äri-, võla- ja lepinguõigus",
          "nameEn": "Business, Obligations and Contract Law",
          "description": "-",
          "credits": 6,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmisi äri-, võlaõiguse ja lepinguõiguse regulatsioonist ja selle rakendamisest praktikas ning kujundada arusaam õigusliku regulatsiooni rollist erialas ja ühiskonnas.",
          "objectivesEn": "To provide knowledge about the regulation of business, debt and contract law and its implementation in practice and to form an understanding of the role of legal regulation in the profession and society.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\trakendab põhimõisteid, õiguslikku regulatsiooni ja printsiipe juhtumite või probleemide lahendamisel;\n•\tvalmistab ette vastavalt õiguslikule regulatsioonile äriühingute asutamise, juhtimise, ümberkujundamise, ühendamise, jagunemise ja lõpetamisega seonduvaid toiminguid ja dokumendid;\n•\tSeostab valdkonna õigusakte ja õigusaktides esitatud nõudeid ärijuhtumitega ja rakendab neid juhtumite lahendamisel.",
          "outcomesEn": "Student who has passed the subject:\n• applies basic concepts, legal regulations and principles in solving cases or problems;\n• prepares operations and documents related to the establishment, management, transformation, merger, division and dissolution of companies in accordance with the legal regulation;\n• Associates legislation and requirements in the field with business cases and applies them in resolving cases.",
          "descriptionEt": "Äriseadustik. Üldosa. Füüsilisest isikust ettevõtja. Täisühing. Usaldusühing. Osaühing. Aktsiaselts. Asutamine. Juhtimine ja lõpetamine. Filiaal. Ühinemine. Jagunemine. Ümberkujundamine. Tulundusühistuseadus. Tulundusühistu asutamine. Ühistu liikmed. Ühistu juhtimine. Ühistu lõpetamine. Pankrotiseadus. Pankrotimenetluse algatamine ja pankroti väljakuulutamine. Pankrotimenetluse organid. Võlgniku õigused ja kohustused. Nõuded pankrotimenetluses. Pankrotivara. Kompromiss. Saneerimine.\nVõlaõigus. Võlaõigusseadus. Ülevaade võlaõigusest. Võlaõiguse printsiibid. Lepingu mõiste ja liigid. Lepingu sõlmimine. Lepingute tõlgendamine. Lepingu vorm. Lepingute täitmine. Lepingu rikkumine. Võõrandamislepingud. Kasutuslepingud. Kindlustuslepingud. Teenuse osutamise lepingud.\nLepinguõigus. Võlaõigusseadus. Võlaõiguse eriosa. Võõrandamislepingute, kasutuslepingute, teenuseosutamis lepingute sõlmimine ja tingimused. Töölepingu seadus. Töösuhtealased kokkulepped. Koolituskulude hüvitamise kokkulepe. Ületunnitöö tegemise kokkulepe. Varalise vastutuse kokkulepe. Töötasu alandamise teade. Tööandja erakorralise töölepingu ülesütlemise avaldused. Teade töötasu vähendamise kohta. Nõuete tasaarvestamise avaldus. Ettevõtte ülemineku teatis. Võlaõiguslik konkurentsipiirangu ja ärisaladuse hoidmise kokkulepe. Renditööleping. Kompromissleping. Käsundusleping ja töövõtuleping. Sõlmimine ja vorm. Poolte õigused ja kohustused. Õiguskaitsevahendid. Lõppemine.",
          "descriptionEn": "Commercial Code. General part. The self-employed. General partnership. Limited partnership. Private limited company. Joint stock company. Establishment. Leadership and termination. Branch. Accession. Division. Transformation. Commercial Associations Act. Establishment of a commercial association. Cooperative members. Cooperative management. Dissolution of the cooperative. Bankruptcy Act. Initiation of bankruptcy proceedings and declaration of bankruptcy. Bankruptcy bodies. Rights and obligations of the debtor. Claims in bankruptcy proceedings. Bankruptcy estate. Compromise. Reorganization.\nLaw of obligations. Law of Obligations Act. Overview of the law of obligations. Principles of law of obligations. Definition and types of contract. Sign a contract. Interpretation of agreements. Form of contract. Performance of contracts. Breach of contract. Transfer agreements. User agreements. Insurance contracts. Service contracts.\nContract law. Law of Obligations Act. Special part of the law of obligations. Conclusion and conditions of transfer agreements, usage agreements, service provision agreements. Employment Act. Employment agreements. Agreement on the reimbursement of training costs. Overtime agreement. Liability agreement. Notice of reduction of remuneration. Applications for termination of an employer's extraordinary employment contract. Notice of reduction of remuneration. Statement of set - off. Business transfer notification. Debt restraint and trade secret agreement. Lease agreement. Compromise agreement. Authorization agreement and contract. Conclusion and form. Rights and obligations of the parties. Remedies. Expiration.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30740
      },
      {
        "optional": false,
        "subject": {
          "id": 30411,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ008",
          "nameEt": "Mikroökonoomika",
          "nameEn": "Microeconomics",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada teadmised majanduslikest meetoditest ja teooriatest, rakendades graafilisi, matemaatilisi ja verbaalseid meetodeid majandusmudelite kirjeldamisel ning majandussituatsioonide lahendamisel.",
          "objectivesEn": "To equip students with knowledge of economic methods and theories, using graphic, mathematical and verbal methods for describing economic models and solving economic situations.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\tomab süvateadmisi erinevatest majanduskäsitlustest, -meetoditest ning kaasaegse majandusteooria kujunemisest;\r\n•\tmõistab hinnamehhanismi, arvutab ja analüüsib nõudluse ja pakkumise elastsust;\r\n•\tselgitab tarbijate valikute teooriaid ja analüüsib optimaalse tootmismahu lähtuvalt etteantud situatsioonist;\r\n•\trakendab iseseisvalt graafilisi ja verbaalseid meetodeid majandusmudelite kirjeldamisel ning majandussituatsioonide lahendamisel.",
          "outcomesEn": "The student having passed the course:\n•\thas profound knowledge of different economic theories and methods, and the development of contemporary economic theory;\n•\tunderstands price determination, calculates and analyses the elasticity of supply and demand;\n•\texplains theories of consumer behaviour and determines the optimal production volume according to predetermined situations;\n•\tindependently utilises graphic and verbal methods to describe economic models and to solve economic situations.",
          "descriptionEt": "Mikroökonoomika olemus. Tarbimine, säästmine, investeerimine. Majandusressursside turg: tööjõu-, kapitali- ja maaturg. Nõudlus ja pakkumine, sh nõudluse ja pakkumise elastsus. Turg, turumudel. Hinnamehhanism. Konkurents ja selle liigid. Turuhäired. Tarbija ratsionaalne käitumine. Kardinaalne ja ordinaalne kasulikkus, eelistuste teooria. Ettevõtte tulude ja kulude liigitus. Optimaalse tootmismahu määramine.",
          "descriptionEn": "Essence of microeconomics. Consumerism, sustainability, investment. Market of economic resources: human resources, capital goods and land. Supply and demand, including the elasticity of supply and demand. Market, market model. Price determination. Competition and its types. Market dysfunction. Consumer behaviour. Cardinal and ordinal utility, theory of preferences. Classification of the company’s revenue and capital expenditure. Determination of the optimal production volume.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "E",
        "subjectId": 30411
      },
      {
        "optional": false,
        "subject": {
          "id": 30287,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMA013",
          "nameEt": "Ettevõtte rahandus",
          "nameEn": "Corporate Finance",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused toimetulekuks finantsotsuste langetamisel ning rakendatavate põhikontseptsioonide ning –tehnikate kasutamiseks.",
          "objectivesEn": "To create prerequisites for making financial decisions and utilisation of applicable key concepts and techniques.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\ttunneb ettevõtte rahanduse põhialuseid, mõistab kapitali olemust ja kaasamise tähtsust ettevõtte juhtimisel;\n•\tmõistab ettevõtte kapitali struktuuri kujunemist, tuues välja võimalikud riskid ja selle kaalutud keskmise hinna;\n•\trakendab raha ajaväärtuse kontseptsiooni.",
          "outcomesEn": "The student having passed the course:\n•\tknows the basic principles of corporate finance, understands the essence of capital and its incorporation in management;\n•\tunderstands the development of the structure of corporate capital, underlining possible risks and their weighted average cost;\n•\texploits the concept of time value of money.",
          "descriptionEt": "Ettevõtte rahastamise allikad. Rahastamine omakapitali abil: sisemine omakapital ja välimine omakapital. Hübriidfinantseerimine. Rahastamine laenukapitali abil: rahastamine panglaenude abil, rahastamine liisingute kaudu, võlasuhetel põhinevad teised rahastamisvõimalused. Spontaansed finantseerimisallikad. Kapitali hind ettevõttes. Laenukapital versus omakapital. Kapitali kaalutud keskmine hind. Kapitali struktuuri kujundamine. Liising ja faktooring. Risk ja kapital. Riski olemus ja riskikapitali mõiste. Riskikapitali väljumine ettevõttest. Raha ajaväärtus. Intressiarvutused: liht- ja liitintress, laenugraafikute koostamine. Annuiteet, perpetuiteet. Nominaalne ja reaalne intress. Üldised dividendipoliitika trendid. Dividendipoliitika levinumad teooriad. Ettevõtte dividendipoliitika hindamine.",
          "descriptionEn": "Sources of company financing. Financing with equity capital: internal and external equity. Hybrid financing. Financing with loan capital: bank loans, leases, other options. Spontaneous sources of financing. Value of corporate capital. Loan capital versus equity. Weighted average cost of capital. Capital structure design. Lease and factoring. Risk and capital. Essence of risk and definition of venture capital. Venture capital exit. Time value of money. Accounting for interest: simple and compound interest, generating loan schedules. Annuity, perpetuity. Nominal and real interest. General trends of dividend policy. Common theories of dividend policy. Assessment of corporate dividend policy.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "H",
        "subjectId": 30287
      },
      {
        "optional": false,
        "subject": {
          "id": 30755,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ017",
          "nameEt": "Äritarkvara",
          "nameEn": "Business Software",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada arusaam ettevõtte äriprotsesse toetava majandusinfosüsteemi võimalustest.",
          "objectivesEn": "To create understanding of the opportunities of the business information system that supports corporate business processes.",
          "outcomesEt": "Aine läbinud üliõpilane: \r\n•\tselgitab äritarkvara rolli ettevõtte eesmärkide saavutamisel ja äriprotsesside kaasajastamisel;\r\n•\tomab esmast ülevaadet kliendihaldus-, laohaldus- ja personalitarkvara registritest ja päringutest.",
          "outcomesEn": "The student having passed the course:\n•\texplains the role of the business software in gaining corporate objectives and innovating business processes;\n•\thas an overview of customer relationship, warehouse and human resources management software registers and enquiries.",
          "descriptionEt": "Äritarkvara (ERP) liigid, olemus ja eripärad võrreldes teiste kontoris kasutatavate programmidega. Ettevõttele sobiva programmi valiku põhimõtted. Kliendihaldussüsteemi (CRM) moodulid ja kasutamine. Laohaldussüsteemi (WMS) kasutamine. Personalihaldustarkvara kasutamine.",
          "descriptionEn": "Types, essence and specifications of business software (ERP) as compared to other office programs. Principles of choice for applicable corporate programs. Modules and utilisation of customer relationship management system (CRM). Utilisation of warehouse management system (WMS). Utilisation of human resources management software.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30755
      },
      {
        "optional": false,
        "subject": {
          "id": 30742,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ005",
          "nameEt": "Andmeanalüüs",
          "nameEn": "Data Analysis",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada üliõpilasel arusaam majanduses toimuvatest protsessidest ja oskus hinnata ning prognoosida rakendusuuringu tulemusi ning organisatsiooni majandustegevust statistilise analüüsi kaudu.",
          "objectivesEn": "To develop the student's understanding of the processes taking place in the economy and the ability to evaluate and forecast the results of applied research and the economic activity of the organization through statistical analysis.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\tomab teadmisi andmeanalüüsi põhilistest meetoditest ja kasutusvaldkondadest;\r\n•\trakendab loovalt kirjeldava ja üldistava statistika põhilisi meetodeid praktiliste erialaülesannete lahendamisel ning uuringuandmete analüüsimisel ja tulemuste kriitilisel tõlgendamisel, kasutades tabelarvutusprogrammi võimalusi;\r\n•\tanalüüsib andmeid nii tabeli kui ka graafilisel kujul, leiab sobivaid arvkarakteristikuid ning sõnastab analüüsi tulemuste põhjal järeldused.",
          "outcomesEn": "Student who has passed the subject:\n• has knowledge of the main methods and areas of use of data analysis;\n• creatively applies the basic methods of descriptive and generalizing statistics in solving practical professional tasks and in analyzing survey data and critically interpreting the results, using the possibilities of a spreadsheet program;\n• analyzes the data both in tabular and graphical form, finds suitable numerical characteristics and formulates conclusions based on the results of the analysis.",
          "descriptionEt": "Andmeanalüüsi liigid ja etapid ning kasutamisvaldkonnad. Valimi moodustamise põhimõtted. Tabelarvutusprogrammi abil kirjeldavate statistikute leidmine, arvjooniste loomine ja kujundamine. Korrelatsioon, andmete intervallimine ja üldkogumile usaldusvahemiku hinnangute leidmine. Klassikaliste statistiliste jaotiste kasutamine prognoosimisel. Kahepoolsete hüpoteeside püstitamine ja kontroll t- testi abil. Tabelarvustusprogrammi statistika- , prognoosi- ja aruannete moodulite kasutamine andmeanalüüsis ning organisatsiooni majandusnäitajate hindamisel.\r\n ",
          "descriptionEn": "Types and stages of data analysis and areas of use. Sampling principles. Finding descriptive statisticians, creating and designing numerical figures using a spreadsheet program. Correlation, data intervaling, and finding confidence interval estimates for the population. Use of classical statistical sections in forecasting. Establishment and testing of bilateral hypotheses by means of a t-test. Use of statistical, forecasting and reporting modules of the spreadsheet program in data analysis and evaluation of the organization's economic indicators.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30742
      },
      {
        "optional": false,
        "subject": {
          "id": 30738,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ001",
          "nameEt": "Organisatsioonikäitumine",
          "nameEn": "Organisational Behaviour",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Ette valmistada organisatsioonikäitumise valdkonnas  probleemide lahendamise oskusega spetsialiste.",
          "objectivesEn": "To prepare specialists with problem solving skills in the field of organizational behavior.",
          "outcomesEt": "-Aine läbinud üliõpilane:\n•\ttunneb inimese tööalast käitumist ja tegevust mõjutavaid tegureid ning arvestab isiksuse eripäradega ja meeskonnatöö põhimõtetega igapäevaste juhtimis- ja suhtlemisprobleemide lahendamisel ning organisatsiooni kujundamisel;\n•\tanalüüsib inimese ja organisatsiooni omavahelisi seoseid ja sõltuvusi;\n•\tmääratleb oma töövaldkonnas tekkinud organisatsioonikäitumisega seotud probleemsituatsioonid, analüüsib neid ning tuginedes peamistele organisatsiooniteooriatele ja pakub välja võimalikke sh uuenduslikke lahendusviise;\n•\ton salliv hoiakute ning väärtuste mitmekesisuse suhtes organisatsioonis.",
          "outcomesEn": "-Student who has passed the subject:\n• knows the factors influencing a person's professional behavior and activities and takes into account the specifics of the personality and the principles of teamwork in solving everyday management and communication problems and in shaping the organization;\n• analyzes the relationships and dependencies between a person and an organization;\n• identifies problem situations related to organizational behavior that have arisen in his / her field of work, analyzes them and, based on the main organizational theories, and suggests possible, including innovative solutions;\n• is tolerant of the diversity of attitudes and values ​​in the organization.",
          "descriptionEt": "Organisatsioonikultuur. Inimene organisatsioonis. Motivatsioon; inimvajadused, käitumise muutmine, hüvitamine. Osalusdemokraatia. Liidristiilid.  Suhtlemine ja suhted. Konfliktid. Võim ja poliitika. Rühm ja rühmatöö kasutamine.",
          "descriptionEn": "-\nOrganizational culture. A person in an organization. Motivation; human needs, behavior change, compensation. Participatory democracy. Leadership styles. Communication and relationships. Conflicts. Power and politics. Group and use of group work",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30738
      },
      {
        "optional": false,
        "subject": {
          "id": 30412,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ009",
          "nameEt": "Makroökonoomika",
          "nameEn": "Macroeconomics",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Anda ülevaade majandusnäitajate süsteemist ning kujundada oskus rakendada majanduslikke meetodeid ja teooriaid.",
          "objectivesEn": "To give an overview of economic indicators and develop the skills of implementation of economic methods and theories.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\torienteerub ja loob seoseid majandusnäitajate süsteemis ning majanduspoliitikas;\r\n•\tomab kriitilist arusaama majanduse erinevate sektorite vahelistest seostest;\r\n•\trakendab iseseisvalt sobivaid majanduslikke meetodeid ja teooriaid eriala situatsioonülesannetes.",
          "outcomesEn": "The student having passed the course:\n•\tinterprets the system of business data and economic policy; and creates connections;\n•\tcritically examines connections between different economic sectors;\n•\tindependently applies appropriate economic methodology and theories in professional situational tasks.",
          "descriptionEt": "Makroökonoomika olemus. Rahvamajanduse arvepidamine. Kogunõudlus ja kogupakkumine. Majandussektorid. Makromajandusliku tasakaalu lihtne mudel. Tööhõive ja töötus. Töötuse ja inflatsiooni seos. Inflatsiooni liigid, ulatus, -spiraalid. Inflatsiooni mõõtmine. Inflatsiooni majanduslikud tagajärjed. Raha pakkumine ja nõudlus. Rahaturu tasakaal. Rahvusvaheline rahasüsteem. Keskpank ja kommertspankade süsteem. Fiskaalpoliitika. Avatud majandus ja maksebilanss. Väliskaubandus. Eksport ja import.",
          "descriptionEn": "Essence of macroeconomics. National accounts. Aggregate supply and demand. Economic sectors. Simple model of macroeconomic balance. Employment and unemployment. Unemployment and inflation. Types, scope and spirals of inflation. Measuring inflation. Economic consequences of inflation. Money supply and demand. Balance of cash market. International monetary system. Central bank and system of commercial banks. Fiscal policy. Open economy and balance of payments. Foreign trade. Exports and imports.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30412
      },
      {
        "optional": false,
        "subject": {
          "id": 30757,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ019",
          "nameEt": "Finantsarvestus",
          "nameEn": "Financial Accounting",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "•Anda vajalikud teadmised finantsarvestuse põhimõistetest ja arvestuspõhimõtetest.",
          "objectivesEn": "-To provide the necessary knowledge of the basic concepts and principles of financial accounting.",
          "outcomesEt": "•\tdefineerib ja eristab ettevõtte varasid, kohustisi ja omakapitali, tulusid ja kulusid;\n•\tselgitab majandustehingute olemust, kahekordset kirjendamist, kontode ülesehitust ja nõudeid algdokumendile ja arvestusregistritele; \n•\tkirjendab lihtsamaid majandustehinguid ning koostab pearaamatu, proovibilansi ja kasumiaruande ning tõlgendab finantsaruandeid.",
          "outcomesEn": "defines and distinguishes the company's assets, liabilities and equity, income and expenses;\n• explains the nature of economic transactions, double entry, structure of accounts and requirements for source document and accounting records;\n• records simpler economic transactions and prepares general ledger, trial balance sheet and income statement and interprets financial statements",
          "descriptionEt": "Finantsarvestuse olemus, info kasutajad, raamatupidamises kasutatav seadusandlus. Bilanss, bilansi elemendid, bilansikirjed. Bilansis toimuvate muudatuste liigid. Konto mõiste, ülesehitus ja liigid. Kahekordne kirjendamine, lausend. Kontoplaan. Nõuded algdokumentidele ja arvestusregistritele Kasumiaruannete ülesehitus ja kirjete sisu.",
          "descriptionEn": "The nature of financial accounting, information users, legislation used in accounting. Balance sheet, balance sheet items, balance sheet items. Types of changes in the balance sheet. Definition, structure and types of account. Double entry, sentence. Chart of accounts. Accounting documents and accounting registers. Structure of income statements and content of items.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30757
      },
      {
        "optional": false,
        "subject": {
          "id": 30741,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ004",
          "nameEt": "Äristatistika",
          "nameEn": "Business Statistics",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada üliõpilasel arusaam majanduses toimuvatest protsessidest ja äristatistilise analüüsi põhinäitajatest ning oskus neid arvutada või andmebaasidest leida.",
          "objectivesEn": "To develop the student's understanding of the processes taking place in the economy and the basic indicators of business statistical analysis and the ability to calculate them or find them in databases.",
          "outcomesEt": "Aine läbinud üliõpilane: \n• omab teadmisi äristatistika põhilistest meetoditest;\n• koostab eesmärgipärase elektroonilise küsimustiku;\n• analüüsib statistilisi andmeid nii tabeli kui ka graafilisel kujul, leiab sobivaid arvkarakteristikuid ning sõnastab analüüsi tulemuste põhjal järeldused;\n• leiab ja mõistab teisestes andmebaasides avaldatud äristatistilist informatsiooni;\n• kasutab majandusnäitajate statistilise analüüsi tulemusi organisatsiooni majandustegevuse hindamiseks ja prognoosimiseks.",
          "outcomesEn": "-",
          "descriptionEt": "Ühe- ja mitmemõõtmelise ning üldistava statistika olemus. Valimi moodustamise põhimõtted. Andmete kogumine ja küsimustike ning andmebaaside koostamine. \nKirjeldavad statistilised arvkarakteristikud: suhtarvud ja keskmised, variatsiooninäitarvud. Aegread. Arvjoonised. Statistilised seosed. Üldistava statistika alused.  Teisesed andmebaasid äristatistika leidmiseks.  Statistiliste tekstide mõistmine.  \nOrganisatsiooni majandustegevuse hindamine ja prognoosimine",
          "descriptionEn": "The nature of univariate, multivariate and generalized statistics. Sampling principles. Data collection and preparation of questionnaires and databases.\nDescriptive statistical numerical characteristics: ratios and averages, variation indicators. Time series. Figures. Statistical relationships. Basics of general statistics. Secondary databases for finding business statistics. Understanding statistical texts.\nEvaluation and forecasting of the organization's economic activity.",
          "studyLiterature": "-",
          "evaluationEt": "Aines sooritatakse mitteeristava hindamisega meeskonnatöö ja individuaalne eristava hindamisega eksamitöö.",
          "evaluationEn": "In the subject, team work with non-differentiated assessment and individual exam work with differentiable assessment are performed.",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30741
      },
      {
        "optional": false,
        "subject": {
          "id": 30744,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ007",
          "nameEt": "Majanduspoliitika",
          "nameEn": "Economic Policy",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada teadmised kaasaegse majandusteooria kujunemisest, majanduskeskkonnast, majanduslikest meetoditest ja trendidest.",
          "objectivesEn": "-To form knowledge about the development of modern economic theory, economic environment, economic methods and trends.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\torienteerub peamistes majanduspoliitika teooriates;\r\n•\tseostab trende majanduses majanduspoliitiliste meetmetega;\r\n•\tmõistab majandusprognooside, -analüüside jms teabe sisu, tuginedes majanduspoliitika teooriatele.",
          "outcomesEn": "-Student who has passed the subject:\n• orients himself / herself in the main theories of economic policy;\n• links economic trends to economic policy measures;\n• understands the content of economic forecasts, analyzes and similar information, based on economic policy theories.",
          "descriptionEt": "Majanduspoliitiline teooria, filosoofia ja selle kujunemise tagamaad. Riigi funktsioonid, sekkumine, konkurentsivõime. Riikliku majandustegevuse eesmärgid. Turumajandus ja kapitalism, riikide avatus. Sotsiaalne turumajandus. Valitsuse majanduspoliitika. Majanduskasv, majandustsüklid ja -kriisid. Majandusarengu jätkusuutlikkus.",
          "descriptionEn": "-Economic policy theory, philosophy and the background of its formation. State functions, intervention, competitiveness. Objectives of public economic activity. Market economy and capitalism, openness of states. Social market economy. Government economic policy. Economic growth, economic cycles and crises. Sustainability of economic development.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30744
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 220,
        "nameEt": "Personalijuhtimine",
        "nameEn": "Personnel Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      },
      {
        "id": 218,
        "nameEt": "Finantsjuhtimine",
        "nameEn": "Financial Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Erialaõpe. Finantsjuhtimine",
    "nameEn": "Specialty Subjects",
    "orderNr": 3,
    "objectivesEt": null,
    "objectivesEn": null,
    "outcomesEt": null,
    "outcomesEn": null,
    "typeNameEt": "Erialaained",
    "typeNameEn": "Specialty subjects",
    "totalCredits": 33,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 33,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Muu (kasutajal on võimalik ise kirjeldada mooduli liiki)",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 38710,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ023",
          "nameEt": "Uurimistöö",
          "nameEn": "Research Paper",
          "description": null,
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": null,
          "objectivesEt": "Luua võimalused omandatud teadmiste ja oskuste rakendamiseks uurimistöö koostamisel ja tulemuste esitlemisel.",
          "objectivesEn": "To create opportunities for the exploitation of acquired knowledge and skills in the preparation of research paper and presentation of results.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Uurimistöö on teoreetilise iseloomuga iseseisev töö, mille koostamisel üliõpilane demonstreerib erialase kirjanduse läbitöötamise ja erinevatest allikatest pärit teemakohaste teoreetiliste käsitluste põimimise ja akadeemilise kirjutamise oskust. Lisaks teemakohasele teoreetilisele käsitlusele kavandab üliõpilane uurimistöö käigus lõputöö metoodika, mis näitab üliõpilase oskust rakendada teadmisi uurimistöö koostamise metoodikast, andmekogumise ja andmeanalüüsi meetoditest ning valimi kujundamisest.",
          "descriptionEn": "A research paper is an independent work of a theoretical nature, in the preparation of which the student demonstrates the ability to study professional literature and interweave theoretical approaches from various sources and academic writing. In addition to the theoretical approach to the topic, during the research, the student plans the thesis methodology, which demonstrates the student's ability to apply knowledge of the research methodology, data collection and data analysis methods, and sample design.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 38710
      },
      {
        "optional": false,
        "subject": {
          "id": 30282,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMA008",
          "nameEt": "Auditi alused",
          "nameEn": "Basics of Auditing",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmised audiitorkontrolli põhimõtetest, audiitortegevust sätestavatest tähtsamatest dokumentidest, audiitortegevuse organiseerimisest, audiitorkontrolli protseduuridest ja meetoditest. Kujundada ja kinnistada teadmised ja oskused ettevõtte sisekontrollisüsteemi loomiseks ja toimimise korraldamiseks, sh siseauditeerimise info kasutamiseks ettevõtte riskijuhtimises.",
          "objectivesEn": "To provide students with knowledge of the principles, key documents, organisation, procedures and methods of auditing. To develop and embed knowledge and skills for the design and operation of the auditing system, including utilisation of internal auditing in corporate risk management.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\tteab vandeaudiitori ülesandeid, õigusi, kohustusi ja vastutust;\n•\tteab audiitorkontrolli läbiviimise üldpõhimõtteid ja protseduure, tunneb audiitortegevust reglementeerivaid dokumente (sh eetikakoodeksit) ja audiitorkontrollil kasutatavaid meetodeid;\n•\tmõistab sisekontrolli olemust ja tähtsust ettevõttes;\n•\ttunneb sisekontrollisüsteemi mudeleid; \n•\tanalüüsib, hindab ja haldab ettevõttesiseseid ning -väliseid riske;\n•\tmõistab siseauditi olemust, tähtsust ja rolli ettevõtte sisekontrollisüsteemis;\n•\ttunneb õigusaktides ja siseauditi standardites sätestatud põhimõtteid, norme ning kutse-eetikat siseauditi läbiviimisel;\n•\tteab raamatupidamise aastaaruande auditeerimise korda ja vandeaudiitori arvamuse tüüpe.",
          "outcomesEn": "The student having passed the course:\n•\tknows the tasks, rights, liabilities and responsibility of a statutory auditor;\n•\tknows general principles and procedures of auditing, knows regulation documents of auditing (incl. The Code of Ethics) and methods of auditing;\n•\tunderstands the essence and importance of corporate auditing;\n•\tknows the models of auditing systems;\n•\tanalyses, assesses and manages inside and outside risks of the company;\n•\tunderstands the essence, importance and role of internal auditing in the internal corporate audit system;\n•\tknows the principles, norms and work ethics stated in legal acts and internal audit standards in carrying out internal auditing;\n•\tknows the regulations of auditing the annual financial report, and types of opinions of the statutory auditor.",
          "descriptionEt": "Audiitorkontrolli eesmärk ja objekt, auditite liigid. Audiitorkontrolli organisatsioonid. Audiitori kompetentsus ja kogemus. Audiitorettevõtja kutsetegevuse liigid. Vandeaudiitori kutsetegevuse raamistik. Auditi planeerimine, riskide hindamine. Auditi läbiviimine. Sisekontrollisüsteemi mudelid ja sisekontrollisüsteemi loomine ettevõttes. Sisekontrolli küsimustike koostamine. Siseauditeerimise kutsetegevuse raampõhimõtted ja standardid, siseaudiitorite eetikakoodeks. Ettevõtte riskide hindamine, protsesside kaardistamine ja siseauditeerimisele kuuluvate valdkondade määratlemine. Riskide haldamine. Siseauditi info kasutamine välisauditis. Sise- ja välisaudiitorite koostöö. Välis- ja siseauditi leidude dokumenteerimine. Auditi toimikute koostamine. Vandeaudiitori aruanded. Auditi kvaliteedi tagamine ja auditi kvaliteedi mõõtmine. Raamatupidamise aastaaruande auditeerimine.",
          "descriptionEn": "Objective and object of auditing, types of auditing. Auditing organisations. Competence and experience of the auditor. Types of professional auditor activities. Frame of statutory auditor’s professional activities. Audit planning, risk management. Carrying out auditing. Models of internal audit system and design of internal corporate audit system. Preparation of internal audit questionnaire. Key principles and standards of professional internal audit activities, internal auditor’s code of ethics. Corporate risk assessment, process mapping and defining the areas of auditing. Risk management. Utilisation of the results of internal audit in external audit. Cooperation of internal and external auditors. Documentation of the findings of internal and external auditors. Preparation of audit dossiers. Statutory auditor’s reports. Assurance and measurement of audit quality. Audit of the annual financial report.",
          "studyLiterature": "-",
          "evaluationEt": null,
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "H",
        "subjectId": 30282
      },
      {
        "optional": false,
        "subject": {
          "id": 30291,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMA016",
          "nameEt": "Finantsanalüüs",
          "nameEn": "Financial Analysis",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada oskus analüüsida erineva suurusega ettevõtete finantsmajanduslikku olukorda, kasutades sobivat finantsanalüüsi metoodikat ning sõnastada analüüsist tulenevaid juhtimisotsuseid.",
          "objectivesEn": "To develop the skill to analyse the financial and economic situation in enterprises of different size utilising relevant financial analysis methods, and formulate management decisions based on the analysis.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tomab süvateadmisi finantsanalüüsi olemusest ja eesmärkidest, põhjendab finantsanalüüsi vajalikkust erineva suurusega ettevõtetes ning hindab kriitiliselt finantsanalüüsile esitatavaid nõudeid ja tunneb finantsanalüüsi infobaasi;\n•\tanalüüsib erineva suurusega ettevõtete põhilisi finantsaruandeid – bilanssi, kasumiaruannet, rahavoogude aruannet ja ettevõtte finantstegevuse erinevaid valdkondi (maksevõimet, efektiivsust sh tootlikkust, tasuvust, aktsiate väärtusnäitajaid, finantsseisundit), kasutades sobivat infobaasi, analüüsi võtteid, meetodeid ja valemeid, põhjendab tehtud valikut;\n•\tteeb analüüsi põhjal järeldusi ja ettepanekuid erineva suurusega ettevõtete finantsolukorra parendamiseks ning sõnastab finantsalaseid juhtimisotsuseid (eesti keeles ja ka ühes võõrkeeles), toetudes teoreetilistele seisukohtadele ja analüüsile.",
          "outcomesEn": "The student having passed the course:\n•\thas profound knowledge of the essence and objectives of financial analysis, justifies the necessity of financial analysis in enterprises of different size, and critically assesses the requirements for financial analysis, and knows the information databases of financial analysis;\n•\tanalyses major financial reports of enterprises of different size, e.g. balance sheet, profit and loss statement, cash flow statement, and analyses different fields of financial activities (solvency, effectiveness, incl. productivity, profitability, share values, financial status), utilising a relevant database, analysis techniques, methods and formula, and justifies the choice;\n•\tdraws conclusions and makes proposals for the improvement of the financial status of enterprises of different size based on the analysis; and formulates financial management decisions (in Estonian and in one foreign language), based on theoretical standpoints and analysis.",
          "descriptionEt": "Finantsaruannete analüüsimise arengust. Finantsanalüüsi sisu, tähtsus/vajalikkus, eesmärgid. Finantsanalüüsi etapid, meetodid ja infoallikad. Põhiliste finantsaruannete analüüs. Maksevõime analüüs. Efektiivsuse ja tootlikkuse analüüs. Tasuvuse analüüs. Pankrotiohu/finantsseisundi analüüs. Aktsiate väärtusnäitajate analüüs. Erinevate arvestuspõhimõtete, hinnangute ja tegevuste mõju finantstulemustele. Analüüsi põhjal järelduste, ettepanekute ja juhtimisotsuste tegemine finantsolukorra parendamiseks.",
          "descriptionEn": "Development of the analysis of financial reports. Content, importance/necessity, objectives of financial analysis. Stages, methods and databases of financial analysis. Analysis of major financial reports. Analysis of solvency. Analysis of effectiveness and productivity. Analysis of profitability. Analysis of bankruptcy threat/financial situation. Analysis of stock value figures. Influence of different accounting principles, evaluations and activities on financial results. Drawing conclusions, making proposals and management decisions according to the analysis to improve financial situation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30291
      },
      {
        "optional": false,
        "subject": {
          "id": 30413,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ010",
          "nameEt": "Uurimistöö metoodika",
          "nameEn": "Research Methods",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused omandatud teadmiste ja oskuste rakendamiseks uurimistöö koostamisel, analüüsi läbiviimisel ja tulemuste esitlemisel.",
          "objectivesEn": "To create possibilities for implementation of acquired knowledge and skills in the preparation of research paper, carrying out the analysis and presentation of results.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\teristab uurimistöö etappe ja toob välja seoseid erinevate etappide vahel;\n●\tkirjeldab oma valdkonna valitud uurimisteemale kohast uurimisprobleemi, seab uurimiseesmärgi ning uurimisülesanded või -küsimused;\n●\tesitab teemakohase kirjanduse loetelu uurimistöö läbiviimiseks;\n●\tvõrdleb peamisi uurimisstrateegiaid ning andmekogumis- ja analüüsimeetodeid;\n●\tvalib uurimisprobleemidest lähtuvalt kohase uurimismetoodika ning kavandab süsteemselt uuringu läbiviimise;\n●\tkirjeldab valimi moodustamise põhimõtteid ja kasutab neid oma uurimuse kavandamisel.",
          "outcomesEn": "The student having passed the course:\n•\tdifferentiates the stages of research and points out their relationships;\n•\tdescribes the research problem chosen according to the research topic in their field, establishes the research objective and research tasks or questions;\n•\tlists topic based resources to carry out the research;\n•\tcompares major research strategies and methods for data collection and analysis;\n•\tchooses the appropriate research method according to the research problems and systematically plans preparation of the study;\n•\tdescribes the principles of the choice of research sample and utilises them in planning their research.",
          "descriptionEt": "Uurimistöö spetsiifika ja koht uuringutes. Uuringu kavandamise protsess. Uurimisteema valiku protsess. Uurimistöö etapid. Probleemi sõnastamine uuringu alusena. Uuringu eesmärgi ja uurimisülesannete (-küsimuste) sõnastamine. Teooria mõiste ja tähtsus uuringus. Teooria ja praktika vaheline suhe (deduktsioon vs induktsioon). Teabeallikate määratlemine: esmaste ja teiseste andmete analüüs uuringutes. Hüpoteesi püstitamine, hüpoteesi roll uuringus. Kvantitatiivne, kvalitatiivne ja kombineeritud uuring ning nende erinevused. Andmete kogumise ja analüüsimise meetodid. Valimi moodustamise põhimõtted.",
          "descriptionEn": "Specifications and role of research paper in research. Process of research planning. Process of choosing the topic. Stages of research. Formulating the problem as a basis for research. Formulating research objective and tasks/questions. Concept and importance of theory in research. Relationship between theory and practice (deduction vs induction). Determination of information sources: analysis of primary and secondary data in research. Stating hypothesis, role of hypothesis in research. Quantitative, qualitative and combined research and their differences. Methods of data collection and analysis. Principles of sampling.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30413
      },
      {
        "optional": false,
        "subject": {
          "id": 30414,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ011",
          "nameEt": "Lõputöö seminar",
          "nameEn": "Graduation Thesis Seminar",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua eeldused erialase lõputöö/miniuuringu koostamiseks ja edukaks kaitsmiseks.",
          "objectivesEn": "To create prerequisites for preparation and successful defence of specialty graduation thesis/mini research.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\tmõistab lõputöö/miniuuringu läbiviimise ja akadeemilise teksti koostamise nõudeid;\n●\tsüvendab teadmisi lõputöö/miniuuringu koostamise metodoloogilistest põhimõtetest ja vormistamisest;\n●\trakendab empiirilise uuringu läbiviimiseks kavandatud  andmekogumis- ja analüüsimeetodeid.",
          "outcomesEn": "The student having passed the course:\n•\tunderstands the requirements for the preparation of the graduation thesis/mini research and academic writing;\n•\tunderstands the methodological principles and editing requirements of the graduation thesis/mini research;\n•\tutilises planned data collection and analysis methods to carry out the empirical research.",
          "descriptionEt": "Lõputöö ülesehitus. Lõputöö pealkirja, probleemi, eesmärgi, uurimisülesannete ja uuringu seostamine. Uurimisprobleemi sidusus empiirilise uuringu eesmärgi ja uurimisülesannetega. Uuringu teoreetilise aluse ja andmeanalüüsi sidusus. Kvantitatiivsed ja kvalitatiivsed uurimismeetodid, nende kasutamise põhjendamine. Andmete analüüs ja tulemuste esitamine empiirilises uuringus. Kirjalike tööde vormistuslike nõuete kinnistamine. Resümee koostamise alused.",
          "descriptionEn": "Structure of the graduation thesis. Alignment of title, problem, aim, research task and research. Coherence of theoretical basis of the research study and data processing. Quantitative and qualitative research methods, justification of their utilisation. Data processing and presentation of results in empirical research. Guidelines for formal writing in research studies. Basics of summary writing.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30414
      },
      {
        "optional": false,
        "subject": {
          "id": 30292,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMA017",
          "nameEt": "Finantsjuhtimine",
          "nameEn": "Financial Management",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada oskus analüüsida ja hinnata rahaliste vahendite juhtimist lähtuvalt finantseesmärkidest ning sõnastada analüüsist tulenevad juhtimisotsused.",
          "objectivesEn": "To develop the skill to analyse and evaluate the management of finances according to the financing objectives, and formulate the management decisions derived from the analysis.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\tselgitab finantsjuhtimise eesmärke ja ülesandeid ning tuvastab ettevõtte finantsjuhtimise spetsiifilised probleemid;\r\n•\tanalüüsib ja hindab käibekapitali, põhivarade ja kohustiste juhtimist; \r\n•\tanalüüsib erinevaid kapitali hankimise ja paigutamise võimalusi ning teostab tasuvusarvutusi; \r\n•\tdefineerib finantsriske ja kasutab neid finantsinstrumentide maandamiseks;\r\n•\tkavandab finantstulemusi järgmiseks perioodiks, toob välja erinevate alternatiivide mõju ettevõtte finantsseisundile ja –tulemusele ning sõnastab juhtimisotsused;\r\n•\thindab ettevõtte väärtust rakendades erinevaid hindamismeetodeid;\r\n•\tanalüüsib tegevusaruande sisu ja vastavust nõuetele ning teeb parendusettepanekuid.",
          "outcomesEn": "The student having passed the course:\n•\texplains the objectives and tasks of financial management, and detects specific problems of corporate financial management;\n•\tanalyses and evaluates the management of working capital, fixed assets and liabilities;\n•\tanalyses different options for gaining and investing capital, and is able to measure return on investment;\n•\tdefines financial risks and utilises them to lower risks of financial instruments;\n•\tforecasts financial results for the future period, points out the effect of different alternatives on corporate financial situation and results, and formulates management decisions;\n•\tevaluates the value of the company utilising different assessment methods;\n•\tanalyses the content and compatibility of the activity report with the requirements, and makes improvement proposals.",
          "descriptionEt": "Finantsjuhtimise olemus, eesmärgid ja meetodid. Finantsjuhtimise korraldus. Ettevõtte kolm põhiaruannet (bilanss, kasumiaruanne ja rahavoogude aruanne) ja nende seosed. Info liikumine ühest aruandest teise ettevõtte finantsressursside planeerimise, analüüsimise ja juhtimise seisukohalt. Käibekapitali (raha, nõuded, varud, lühiajalised kohustised) juhtimine. Põhivarade juhtimine: soetusmaksumuse, kasuliku eluea määramine, amortisatsioonimeetodi valik. Krediidipoliitika. Investeeringute planeerimine ja finantseerimine. Kapitali hankimise võimalused. Finantsriskid ja nende maandamise võimalused. Reaalinvesteeringu otsustuskriteeriumid - tasuvusaeg, diskonteeritud tasuvusaeg, praegune puhasväärtus, kasumiindeks, sisemine rentaablus. Diskonteerimine, risk ja tulu. Projekti tasuvuse hindamine. Dividendipoliitika. Tegevusaruande eesmärk ja sisu. Ettevõtte väärtus, selle mõjutegurid ja hindamine.",
          "descriptionEn": "Essence, objectives and methods of financial management. Organisation of financial management. Three basic corporate reports (balance sheet, profit and loss statement and cash flow statement) and their relationship. Information flow between different reports from the perspective of planning, analysing and management of corporate financial resources. Management of working capital (cash, receivables, inventory, short term liabilities). Management of fixed assets: original cost, determination of useful life, choice of amortisation method. Credit policy. Planning and financing of investments. Options for gaining capital. Financial risks and possibilities for lowering the risks. Decision criteria for real investments – payback period, discounted payback period, net present value, profitability index, internal rate of return. Discounting, risk and profit. Evaluation of projects on return of investment. Dividend policy. Objective and content of the activity report. Value of the company, its influencing factors and evaluation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30292
      },
      {
        "optional": false,
        "subject": {
          "id": 30761,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ023",
          "nameEt": "Investeeringute analüüs",
          "nameEn": "Investment Analysis",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused kompaktselt rakendada finants- ja investeeringute kavandamise oskusi, mis on aluseks finantsplaneerimisel.",
          "objectivesEn": "Create opportunities to apply financial and investment planning skills as a basis for financial planning in a compact way.",
          "outcomesEt": "-Aine läbinud üliõpilane:\n•\tomab kriitilist arusaama finantskavandamise süsteemist ja prognoosimise korraldusest ettevõttes;\n•\tplaneerib ja oskab koostada erinevate valdkondade eelarveid (sh investeeringud) juhtimisotsuste langetamiseks ja finantstegevuse kontrollimiseks;\n•\tanalüüsib erinevaid investeerimisvõimalusi, strateegiaid ja riske;\n•\thindab investeeringu tasuvust erinevate hindamiskriteeriumite alusel ning sõnastab investeerimisotsuseid.",
          "outcomesEn": "Student who has passed the subject:\n• has a critical understanding of the financial planning system and forecasting organization in the company;\n• plans and is able to prepare budgets for various areas (incl. Investments) for making management decisions and controlling financial activities;\n• analyzes various investment opportunities, strategies and risks;\n• evaluates the return on investment on the basis of various evaluation criteria and formulates investment decisions.",
          "descriptionEt": "Investeerimise mõiste ja olemus. Risk ja investeerimisotsused, investeerimisstrateegiad.",
          "descriptionEn": "Definition and nature of investment. Risk and investment decisions, investment strategies.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "H",
        "subjectId": 30761
      },
      {
        "optional": false,
        "subject": {
          "id": 30760,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ022",
          "nameEt": "Finantskavandamine",
          "nameEn": "Financial Planning",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused kompaktselt rakendada finantskavandamise oskusi, mis on aluseks finantsplaneerimisel.",
          "objectivesEn": "Create opportunities to compactly apply the financial planning skills which is the basis financial planning.",
          "outcomesEt": "-Aine läbinud üliõpilane: \n•\tomab kriitilist arusaama finantskavandamise süsteemist ja prognoosimise korraldusest ettevõttes;\n•\tplaneerib ja oskab koostada erinevate valdkondade eelarveid (sh investeeringud) juhtimisotsuste langetamiseks ja finantstegevuse kontrollimiseks.",
          "outcomesEn": "Student who has passed the subject:\n• has a critical understanding of the financial planning system and planning arrangements in the company;\n• plans and is able to prepare budgets for various areas (incl. Investments) for making management decisions and controlling financial activities.",
          "descriptionEt": "Finantskavandamine. Ettevõtte eelarvesüsteemi olemus ja rakendamise eesmärgid. Ettevõtte eelarve struktuur. Eelarvestus ja vastutusarvestus. Eelarvete ja prognooside koostamise protsessid. Investeeringute eelarvestamine. Aastaeelarve koostamise põhietapid ja ajakava.",
          "descriptionEn": "Financial planning. The company's budget system and the objectives of its implementation. Company budget structure. Budgeting and accountability. Budgeting and forecasting processes. Investment budgeting. Main stages and timetable for drawing up the annual budget",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30760
      },
      {
        "optional": false,
        "subject": {
          "id": 30762,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ024",
          "nameEt": "Kulu- ja juhtimisarvestus",
          "nameEn": "Cost and Management Accounting",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada oskused kulude käitumise analüüsimisest ja juhtimisotsuste tegemisest.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tkirjeldab kulude liigitamise aluseid, selgitab ja analüüsib kulude, tulude ja kasumi vahelisi seoseid;\n•\trakendab iseseisvalt kulu- ja juhtimisarvestuse põhimõtteid erialaste situatsioonide lahendamisel;\n•\ttõlgendab ja esitleb ettevõtte sisestele ja välistele infotarbijatele juhtimisarvestusest saadavat üld- ja spetsiifilist informatsiooni;\n•\tomab süvateadmisi ettevõtte kulu- ja juhtimisarvestusest ning valmistab ette vajaliku informatsiooni juhtimisotsuste tegemiseks ja põhjendab juhtimisotsuseid.",
          "outcomesEn": "-",
          "descriptionEt": "Juhtimisarvestuse olemus ja eesmärk. Kuluarvestuse meetodid. Kulukeskused, kulukandjad, kuluobjektid, kulukohad. Kulude liigitus ja nende käitumine. Olulised ja ebaolulised kulud. Pöördumatud kulud. Kulu-maht-kasum analüüsi meetodid: tasuvuspunkt, sihtkasum, ohutusvaru, tegevusvõimendus. Piirkasum ja piirkasumimäär. Otsustussituatsioonid.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30762
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 218,
        "nameEt": "Finantsjuhtimine",
        "nameEn": "Financial Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Erialaõpe. Personalijuhtimine",
    "nameEn": "Specialty Subjects",
    "orderNr": 3,
    "objectivesEt": null,
    "objectivesEn": null,
    "outcomesEt": null,
    "outcomesEn": null,
    "typeNameEt": "Erialaained",
    "typeNameEn": "Specialty subjects",
    "totalCredits": 33,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 33,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Muu (kasutajal on võimalik ise kirjeldada mooduli liiki)",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 38710,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ023",
          "nameEt": "Uurimistöö",
          "nameEn": "Research Paper",
          "description": null,
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": null,
          "objectivesEt": "Luua võimalused omandatud teadmiste ja oskuste rakendamiseks uurimistöö koostamisel ja tulemuste esitlemisel.",
          "objectivesEn": "To create opportunities for the exploitation of acquired knowledge and skills in the preparation of research paper and presentation of results.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Uurimistöö on teoreetilise iseloomuga iseseisev töö, mille koostamisel üliõpilane demonstreerib erialase kirjanduse läbitöötamise ja erinevatest allikatest pärit teemakohaste teoreetiliste käsitluste põimimise ja akadeemilise kirjutamise oskust. Lisaks teemakohasele teoreetilisele käsitlusele kavandab üliõpilane uurimistöö käigus lõputöö metoodika, mis näitab üliõpilase oskust rakendada teadmisi uurimistöö koostamise metoodikast, andmekogumise ja andmeanalüüsi meetoditest ning valimi kujundamisest.",
          "descriptionEn": "A research paper is an independent work of a theoretical nature, in the preparation of which the student demonstrates the ability to study professional literature and interweave theoretical approaches from various sources and academic writing. In addition to the theoretical approach to the topic, during the research, the student plans the thesis methodology, which demonstrates the student's ability to apply knowledge of the research methodology, data collection and data analysis methods, and sample design.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 38710
      },
      {
        "optional": false,
        "subject": {
          "id": 30768,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ030",
          "nameEt": "Inimressursi juhtimine",
          "nameEn": "Human Resource Management",
          "description": "-",
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada inimressursi ja selle strateegilise juhtimise põhimõtete rakendamise oskused.",
          "objectivesEn": "To develop skills in applying the principles of human resources and their strategic management.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\tselgitab inimressursi juhtimise eesmärke, põhimõisteid, strateegilisi võtteid sh keerulistes muutuvates olukordades ning erinevaid lähenemisi inimressursi juhtimisele;\n•\teristab inimressursi juhtimise mudeleid;\n•\thindab etteantud lähteandmete alusel töötajate tööalast võimekust ja potentsiaali, arvutab tööjõukulu, inimvara väärtust ja inimvarakordajat ning koostab inimvara väärtuse alusel inimkapitali bilansi;\n•\tselgitab juhendamise ja mentorluse eripära;\n•\ttunneb inimressursi juhtimise võtteid muudatuste elluviimisel.",
          "outcomesEn": "Student who has passed the subject:\n• explains the goals, basic concepts, strategic techniques of human resource management, including in complex changing situations, and different approaches to human resource management;\n• distinguishes between human resource management models;\n• assesses the work capacity and potential of employees on the basis of the given source data, calculates labor costs, the value of human resources and the human resource ratio, and prepares a human capital balance on the basis of the value of human resources;\n• explains the specifics of mentoring and mentoring;\n• knows human resource management techniques when implementing changes.",
          "descriptionEt": "Inimressursi juhtimise olemus, rollid ja ülesanded. Erinev lähenemine inimeste juhtimisele. Intellektuaalne kapital. Inimkapital ja struktuurkapital. Inimressursi strateegilise juhtimise mudelid, nende valiku ja rakendamise kriteeriumid. Inimressursi strateegiad, poliitikad, protsessid, analüütika. Teadmusjuhtimine. Kompetentsidel põhinev inimressursi juhtimine. Eetika inimressursi juhtimises. Ettevõtte sotsiaalne vastutus. Tulemuslikkuse juhtimise mudel ja seda toetavad juhtimisinstrumendid. Immateriaalse vara monitor ja kompetentsuse näitajad. Inimressursside arvestus. Inimvara hindamise meetodid. Inimvara väärtus ja tööjõukulu. Individuaalne varakordaja. Võimekus kui isiklik kapital, selle komponendid ja hindamine. Potentsiaal ja selle hindamine. Inimkapitali maksimeerimine ja selle näitajad. Inimvara kinnistamise võtted. Motivatsioon ja pühendumine. Motiveerituse suurendamine. Töösuhe kui psühholoogiline leping. Õppimine ja areng, õppimise ja arengu edukuse näitajad. Enesekontroll õppimisel ja isiklikud arenguplaanid. Õppiv organisatsioon ja organisatsiooniline õppimine. Tagasiside ja hindamine kui töösoorituse juhtimise vahendid. 360 tagasiside. Juhendamine ja mentorlus. Mentorluse tasemed ja mudelid. Mentori kompetentsid. Inimkapitali bilanss. Inimkapitali ülevaade: järjepidevuse ja karjääri juhtimine. Inimressursi juhtimine muudatuste elluviimisel.",
          "descriptionEn": "The nature, roles and tasks of human resource management. Different approaches to HR management. Intellectual capital. Human capital and structural capital. Strategic human resource management models, their selection and implementation criteria. Human resource strategies, policies, processes, analytics. Knowledge management. Competence-based human resource management. Ethics in human resource management. Corporate social responsibility. The performance management model and the management tools that support it. Intangible asset monitor and competency indicators. Human resources accounting. Human resource evaluation methods. Value of human resources and labor costs. Individual asset ratio. Capacity as personal capital, its components and valuation. Potential and its assessment. Maximizing human capital and its indicators. Techniques of embedding human property. Motivation and commitment. Increasing motivation. Employment relationship as a psychological contract. Learning and development, indicators of learning and development success. Self-control in learning and personal development plans. Learning organization and organizational learning. Feedback and evaluation as performance management tools. 360 feedback. Mentoring and mentoring. Mentoring levels and models. Mentor competencies. Human capital balance. Human Capital Review: Continuity and Career Management. Human resource management in implementing change.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30768
      },
      {
        "optional": false,
        "subject": {
          "id": 30767,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ029",
          "nameEt": "Personali koolitus ja arendamine",
          "nameEn": "Personnel Training and Development",
          "description": "-",
          "credits": 3,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused personali koolitamise ja arendamise oskuste kujunemiseks.",
          "objectivesEn": "Create opportunities for staff training and development skills.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tselgitab personali arendamise ja koolituse põhimõisteid ning lähtub personali arendamiseks sobiva meetodi valikul püstitatud eesmärgist;\n•\tseostab töökohustusi nende täitmiseks vajalike pädevustega;\n•\trakendab koolituse ja arenduse teoreetilisi lähtekohti koolitusprojekti koostamisel ja selle esitlemisel.",
          "outcomesEn": "-",
          "descriptionEt": "Personali arendamise olemus ja eesmärgid. Personali arendamist mõjutavad tegurid. Majanduse globaliseerumisest tulenev personali arendamise vajadus. Organisatsiooni vajadused ja personali arendamise praktikad. Personali arendus- ja koolitusjuhi ülesanded. Personali koolituse olemus ja eesmärgid. Koolitusprotsess ja koolitusdokumendid. Koolitusprojekt. Koolitusvajadus. Töötajate kompetentside määratlemine ja oskuskaart. Koolitusplaan. Koolituse eelarve. Koolitusvormi valik. Koolitusmeetodid. Kootsing. Juhendamine töökohal. Mentorlus. Koolitustegevuste ja –tulemuste hindamine.",
          "descriptionEn": "The nature and goals of personnel development. Factors affecting personnel development. The need for personnel development arising from the globalization of the economy. Organizational needs and staff development practices. Tasks of the personnel development and training manager. Nature and objectives of personnel training. Training process and training documents. Training project. Training requirement.. Definition of employee competencies and skill map. Training plan. Training budget. Choice of training form. Training methods. Coaching. On-the-job training. Mentorship. Evaluation of training activities and results.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 30767
      },
      {
        "optional": false,
        "subject": {
          "id": 37279,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ058",
          "nameEt": "Personali planeerimine",
          "nameEn": "Staff Planning",
          "description": null,
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": null,
          "objectivesEt": "Kujundada teadmised ja oskused personali planeerimiseks",
          "objectivesEn": "Develop knowledge and skills for staff planning",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Personali planeerimise olemus. Personali planeerimist mõjutavad tegurid. Tööjõuturg. Tööhõive. Keskkonna ja tööturu andmete analüüsimine tööjõu planeerimise eeldusena. Personali plaanid lühi-, keskpikas ja pikas perspektiivis.",
          "descriptionEn": "The nature of personnel planning. Factors influencing staff planning. Labor market. Employment. Analysis of environmental and labor market data as a prerequisite for workforce planning. Short-, medium- and long-term staffing plans.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "H",
        "subjectId": 37279
      },
      {
        "optional": false,
        "subject": {
          "id": 30414,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ011",
          "nameEt": "Lõputöö seminar",
          "nameEn": "Graduation Thesis Seminar",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua eeldused erialase lõputöö/miniuuringu koostamiseks ja edukaks kaitsmiseks.",
          "objectivesEn": "To create prerequisites for preparation and successful defence of specialty graduation thesis/mini research.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\tmõistab lõputöö/miniuuringu läbiviimise ja akadeemilise teksti koostamise nõudeid;\n●\tsüvendab teadmisi lõputöö/miniuuringu koostamise metodoloogilistest põhimõtetest ja vormistamisest;\n●\trakendab empiirilise uuringu läbiviimiseks kavandatud  andmekogumis- ja analüüsimeetodeid.",
          "outcomesEn": "The student having passed the course:\n•\tunderstands the requirements for the preparation of the graduation thesis/mini research and academic writing;\n•\tunderstands the methodological principles and editing requirements of the graduation thesis/mini research;\n•\tutilises planned data collection and analysis methods to carry out the empirical research.",
          "descriptionEt": "Lõputöö ülesehitus. Lõputöö pealkirja, probleemi, eesmärgi, uurimisülesannete ja uuringu seostamine. Uurimisprobleemi sidusus empiirilise uuringu eesmärgi ja uurimisülesannetega. Uuringu teoreetilise aluse ja andmeanalüüsi sidusus. Kvantitatiivsed ja kvalitatiivsed uurimismeetodid, nende kasutamise põhjendamine. Andmete analüüs ja tulemuste esitamine empiirilises uuringus. Kirjalike tööde vormistuslike nõuete kinnistamine. Resümee koostamise alused.",
          "descriptionEn": "Structure of the graduation thesis. Alignment of title, problem, aim, research task and research. Coherence of theoretical basis of the research study and data processing. Quantitative and qualitative research methods, justification of their utilisation. Data processing and presentation of results in empirical research. Guidelines for formal writing in research studies. Basics of summary writing.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30414
      },
      {
        "optional": false,
        "subject": {
          "id": 37280,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ059",
          "nameEt": "Personali tasustamine ja töö korraldamine",
          "nameEn": "Enterprise Staff Remuneration and Work Organization",
          "description": null,
          "credits": 6,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": null,
          "objectivesEt": "Luua võimalused äriettevõtte personali tasustamise ja töö korraldamise põhimõtete rakendamise oskuste kujunemiseks.",
          "objectivesEn": "To create opportunities for the development of skills in the application of the principles of business enterprise staff remuneration and work organization.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Töökohtade hindamine ja meetodid. Lihtne järjestamine. Paarisvõrdluse meetod. Punkt-faktormeetod ja Hay (Korn-Ferry) meetod. Töökohtade klassifitseerimine ja palgasüsteemi loomine seostades töö väärtuse põhipalgaga. Töö ja palga mõiste ning seosed. Äristrateegia ja tasustamissüsteem. Tasustamissüsteemi roll ettevõttes. Palkade sise- ja välisanalüüsid: turuanalüüs, ettevõtte positsioon palgaturul, siseanalüüs. Hüvituste liigid. Tasupakett. Otsene ja kaudne rahaline tasu. Tulemustasustamine. Väärtuspakkumine. Tasustamissüsteemi hindamine. Tasustamisega seotud praktilised küsimused. Keskmise töötasu maksmise tingimused ja kord. Ravikindlustus. Töö- ja puhkeaeg. Summeeritud tööaeg. Ületunnitöö. Valveaeg. Töötamine öisel ajal. Alaealiste töökorraldus. Puhkus. Tööajagraafik ja puhkuse ajakava. Töölähetus. Töökorraldus. LEAN kui timmitud töökorraldus. Paindlik töökorraldus ja selle vormid. Osaline tööaeg, töökoha jagamine, kaugtöö, hooajaline töötamine.",
          "descriptionEn": "Job evaluation and methods. Easy ranking. Pairwise comparison method. Point-factor method and Hay (Korn-Ferry) method. Job classification and wage structure based on job evaluation. The concept and links between job and pay. Business strategy and compensation system. The role of the compensation system in the company. Internal and external analyzes of salaries: market analysis, company's position on the salary market, internal analysis.  Types of compensation. Compensation package. Direct and indirect financial reward. Performance pay. The value proposition. Evaluation of the remuneration system. Practical issues related to remuneration. Conditions and procedure for payment of average salary. Medical insurance. Working and rest time. Cumulative working time. Overtime. On-call time. Working at night. Work organization of minors. Vacation. Work schedule and holiday schedule. Business trip. Work arrangement. LEAN as streamlined work organization. Flexible work arrangements and its forms. Part-time work, job sharing, teleworking, seasonal work.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "E",
        "subjectId": 37280
      },
      {
        "optional": false,
        "subject": {
          "id": 37278,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ062",
          "nameEt": "Töö analüüs ja töösuhete haldamine",
          "nameEn": "Job Analysis and Employment Relationship Management",
          "description": null,
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": null,
          "objectivesEt": "Luua võimalused äriettevõtte töö analüüsi põhimõtete rakendamise ja töösuhete haldamise oskuste kujunemiseks.",
          "objectivesEn": "To create opportunities for the development of skills in the application of job analysis principles and employment relationship management.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Töö analüüsi olemus, eesmärgid ja meetodid. Parkinsoni seadus. Tööde klassifitseerimine, nende jaotamine ametikohtade viisi. Organisatsiooni struktuuri kujundamine. Töökohtade kujundamine. Töötingimused, töövahendid. Töökoha eesmärgi, töökohustuste, õiguste ja vastutuse sõnastamine tuginedes töö analüüsi tulemustele. Nõuete profiil ja selle seos töökohustustega. Töösuhete haldamine ja sellega kaasnev dokumentatsioon. Töötaja kui kliendi ja kasutaja teekond. Töötajakogemus.Juhtimist ja töösuhteid arendavate ning toetavate dokumentide ja juhiste vormistamine.",
          "descriptionEn": "The nature, goals and methods of job analysis. Parkinson's Law. Classification of works, their distribution by type of positions. Organizational structure design. Job creation. Working conditions, tools. Formulation of the purpose of the workplace, duties, rights and responsibilities based on the results of the job analysis. Requirements profile and its relation to job responsibilities. Industrial relations management and related documentation. The journey of the employee as a customer and user. Employee experience. Preparation of documents and instructions that develop and support management and employment relationships.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 37278
      },
      {
        "optional": false,
        "subject": {
          "id": 30766,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ028",
          "nameEt": "Personali värbamine ja valik",
          "nameEn": "Personnel Recruitment and Selection",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused personali värbamise ja valiku meetodite rakendamise oskuste kujunemiseks ning tulemuste analüüsimiseks.",
          "objectivesEn": "To create opprtunities for developing skills in applying personnel recruitment and selection methods and analyzing the results.",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\teristab personali värbamise ja valiku meetodeid ning oskab neid rakendada;\n•\tanalüüsib tööintervjuusid (kandidaatide hindamisvestlusi) ja annab neile omapoolse hinnangu;\n•\tkavandab grupiintervjuu, demonstreerib selle läbiviimist ja analüüsib grupiintervjuu läbiviimisel kasutatud tehnikaid ning annab neile omapoolse hinnangu.",
          "outcomesEn": "Student who has passed the subject:\n• distinguishes between staff recruitment and selection methods and is able to apply them;\n• analyzes job interviews (candidate evaluation interviews) and gives their own assessment;\n• plans a group interview, demonstrates its performance and analyzes the techniques used in the group interview and gives their own assessment.",
          "descriptionEt": "Värbamise ja valiku üldpõhimõtted. Tööandja brändi kujundamine. Värbamisstrateegia organisatsioonisisesel ja –välisel turul: eelised ja puudused. Organisatsioonisisesed ja -välised allikad. Värbamisprotsess. Värbamismeetodid.",
          "descriptionEn": "General principles of recruitment and selection. Employer branding. Recruitment strategy in the internal and external market: advantages and disadvantages. Internal and external sources. Recruitment process. Recruitment methods.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "H",
        "subjectId": 30766
      },
      {
        "optional": false,
        "subject": {
          "id": 30413,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ010",
          "nameEt": "Uurimistöö metoodika",
          "nameEn": "Research Methods",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused omandatud teadmiste ja oskuste rakendamiseks uurimistöö koostamisel, analüüsi läbiviimisel ja tulemuste esitlemisel.",
          "objectivesEn": "To create possibilities for implementation of acquired knowledge and skills in the preparation of research paper, carrying out the analysis and presentation of results.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\teristab uurimistöö etappe ja toob välja seoseid erinevate etappide vahel;\n●\tkirjeldab oma valdkonna valitud uurimisteemale kohast uurimisprobleemi, seab uurimiseesmärgi ning uurimisülesanded või -küsimused;\n●\tesitab teemakohase kirjanduse loetelu uurimistöö läbiviimiseks;\n●\tvõrdleb peamisi uurimisstrateegiaid ning andmekogumis- ja analüüsimeetodeid;\n●\tvalib uurimisprobleemidest lähtuvalt kohase uurimismetoodika ning kavandab süsteemselt uuringu läbiviimise;\n●\tkirjeldab valimi moodustamise põhimõtteid ja kasutab neid oma uurimuse kavandamisel.",
          "outcomesEn": "The student having passed the course:\n•\tdifferentiates the stages of research and points out their relationships;\n•\tdescribes the research problem chosen according to the research topic in their field, establishes the research objective and research tasks or questions;\n•\tlists topic based resources to carry out the research;\n•\tcompares major research strategies and methods for data collection and analysis;\n•\tchooses the appropriate research method according to the research problems and systematically plans preparation of the study;\n•\tdescribes the principles of the choice of research sample and utilises them in planning their research.",
          "descriptionEt": "Uurimistöö spetsiifika ja koht uuringutes. Uuringu kavandamise protsess. Uurimisteema valiku protsess. Uurimistöö etapid. Probleemi sõnastamine uuringu alusena. Uuringu eesmärgi ja uurimisülesannete (-küsimuste) sõnastamine. Teooria mõiste ja tähtsus uuringus. Teooria ja praktika vaheline suhe (deduktsioon vs induktsioon). Teabeallikate määratlemine: esmaste ja teiseste andmete analüüs uuringutes. Hüpoteesi püstitamine, hüpoteesi roll uuringus. Kvantitatiivne, kvalitatiivne ja kombineeritud uuring ning nende erinevused. Andmete kogumise ja analüüsimise meetodid. Valimi moodustamise põhimõtted.",
          "descriptionEn": "Specifications and role of research paper in research. Process of research planning. Process of choosing the topic. Stages of research. Formulating the problem as a basis for research. Formulating research objective and tasks/questions. Concept and importance of theory in research. Relationship between theory and practice (deduction vs induction). Determination of information sources: analysis of primary and secondary data in research. Stating hypothesis, role of hypothesis in research. Quantitative, qualitative and combined research and their differences. Methods of data collection and analysis. Principles of sampling.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30413
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 220,
        "nameEt": "Personalijuhtimine",
        "nameEn": "Personnel Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Valikained",
    "nameEn": "Optional Subjects",
    "orderNr": 4,
    "objectivesEt": "Eesmärgid\t\nLuua eeldused valikainetes omandatud teadmiste ja oskuste rakendamiseks erialases tegevuses.\n\nÕpiväljundid\t\nÜliõpilane:\n•\thindab konkreetse teema tähtsust majanduse, ühiskonna ja ettevõtluse kontekstis ning rakendab saadud teadmisi erialases töös.",
    "objectivesEn": "Objectives:\nTo create prerequisites for utilisation of knowledge and skills gained in optional courses.\n\nLearning outcomes:\nThe student\n\n•\tevaluates the importance of the particular topic in the context of economy, society and entrepreneurship, and utilises gained knowledge in professional work.",
    "outcomesEt": "Eesmärgid\t\nLuua eeldused valikainetes omandatud teadmiste ja oskuste rakendamiseks erialases tegevuses.\n\nÕpiväljundid\t\nÜliõpilane:\n•\thindab konkreetse teema tähtsust majanduse, ühiskonna ja ettevõtluse kontekstis ning rakendab saadud teadmisi erialases töös.",
    "outcomesEn": "Objectives:\nTo create prerequisites for utilisation of knowledge and skills gained in optional courses.\n\nLearning outcomes:\nThe student\n\n•\tevaluates the importance of the particular topic in the context of economy, society and entrepreneurship, and utilises gained knowledge in professional work.",
    "typeNameEt": null,
    "typeNameEn": null,
    "totalCredits": 21,
    "optionalStudyCredits": 21,
    "compulsoryStudyCredits": 0,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Valikained",
    "subjects": [
      {
        "optional": true,
        "subject": {
          "id": 32579,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "TTK006",
          "nameEt": "Vabaõpingud",
          "nameEn": "Optional Subjects",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "-",
          "objectivesEn": "-",
          "outcomesEt": "-",
          "outcomesEn": "-",
          "descriptionEt": "Vabaõpingutena on käsitletav õppekavaväline üliõpilast arendav või üliõpilase aktiivsust näitav tegevus või tegevused, sealhulgas \r\n• osalemine (IP) projektides; \r\n• osalemine projektide juhtimises; \r\n• osalemine konverentsidel, õppetöövälistel seminaridel, nende ettevalmistamine, esinemine; \r\n• enesetäiendamine erialaseminaridel / infopäevadel; \r\n• osalemine TTK poolt korraldatavatel üldhariduslikel loengutel; \r\n• enesetäiendamine üldharivatel kursustel; \r\n• osalemine (eriala)ringide töös; \r\n• oma kooli ja õppekava tutvustamine, osalemine turundussuhtluse meetmetes; \r\n• töö üliõpilasesinduses, üliõpilasorganisatsioonides. \r\n\r\nVabaõpingud võib asendada vabaainetega (kursused teistest kõrgkoolidest või TTK teiste teaduskondade poolt pakutavad kursused).",
          "descriptionEn": "Optional studies may be regarded as extra-curricula activities educating students or indicating their participation in various activities, e.g.: \r\n- (IP) projects;\r\n- project management;\r\n- conferences, extra-curricular seminars (organizing, attending, making presentations); \r\n- professional seminars and information events; \r\n- attending lectures of general interest at TTK UAS;\r\n- self-improvement in different courses; \r\n- participation in the work of (professional) societies/groups; \r\n- popularizing own school and speciality, participation in marketing communication activities; \r\n- participation in the work of Student Council and student organisations. \r\n\r\nOptional studies can be replaced by optional subjects (courses at other institutions of higher education / in the curricula of other faculties of TTK UAS).",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": null,
          "subjectLanguages": ["Inglise keel", "Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 32579
      },
      {
        "optional": true,
        "subject": {
          "id": 36583,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "RKE132",
          "nameEt": "Programmeerimise algkursus",
          "nameEn": "Introduction to Programming",
          "description": null,
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "100%  veebipõhine kursus",
          "objectivesEt": "Kursuse tulemusel tunneb õppija programmeerimise põhiolemust, üldist terminoloogiat ning oskab kasutada peamisi kaasaegseid tarkvaraarenduse vahendeid lihtsamate rakenduste loomiseks.",
          "objectivesEn": "The student understands the concept of programming basics, acquires basic programming terminology, and uses modern programming software development tools to create basic applications.",
          "outcomesEt": "Selle kursuse läbinud üliõpilane:\n-tunneb erinevaid andmetüüpe ja andmestruktuure;\n- kasutab matemaatika ja loogika põhiseoseid programmeerimise ülesannete lahendamisel;\n-teab objektorienteeritud programmeerimise põhimõtteid ja -mõisteid;\n-loob lihtsamaid rakendusi, kasutades arendusvahendeid;\n-järgib programmeerimisel vastava programmeerimiskeele parimaid praktikaid.",
          "outcomesEn": "The student:\n-understands data types;\n-developes algorithmic thinking to formalize and solve simple development tasks;\n-understands the concepts of object-oriented programming;\n-creates simple application;\n-develops good programming style;",
          "descriptionEt": "Sissejuhatus programmeerimisse: arenduskeskkonna tutvustus; andmetüübid andmestruktuurid, sisend- ja väljundlaused. \nProgrammeerimine: valikud, tsüklid, teisendamine; teksti manipuleerimine, failid, massiivid; parimate praktikate tutvustus (taanded, kommentaarid, nimekuju jne). \nObjektorienteeritud programmeerimise alused (OOP):  klassid, pärilus, kapseldamine, polümorfism, abstraktsioon. Versioonihaldussüsteemide kasutamine. \nProgrammeerimiskeel on C#.",
          "descriptionEn": "The student will learn the basic concepts and methods of software development, such as data types, control flow, loops, and object oriented programming, in C# programming language using Visual Studio 2019 integrated development environment.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": "100% online course",
          "isPractice": false,
          "schoolDepartment": "Reaalainete keskus",
          "subjectLanguages": ["Eesti keel", "Inglise keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "H",
        "subjectId": 36583
      },
      {
        "optional": true,
        "subject": {
          "id": 30781,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ043",
          "nameEt": "Ärimudeli arendamine",
          "nameEn": "Business Model Development",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Toetada üliõpilastel loovat mõtlemist ja ettevõtliku käitumise põhimõtteid ning anda teadmisi ärivõimaluste äratundmise, äriideede arendamise, mudeldamise ning esitluse kohta.",
          "objectivesEn": "To encourage students' creative thinking and entrepreneurial principles, as well as to provide knowledge about recognizing business opportunities, developing business ideas, modeling, and presentation.",
          "outcomesEt": "Aine läbinud üliõpilane: \n• valdab kaasaegset ettevõtluse äriidee arendamise nii loovat kui süsteemset metoodikat;\n• oskab loovalt ja ettevõtlikult mõelda, tunneb äriideede genereerimise, arendamise ja hindamise meetodeid;\n• on võimeline looma ja hindama alternatiivseid strateegiad;\n• omandab meeskonnatöö kogemusi äriidee arendamisel;\n• sünteesib informatsiooni eristades olulist, oskab koostada sisukaid kokkuvõtteid;\n• väljendab end professionaalselt ja mõjusalt.",
          "outcomesEn": "-",
          "descriptionEt": "Loovus ja innovatsioon. Ärimudeli innovatsioon. Äriidee vs ärivõimalus. Väärtuspakkumise kujunemine. Ärimudeli väljatöötamine. Äriidee lühikokkuvõte (one-pager). Lühiesitlus ehk liftikõne (pitch).\r\nAktiivõppe meetodite rakendamine. Erinevate mõtlemisviiside: loova, abstraktse, reflektiivse ja kriitilise praktiseerimine. Sisuka, sidusa ja mõjusa esitluse arendamine ettevõtjaliku käitumise ja pädevuse praktiseerimiseks.",
          "descriptionEn": "Creativity and innovation . Innovation in business models. Business opportunity vs. business idea Formation of value supply. Creation of a business model. A one-page business idea. A brief presentation or an elevator pitch.\nApplication of active learning methods. Practicing different ways of thinking: creative, abstract, reflective and critical. Creating a meaningful, coherent, and effective presentation for the purpose of practicing entrepreneurial behavior and competence.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30781
      },
      {
        "optional": true,
        "subject": {
          "id": 30448,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MST012",
          "nameEt": "Konfliktijuhtimine",
          "nameEn": "Conflict Management",
          "description": "-",
          "credits": 3,
          "assessment": "hindeline arvestus (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_H",
          "assessmentDescription": "-",
          "objectivesEt": "Valmistada üliõpilasi ette konfliktisutatsioonidega toimetulekuks praktikas andes neile praktilised teadmised, tehnikad ja oskused konfliktide juhtimiseks.",
          "objectivesEn": "To prepare students for managing conflicts in  practice and giving them practical knowledge, techniques and skills for conflict resolution.",
          "outcomesEt": "Aine läbides üliõpilane: \n• tunneb konflikti tekkimise, kujunemise ja lahendamise seaduspärasusi; \n• analüüsib konflikte ja suudab välja pakkuda lahendusstrateegiaid;\n• tunneb lepitamise teooriat ning kasutab lepitamist kui võtet konflikti juhtimisel; \n• on omandnud oskusi ennast analüüsida ja hinnata oma reageeringuid \nkonfliktikäitumises; \n• tähtsustab leidlikke ja loovaid võimalusi pingete maanadamisel.",
          "outcomesEn": "Upon passing the subject, the student:\n• knows the laws of conflict formation, development and resolution;\n• analyzes conflicts and is able to propose resolution strategies;\n• knows the theory of reconciliation and how to use it in conflict management;\n• has acquired the skills to analyze oneself and evaluate one's reactions to\nconflict behavior;\n• emphasizes creative methods in easing tensions.",
          "descriptionEt": "Konflikti mõiste, tekkepõhjused ja tunnused. Konflikti tasandid ja tüübid. Konflikti diagnostika. Konflikti eskalatsioon ja tsükkel. Konfliktirollid. Käitumine, kõnelemine ja emotsioonide juhtimine konfliktis. Vastandumine konfliktis. Konflikti lahendamise stiilid ja strateegiad.",
          "descriptionEn": "Topics covered in training:\nNature and main components of the conflict.\nConflict origin and development. The role of emotions in the process of conflict development\nThe effect of emotions on everyday life and relationships, seminar\nConflict escalation, escalation stages and resolution in different stages\nTechniques for intelligent conflict management",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "H",
        "subjectId": 30448
      },
      {
        "optional": true,
        "subject": {
          "id": 30783,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ045",
          "nameEt": "Kodulehe haldus",
          "nameEn": "Website Management",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda oskus luua, hallata ja arendada organisatsiooni kodulehte kasutades loovalt sisuhaldustarkvara.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n• tunneb sisuhaldustarkvara struktuuri ja põhimõtteid;\n• teab veebilehe planeerimise ja optimeerimise aluseid;\n• koostab sisulehti;\n• loob, haldab ja arendab eesmärgipärast veebilehte ettevõttele või asutusele;\n• oskab veebilehte optimeerida ja lisada vajaminevaid lisasid;\n• oskab kasutada erinevaid kirjastiile;\n• loob dünaamilisi veebirakendusi.",
          "outcomesEn": "-",
          "descriptionEt": "Sisuhaldustarkvara eelised ja võimalused. Veebilehe loomise ja kujundamise põhitõed. Sisuhaldustarkvara installeerimine ja seadistamine. Sisu lisamine, muutmine, kustutamine – tekst, pildid, videod, dokumendid. Staatilised ja dünaamilised sisulehed, rubriigid. Pluginate lisamine ja seadistamine. Menüüd – peamenüü, lisamenüü. Kasutajate loomine ja kasutajate õigused. Erinevad kirjastiilid. Veebileht kui töötajate siseveeb. Veebilehe optimeerimine otsimootoritele. Veebianalüütika võimalused.",
          "descriptionEn": "-",
          "studyLiterature": "Keerus-Jusupov, E. 2014. CMS Joomla, CMS WordPress, CMS Drupal",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "Iseseisvate tööde juhendid, ülesanded ja nõuded on leitavad Moodle kursusel ja neid tutvustatakse ka esimeses kontaktõppe tunnis.",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30783
      },
      {
        "optional": true,
        "subject": {
          "id": 30301,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMA026",
          "nameEt": "MTÜ raamatupidamine ja maksuarvestus",
          "nameEn": "Non Profit Organisation Accounting and Taxation",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmised  finantsarvestusest, -aruandlusest ja maksundusest mittetulundusühingus.",
          "objectivesEn": "To equip students with knowledge of financial accounting, reporting and taxation in non-profit organisations.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\tselgitab mittetulundusühingute asutamist, juhtimist ja raamatupidamise korraldamist;\n●\tselgitab mittetulundusühingute spetsiifilisi arvestuspõhimõtteid ja kirjendab mittetulundusühingute majandustehinguid;\n●\tkoostab etteantud majandustehingute põhjal finantsaruanded;\n●\tarvestab mittetulundusühingute võimalike maksukohustuste ja -vabastustega ning täidab maksudeklaratsioone.",
          "outcomesEn": "The student having passed the course:\n•\texplains the creation, management and accounting procedures of the non-profit organisation;\n•\texplains specific accounting principles of non-profit organisations and records their business transactions;\n•\tprepares financial reports according to predetermined business transactions;\n•\tcounts for possible tax liabilities and exemptions, and prepares tax declarations.",
          "descriptionEt": "MTÜ asutamine ja juhtimine. Raamatupidamise korraldamise üldpõhimõtted (raamatupidamise sise-eeskiri, kontoplaan, arvestusregistrid) ja arvestuspõhimõtted (tasud ühingu liikmetelt, saadud annetused ja toetused, teenuste ja maksete vahendamine). Majandustehingute kajastamine arvestusregistrites. Aastaaruande koostamise üldpõhimõtted, nõuded informatsiooni esitusviisile raamatupidamise aastaaruandes. Raamatupidamise aastaaruande koostisosad: bilanss, tulemiaruanne, rahavoogude aruanne, netovara muutuste aruanne ja raamatupidamise aastaaruande lisad.\r\nMTÜ maksud: tulumaks ja maksusoodustused seoses nimekirja kantud ühendustega, sotsiaalmaks, käibemaks ja maksudeklaratsioonide täitmine.",
          "descriptionEn": "Creation and management of the non-profit organisation. General principles of organisation of accounting (internal accounting regulations and policies, account planner, accounting registers) and accounting principles (membership fees, donations and grants, mediation of services and payments). Recording of business transactions in accounting registers. General principles of preparation of annual financial report, requirements for exposition of information in annual financial report. Key elements of annual financial report: balance sheet, profit and loss statement, cash flow statement, statement of changes in net assets and appendixes to annual financial report.\nTaxes in non-profit organisations: income tax and tax credits concerning the listed associations, social tax, value added tax, and preparation of tax declarations.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30301
      },
      {
        "optional": true,
        "subject": {
          "id": 30419,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ016",
          "nameEt": "Läbirääkimised",
          "nameEn": "Negotiations",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmisi läbirääkimisprotsessist ja selle etappidest ning luua võimalused toimetulekuks läbirääkimistes osalemisel.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tkirjeldab läbirääkimise protsessi ja selle etappe;\n•\tkasutab erinevaid läbirääkimiste strateegiaid ja taktikaid erialaste juhtumite lahendamisel;\n•\trakendab sobivat teooriat praktilise juhtumi lahendamisel.",
          "outcomesEn": "-",
          "descriptionEt": "Läbirääkimiste protsess ja selle etapid, läbirääkimistasandid. Ettevalmistused läbirääkimisteks, eesmärkide püstitamine, eelhäälestus. Suhtlemisetapid, psühholoogiline kontakt, partneri tähelepanu köitmine. Aktiivse kuulamise tehnikate kasutamine partneri ootuste väljaselgitamiseks. Argumenteerimine ja oma seisukohtade selge väljendamine. Vastuväidetele ja –argumentidele vastamine. Mittesõnalise käitumise märkamine ja arvestamine. Enesekehtestamise alused ja nende kasutamine läbirääkimistel. Manipuleerijate ja “raskete” partneritega toimetulek. Võitja-võitja mõtteviisi kasutamine läbirääkimistel. Emotsioonide kontrollimine ja kasutamine. Kehtivate kokkulepeteni jõudmine. Läbirääkimistulemuste fikseerimine ja elluviimine.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30419
      },
      {
        "optional": true,
        "subject": {
          "id": 30794,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ056",
          "nameEt": "E-kaubandus",
          "nameEn": "E-Commerce",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmisi ja oskusi e-poe loomiseks, müügitegevuse korraldamiseks ja analüüsimiseks.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane:\n• teeb e-poe platvormi valikuotsuseid kaubast ja/või teenusest lähtuvalt;\n• rakendab e-poe loomisel ja müügitegevuse korraldamisel e-kaubanduse terminoloogiat ja asjakohaseid õigusakte;\n• kavandab kliendikeskse teenindusprotsessi järgides isikuandmete kaitse seadust;\n• on suuteline e-poe tegevusaruannete põhjal müügitegevust analüüsima.",
          "outcomesEn": "-",
          "descriptionEt": "E-kaubanduses kasutatavad mõisted ja e-kaubanduse tüübid. E-kaubandust reguleerivad õigusaktid. E- kaupluse sisu loomine lähtuvalt isikuandmete kaitse seadusest. Kaupade kategoriseerimine, toodete loomine ja kliendibaasi haldamine e-poes. Turunduskommunikatsiooni kavandamine. E-poe aruandlus ja müügitegevuse analüüs.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30794
      },
      {
        "optional": true,
        "subject": {
          "id": 30793,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ055",
          "nameEt": "Innovatsioon",
          "nameEn": "Innovation",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmisi ja oskusi, mis on vajalikud innovatsiooni mõistmiseks ja juhtimiseks ettevõtte operatiiv- ja strateegilisel tasandil.",
          "objectivesEn": "To provide the knowledge and skills necessary to understand and manage innovation at the operational and strategic level of the company.",
          "outcomesEt": "-Aine läbinud üliõpilane:\n• mõistab, reflekteerib ja arutleb erinevate teoreetiliste mudelite, lähenemisviiside ja kontseptsioonide üle, mis on seotud innovatsiooniga ettevõttes;\n• rakendab neid mudeleid, lähenemisviise ja kontseptsioone, kui analüüsib innovatsiooniprotsessi juhtimisega seotud probleeme ja väljakutseid ettevõtetes.",
          "outcomesEn": "-Student who has passed the subject:\n• understands, reflects and discusses various theoretical models, approaches and concepts related to innovation in the company;\n• applies these models, approaches and concepts when analyzing the problems and challenges related to the management of the innovation process in companies.",
          "descriptionEt": "Innovatsiooni liigid, mõõtmed. Innovatsiooni protsess. Ettevõttesiseste protsesside juhtimine. Ratsionalistlik vs inkrementalistlik strateegia. Riiklik ja konkurentsikeskkond. Integreerumine strateegilise õppe korraldamiseks. Innovatsiooniprotsessi võimaldajad. Innovatiivse organisatsiooni ehitamine.",
          "descriptionEn": "-Types of innovation, dimensions. Innovation process. Management of internal processes. Rationalist vs. incrementalist strategy. National and competitive environment. Integration for strategic learning. Enablers of the innovation process. Building an innovative organization.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30793
      },
      {
        "optional": true,
        "subject": {
          "id": 30420,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ017",
          "nameEt": "Euroopa Liidu üldkursus",
          "nameEn": "General Studies on European Union",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "- õppejõu etteantud teemal esitlus loengus;\n- kirjaliku testi tulemus vähemalt 51%.",
          "objectivesEt": "Kujundada arusaam rahvusvaheliste suhete kujunemisest, tähtsamate organisatsioonide tegevusest ning anda Euroopa Liidus toimuvate protsesside, poliitikate ja tegevusvaldkondade analüüsioskus.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\tkirjeldab kaasaegset rahvusvaheliste suhete süsteemi;\r\n•\tmõistab Euroopa Liidu kujunemise põhjuseid ja eesmärke;\r\n•\tkirjeldab ja analüüsib eurointegratsiooni probleeme;\r\n•\tanalüüsib eurointegratsiooniprotsessi ja kirjeldab Eesti Euroopa Liiduga ühinemise mõjusid.",
          "outcomesEn": "-",
          "descriptionEt": "Integratsioonivajadus. Euroopa integratsiooni idee allikas. Esimesed riikideülesed organisatsioonid Euroopas. Euroopa Liidu kujunemislugu, olemus ja eesmärk. Euroopa Liidu lepingu struktuur. Euroopa Liidu institutsioonid. EL rahvastikuprobleemid ning arengutendentsid (linnastumine, vananemine, ränne). Euroopa Liidu õiguse allikad ja põhimõtted. Euroopa Liidu looduslikud ressursid ja nende kasutus. Säästev areng. Tööstus Euroopa Liidus. Majandusintegratsioon. Kaupade vaba liikumise regulatsioonid ja põhimõtted. Isikute vaba liikumise regulatsioonid ja põhimõtted.",
          "descriptionEn": "-",
          "studyLiterature": "1. A.Arrak, R.Eamets, E.Parts, K.Pihor, M.M.Piir, R.Omel, T.Roolaht, K.Timpmann, V.Trasberg, U.Varblane, E.Võrklaev. Eesti majandus – lõimumine Euroopa ja globaalses kontekstis. Avatar Holding OÜ, EAS, 2008.\n2. Majanduse ABC. 2002. Avatar\n3. Raudjärv, M. Majanduspoliitika alused. 2000. Mattimar\n4. Euroopa Liidu ametlik kodulehekülg http://ec.europa.eu/eesti/index_et.htm",
          "evaluationEt": "1.\tEttekanne seminaris\tÕppejõud jagab igale õpilasele iseseisva teema ettekande koostamiseks. Ettekanne esitatakse loengus. Iga ettekande järgselt toimub arutelu – küsimused kaasõpilastelt ja õppejõult. \n2.\tKirjalik tagasiside töö läbitud materjalide põhjal\tKirjalik töö, mis käsitleb õppeprotsessi käigus omandatud ning eeldab loengumaterjali tundmist ja iseseisva töö käigus omandatud teadmiste esitamise oskust.",
          "evaluationEn": "-",
          "independentStudyEt": "-Töö kirjanduse ja konspektiga\n- Ettekande koostamine ja esitamine",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30420
      },
      {
        "optional": true,
        "subject": {
          "id": 30417,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ014",
          "nameEt": "Protokoll ja etikett",
          "nameEn": "Protocol and Etiquette",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada arusaam protokollist ja etiketist, mis aitab erinevates ametialastes situatsioonides sobilikult käituda.",
          "objectivesEn": "Develop an understanding of protocol and etiquette that helps to behave appropriately in different professional situations.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\tselgitab tervitamis- ja tutvumiskombeid, visiitkaartide vahetamist, ametialast rõivastust, lauaetiketti, ametikohtumisi ja vastuvõttude liike;\n●\trakendab etiketi põhimõtteid ametikohtumiste ja vastuvõttude situatsioonides.",
          "outcomesEn": "Student who has passed the subject:\n● explains greeting and acquaintance customs, exchanging business cards, professional clothing, table etiquette, business meetings and types of receptions;\n● applies etiquette principles in business meetings and receptions.",
          "descriptionEt": "Protokolli ja etiketi mõiste. Protokolli ja etiketi ajalugu. Tervitamine ja tutvumine ametialases suhtluses ja isiklikus suhtluses. Tervitamine euroopalikus suhtlemiskultuuris. Noogutamine ja kummardamine, tervitamine ja peakatted, vastu- ja kaasatervitamine. Püsti tõusmine tervitamise ajal. Kätlemine. Põsesuudlus ja embamine. Käe suudlemine. Tutvumine üritusel. Külaliste vastuvõtt ja saatmine, tervitamine ärisuhetes ja diplomaatias. Hüvastijätmine. Visiitkaartide liigid, vormistamine, kasutamine, vahetamine. Ametikohtumiste ettevalmistamine, kutsed ja teadaanded, kohtumised. Vastuvõttude alaliigid, pidulikud lõuna- ja õhtusöögid, lauaetikett. Riietus, värvid ja aksessuaarid tööl ning üritusel. Hotell.",
          "descriptionEn": "Definition of protocol and label. History of protocol and label. Welcome and acquaintance in professional and personal communication. Welcome to a European communication culture. Nodding and worship, greeting and headgear, welcome and accompaniment. Standing up during the greeting. Handshake. Cheek kissing and embracing. Kissing your hand. Getting to know the event. Reception and sending of guests, greeting in business relations and diplomacy. Farewell. Types of business cards, preparation, use, exchange. Preparation of business meetings, invitations and announcements, meetings. Reception subtypes, gala lunches and dinners, table etiquette. Clothing, colors and accessories at work and at events. Hotel.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30417
      },
      {
        "optional": true,
        "subject": {
          "id": 30788,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ050",
          "nameEt": "Konkurentsiõigus",
          "nameEn": "Competitive Law",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmisi Eesti konkurentsiõiguse olulisematest põhimõtetest.",
          "objectivesEn": "To give the principle a solid test of Estonian competition law.",
          "outcomesEt": "Aine läbinud üliõpilane: \r\n•\tnimetab konkurentsiõiguse allikaid;\r\n•\tselgitab vertikaalsete ja horisontaalsete kokkulepete sisu;\r\n•\tselgitab turgu valitseva seisundi regulatsiooni;\r\n•\tnimetab ja selgitab keelatud koostöö rikkumise tagajärgi;\r\n•\ttoob välja ärisaladuse kaitse sisu ja vastutuse konkurentsialaste õigusrikkumiste eest.",
          "outcomesEn": "-",
          "descriptionEt": "Konkurentsiõiguse allikad. Vertikaalsed kokkulepped; horisontaalsed kokkulepped; keelatud koostöö rikkumise tagajärjed; turgu valitseva seisundi regulatsioon; ettevõtjate hinnapoliitika; turgu valitseva seisundi kuritarvitamise tagajärjed; konkurentsiõiguse nõuete järgmise programm; riigiabi; koondumiste kontroll; ärisaladuste kaitse problemaatika; vastutus konkurentsialaste õigusrikkumiste eest; leebusprogramm.",
          "descriptionEn": "Sources of competition law. Vertical agreements; horizontal agreements; consequences of violation of prohibited cooperation; regulation of market dominance; price policy of companies; the consequences of abuse of a dominant position; program for compliance with competition law requirements; state aid; concentration control; problems of protection of trade secrets; liability for competition offences; leniency program.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30788
      },
      {
        "optional": true,
        "subject": {
          "id": 30418,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ015",
          "nameEt": "Meeskonnatöö",
          "nameEn": "Teamwork",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada üliõpilasel valmisolek meeskonnatöö käivitamiseks ja juhtimiseks ning meeskonnatöös osalemiseks.",
          "objectivesEn": "To develop the readiness for the start and management of teamwork and participation in teamwork.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\tkirjeldab meeskonna toimimise põhialuseid;\r\n•\tkavandab ja käivitab meeskonnatööd;\r\n•\tedendab koostööd ja vajadusel motiveerib ning suunab meeskonnaliikmete käitumist ühise eesmärgi saavutamise nimel;\r\n•\ton salliv hoiakute ning väärtuste mitmekesisuse suhtes multikultuurses meeskonnas;\r\n•\tanalüüsib oma teadmiste, oskuste ja hinnangute kujunemist praktilise kogemuse kaudu.",
          "outcomesEn": "The student having passed the course:\n•\tdescribes the basics of teamwork;\n•\tplans and starts teamwork;\n•\tpromotes cooperation and if necessary, motivates and directs team members’ behaviour to achieve the common goal;\n•\tis tolerant of the diversity of attitudes and values in a multicultural team;\n•\tanalyses the development of their knowledge, skills and evaluations through practical experience.",
          "descriptionEt": "Meeskonnatööga seotud põhimõisted. Grupi ja meeskonna tunnused. Rollid meeskonnas. Meeskondade arengu üldpõhimõtted ja arenguetapid. Meeskonnatöö eesmärk. Eduka koostöö eeldused ja takistused meeskonnas. Koostööalane kompetentsus. Meeskonna usalduslikkus, efektiivsus ja emotsionaalne intelligentsus. Koostöö kujunemine meeskonnas. Meeskonna juhi tegevused meeskonna toimimisel. Juhi omadused ja erinevad juhtimisstiilid. Meeskonna edutegurid ja meeskonnaliikmete võimustamine ja innustamine. Meeskondade mittetoimimise põhjused. Probleemide ennetamine ja konfliktide lahendamise võimalused. Konstruktiivse tagasiside võimalused positiivsel ja negatiivsel meetodil.",
          "descriptionEn": "Basic terms of teamwork. Identification of the group and team. Roles in the team. General principles and stages of development in the development of teams. The aim of teamwork. Prerequisites and obstacles of successful cooperation in the team. Enhanced cooperation competence. Trust, effectiveness, and emotional intelligence of the team. Development of cooperation in the team. Team leader’s activities in managing the team. Leader’s qualities and different leadership styles. Success factors of the team and empowerment and encouragement of team members. Reasons for malfunctioning of teams. Prevention of problems and possibilities for solving conflicts. Options for constructive feedback using positive and negative methods.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30418
      },
      {
        "optional": true,
        "subject": {
          "id": 30779,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ041",
          "nameEt": "Vene keel",
          "nameEn": "Russian",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua eeldused ärijuhi tööks vajaliku vene keele suulise ja kirjaliku väljendusoskuse omandamiseks ning igapäevatöös ettetulevate probleemide lahendamiseks.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\trakendab käsitletud sõnavara kirjalikult ja suuliselt.\n•\tvestleb vene keeles, osaleb erialastes aruteludes, põhjendab ja selgitab oma seisukohti.\n•\tkoostab vajadusel erinevaid dokumente vene keeles.\n•arvestab kultuuride eripärasid erialases suhtluses.",
          "outcomesEn": "-",
          "descriptionEt": "Ärisuhtlemine ja etikett. Ametialane suhtlemine. Ärikohtumine. Hind. Raha ja pangandus. Ettevõtlus. Ettevõtted ja firmad. Euroopa Liit. Riigid ja rahvad. Aja planeerimine. Reklaam. Erinevate tööalaste dokumentide koostamine. Ärikirjad. Numbrite kasutamine: põhiarvsõnad, järgarvsõnad, protsent, valuutad.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30779
      },
      {
        "optional": true,
        "subject": {
          "id": 36527,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "RKE129",
          "nameEt": "Veebirakenduste loomise alused",
          "nameEn": "Basics of Creating Web Applications",
          "description": null,
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "100%  veebipõhine kursus",
          "objectivesEt": "Õppeaine edukal läbimisel oskab tudeng asünkroonsete osadega platvormidest sõltumatuid veebirakendusi luua kasutades kaasaaegset veebiraamistikku.",
          "objectivesEn": "The course is intended for the course participant to create and explain platform-independent platforms with asynchronous components using a state-of-the-art web framework.",
          "outcomesEt": "Selle kursuse läbinud üliõpilane:\n-kasutab veebirakenduses kasutatavaid märgendikeeli ning oskab nende abil kujundada soovitud väljundi, mis vastab W3C standardile;\n-kasutab veebirakenduste loomisel seadmetundliku disaini põhimõtteid.\n-kasutab veebirakenduste loomisel JavaScripti ja enamlevinud JavaScript-i teeke;\n-kasutab AJAX meetodeid asünkroonsete veebirakenduste ja nende osade loomiseks;\n-kasutab veebirakenduste loomisel levinud raamistikku;\n-kasutab veebirakenduste silumisvahendeid;",
          "outcomesEn": "The student:\n-structures and implements HTML/CSS markup in accordance with the W3C standards;\n-creates websites that can be viewed across devices of all sizes\n-implements basic JavaScript;\n-retrieves data via AJAX calls;\n-uses modern web development frameworks;\n-refactors code to improve the design, structure, and/or implementation of the web application.",
          "descriptionEt": "Veebirakenduste loomise alused, veebiprogrammeerimine, versioonihaldussüsteemide kasutamine, veebirakenduse avaldamine internetis kasutades tasuta saadavaid teenuseid.",
          "descriptionEn": "Basics of web development, web development; version control; website deployment using free-to-use services.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": "100% online course",
          "isPractice": false,
          "schoolDepartment": "Reaalainete keskus",
          "subjectLanguages": ["Inglise keel", "Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 36527
      },
      {
        "optional": true,
        "subject": {
          "id": 30787,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ049",
          "nameEt": "Hinnakujundus",
          "nameEn": "Pricing",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmisi hinnakujunduse erinevatest aspektidest ning luua praktilised oskused hinnakujunduse teostamiseks.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\tselgitab hinnakujunduse olemust ja tähtsust ettevõtte kasumi kujundamise protsessi lõpptulemusena;\n•\teristab üksteisest hinnakujunduse erinevaid meetodeid ning oskab välja tuua meetodite kasutamisotstarvet; \n•\tkirjeldab müügihinna ja omahinna vahelisi seoseid ülesannete praktilise lahendamise kaudu.",
          "outcomesEn": "-",
          "descriptionEt": "Hind, hinnakujunduse olemus, tähtsus, meetodid. Majandusaastaaruanne kui infoallikas kasumi/kahjumi suurendamise/vähendamise kohta. Hinnakujunduse erinevad meetodid ja rakendamise võimalused. Segmenteerimine ja kategooriate analüüsimine. Hinnakujunduse võtmeküsimused (nõudlus ja pakkumine, tasakaal, kitsaskohad tuludes ja kuludes). Hinnakujundus toote elutsükli jooksul. Kasumiaruanne ja selle skeemid, jääktulupõhine aruanne ja selle analüüs. Tulude ja kulude analüüs, juhtimisotsused kasumi/kahjumi korral. Toote hinnakujundus ja selle võimalikud variandid meetodite rakendamise kaudu.\r\n\r\n ",
          "descriptionEn": "Price, nature of pricing, importance, methods. Annual report as a source of information on increasing / decreasing profit / loss. Different pricing methods and implementation options. Segmentation and category analysis. Key pricing issues (supply and demand, balance, revenue and expenditure bottlenecks). Pricing during the product life cycle. Income statement and its schemes, residual income statement and its analysis. Revenue and cost analysis, management decisions in case of profit / loss. Product pricing and its possible variants through the application of methods.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30787
      },
      {
        "optional": true,
        "subject": {
          "id": 37234,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ018",
          "nameEt": "Digilahendused personalitöös",
          "nameEn": "Digital Solutions in Human Resource Field",
          "description": null,
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": null,
          "objectivesEt": "Arendada üliõpilaste oskusi inimeste juhtimisega seotud protsessidest digilahendusi kasutades",
          "objectivesEn": "The aim of the course is to develop students' skills in human resources (HR) management processes using digital solutions.",
          "outcomesEt": "",
          "outcomesEn": "",
          "descriptionEt": "Personalitöö digitaliseerimise vajadus ja tähtsus. Inimeste juhtimise protsess ja funktsioonid. Personalijuhtimiskesksest lähenemisest töötajakogemuseni. Virtuaalsed meeskonnad. Juhi ja töötaja roll inimeste juhtimisega seotud protsessides digilahendusi kasutades. Personalitöö protsessis kasutatavad digilahendused: Persona v3, Recrur, RecruiterLab, SinuLab (personalihaldus, värbamine, töötaja iseteenindus, tulemusjuhtimine, koolitus, arenguvestlus, karjäär jne), Begin. Personalitööd toetavate digilahenduste analüüs ja hindamine.",
          "descriptionEn": "The need and importance of digitalization of HR processes. HR management processes and functions. From a HR management-centric approach to employee experience. Virtual teams. The role of managers and employees in HR management processes using digital solutions. Software platform used in HR management processes: Persona v3, Recrur, RecruiterLab, Begin and SinuLab (managing employment records, recruitment, employee self-service, performance management, training, development interview, career, etc.). Analysis and evaluation of digital solutions supporting HR management processes.",
          "studyLiterature": null,
          "evaluationEt": null,
          "evaluationEn": null,
          "independentStudyEt": null,
          "independentStudyEn": null,
          "additionalInfo": null,
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 37234
      },
      {
        "optional": true,
        "subject": {
          "id": 30782,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ044",
          "nameEt": "Ärieetika",
          "nameEn": "Business Ethics",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda ülevaade ärieetika põhiprintsiipidest ja eetilistest hoiakutest äritegevuses.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n• mõistab eetilise äri tähtsust;\n• tunneb ära eetilise ja ebaeetilise situatsiooni, oskab viimasele tähelepanu pöörata, teadvustada ning lahendada.",
          "outcomesEn": "-",
          "descriptionEt": "Ärieetika sisu ja ajalooline areng. Eetika mõju ühiskonnale, majanduskeskkonnale ja äritegevusele. Avalik hoiak ja ühiskonna moraalsed normid. Väärtushinnangud ja nende mõju äritegevusele. Töö- ja kutse-eetika. Tööandja õigused ja eetiline vastutus. Töövõtja õigused ja eetiline vastutus. Töösuhete eetika. Äritegevuse eetilisus, sh turunduse, reklaami ja tarbijasuhete eetika. Sotsiaalne vastutus.",
          "descriptionEn": "Content and historical development of business ethics. The impact of ethics on society, the economic environment and business. Public attitude and moral norms of society. Values ​​and their impact on business. Work and professional ethics. Employer rights and ethical responsibility. Contractor rights and ethical responsibility. Industrial relations ethics. Business ethics, including marketing, advertising and consumer relations ethics. Social responsibility.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30782
      },
      {
        "optional": true,
        "subject": {
          "id": 30415,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ012",
          "nameEt": "Küsimustike ja andmestike koostamine",
          "nameEn": "Questionnaire Design and Data Collection",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda praktilisi oskusi lõputöö empiirilise uuringu läbiviimiseks vajalike statistiliste andmete kogumiseks ning metoodika kirjeldamiseks",
          "objectivesEn": "To provide students with practical skills for collecting statistical data and describing the methodology to carry out empirical research.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tkoostab eesmärgipäraste küsimustega küsimustiku kasutades kontoritöö- või veebipõhise tarkvara võimalusi ning kasutab seda pilootuuringu läbiviimisel; \n•\tleiab avalikest andmebaasidest oma uurimisvaldkonnaga seotud teiseseid andmeid;\n•\tomab ülevaadet lõputöö empiirilise uuringu metoodika peatüki sisust.",
          "outcomesEn": "The student having passed the course:\n•\tdesigns a questionnaire with purposeful questions utilising the opportunities of office or web based software, and uses it in their pilot research;\n•\tfinds secondary data concerning their field of study from public databases;\n•\thas an overview of the methodology chapter of the empirical research of the graduation thesis.",
          "descriptionEt": "Andmekogumismeetodite eripärad ja piirangud,, nende valiku põhimõtted. Valimi, küsimustiku ja vaatlustabeli koostamise põhimõtted. Statistiliste skaalade erinevused. Statistiliste andmestike koostamine ja korrastamine. Sotsiaaldemograafiliste andmete kogumine. Küsimustiku saateteksti koostamine. Küsimustiku valiidsus ja reliaablus. Veebipõhiste küsimustike kasutamine. Majandusvaldkonna avalikud andmebaasid.",
          "descriptionEn": "Specifics and limitations of data collection methods, principles of their selection. Principles of sampling strategies, preparation of the questionnaire and observation table. Differences of statistical scales. Preparation and tidying of statistical databases. Collection of socio-demographic data. Preparation of clearly formulated questions. Validity and reliability of questions. Utilisation of web based questionnaires. Public databases in economics. Description of the methodology of the empirical research (approach, strategy, sample, methods of data collection and analysis).",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30415
      },
      {
        "optional": true,
        "subject": {
          "id": 30790,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ052",
          "nameEt": "Tarbija ostukäitumine ja turu-uuringud",
          "nameEn": "Consumer Behaviour and Market Research",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalus tarbijate ostukäitumise mõistmiseks ja erinevat tüüpi turu-uuringute läbiviimiseks.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tmääratleb tarbija hoiakuid ja käitumist mõjutavaid tegureid ja eristab tarbijate erinevaid rolle otsustusprotsessis;\n•\tanalüüsib tarbija ostukäitumist ja ostumehhanisme ja planeerib ühe tarbija-uuringu;\n•\tpüstitab erinevat liiki turu-uuringutele eesmärgid, hüpoteesid, samuti uurimisülesanded ja -küsimused; \n•\tviib läbi turu-uuringu grupitööna, selgitades selle läbiviimise etappe, metoodikat, tulemusi ja rakendusettepanekuid.",
          "outcomesEn": "-",
          "descriptionEt": "Tarbijakäitumise olemus ja mõjurid. Tarbeturg ja organisatsiooniturg. Tarbija ostukäitumine. Ostukäitumine ja ostuobjekt. Tarbija ostuotsustusmõjurid. Tarbija rahulolu.                                Turu-uuringu olemus. Uuringu probleemid. Eesmärkide, ülesannete ning hüpoteeside püstitamine. Turu-uuringu liigid. Metoodikad ja nende rakendamine. Turu-uuringu etapid ja läbi viimine. Uuringu tulemuste analüüsimine. Uuringu esitamine ja rakendusvaldkonnad.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30790
      },
      {
        "optional": true,
        "subject": {
          "id": 30300,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMA025",
          "nameEt": "FIE raamatupidamine ja maksuarvestus",
          "nameEn": "Sole Trader Accounting and Taxation",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada füüsilisest isikust ettevõtja kassapõhise  raamatupidamisarvestuse ja maksude ning maksete rakendusoskus.",
          "objectivesEn": "To develop the application skills in the field of sole trader’s cash based accounting and tax and payment accounting.",
          "outcomesEt": "Aine läbinud üliõpilane:\n●\toskab pidada kassapõhist arvestust;\n●\toskab anda soovitusi raamatupidamise sise-eeskirja koostamiseks;\n●\toskab koostada FIE ettevõtlustulu deklaratsiooni E vormi;\n●\toskab arvutada ja arvestada FIE tegevusega seotud makse ja makseid.",
          "outcomesEn": "The student having passed the course:\n•\tis able to carry out cash based accounting;\n•\tis able to give recommendations for designing internal accounting regulations and policies;\n•\tis able to fill in the e-form of the sole trader’s income tax return;\n•\tis able to calculate and account for the sole trader’s taxes and payments.",
          "descriptionEt": "FIE kui ettevõtlusvormi eelised ja puudused.Tegevuse alustamine, registreerimine äriregistris; ärinimi. Kassapõhine ja tekkepõhine arvestus. FIE kassapõhine arvestus: nõuded arvestusele, algdokumentidele, arvestusregistritele, dokumentide säilitamisele, raamatupidamise sise-eeskirja koostamine. FIE maksustamise põhimõtted: maksukalender, sotsiaalmaks, tulumaks, kohustusliku kogumispensioni makse, maksukohustused tööandjana. Ettevõtluse tulud ja kulud, isikliku ja ettevõtluse vara eristamine. Ettevõtlustulu deklareerimine.",
          "descriptionEn": "Advantages and disadvantages of being the sole trader. Starting sole trade business, registration in business register, business name. Cash based and accrual based accounting. Cash based accounting for the sole trader: requirements for accounting, accounts registers, archiving documents, design of internal accounting regulations and policies. Principles of taxation for sole traders: tax calendar, social tax, income tax, funded pension payments, tax obligations as an employer. Sole trader’s revenues and expenses, differentiation of personal and business assets. Declaration of sole trader’s income tax return.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30300
      },
      {
        "optional": true,
        "subject": {
          "id": 30785,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ047",
          "nameEt": "Loogika",
          "nameEn": "Logic",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused loogika abil teha õigeid järeldusi erialases töös.",
          "objectivesEn": "Create opportunities to use logic to draw the right conclusions in professional work.",
          "outcomesEt": "Aine läbinud üliõpilane:\r\n•\ttunneb loogika olemust ja tähtsust;\r\n•\tjälgib oma mõtete loogikat igapäevases töös;\r\n•\tkasutab loogika rakendusi erialases töös.",
          "outcomesEn": "-",
          "descriptionEt": "Formaalse loogika aine ja meetod. Mõisteõpetus. Otsustusõpetus. Järeldusõpetus. Küsimus. Tõestus.",
          "descriptionEn": "The substance and method of formal logic. Concept teaching. Decision making. Conclusion. Question. Proof.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30785
      },
      {
        "optional": true,
        "subject": {
          "id": 30791,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ053",
          "nameEt": "Internetiturundus",
          "nameEn": "Internet Marketing",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Anda teadmised internetiturunduse erinevatest harudest ning oskused saadud teadmisi rakendada kooskõlas ettevõtte turundusplaaniga.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tteab internetiturunduse harusid ja võimalusi toodete-teenuste turundamisel internetis; \n•\toskab püstitada ettevõtte eesmärke internetis, määrata sihtrühma, analüüsida konkurente;\n•\tmõistab hinnakujunduse, müügi ja jaotuse strateegiaid, erinevate reklaamikanalite võimalusi; \n•\tosaleb oma ettevõtte internetiturunduse strateegia näidise loomises ja koostab internetiturunduse plaani näidise.",
          "outcomesEn": "-",
          "descriptionEt": "Internetiturunduse eelised ja võimalused. Internetiturunduse alustamine Eestis – juriidilised aspektid. Otsingumootoriturundus. Blogiturundus. Viirusturundus. E-postiturundus. Artikliturundus. Videoturundus. Veebilehed, kampaanialehed. Ettevõtte eesmärgid internetis. Sihtrühm. Reklaamikanalid. Suunatud reklaam ja sotsiaalne meedia. Analüütika rakenduste kasutamine. Interneti turundusplaani koostamine.",
          "descriptionEn": "-",
          "studyLiterature": "1.\tAavik, H. (2010). Praktiline internetiturundus: seitse sammu eduka ärini internetis. Tallinn: Äripäeva Raamatuklubi.\n2.\tLuik, E. (2008). E-turunduse alused. Tallinn: Adm interactive.\n3.\tLuik, E. (2011). Internetiturundaja lauaraamat. Tallinn: Äripäeva Raamatuklubi.",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "Iseseisvate tööde juhendid, ülesanded ja nõuded on leitavad Moodle kursusel ja neid tutvustatakse ka esimeses kontaktõppe tunnis",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30791
      },
      {
        "optional": true,
        "subject": {
          "id": 30780,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ042",
          "nameEt": "Eraisiku rahandus",
          "nameEn": "Private Finance",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada arusaam eraisiku rahaasjade planeerimisest ning toetada toimetulekuvõimet.",
          "objectivesEn": "-Develop an understanding of individual financial planning and support coping.",
          "outcomesEt": "Aine läbinud üliõpilane: \n•\tomab teadmisi igapäevaste rahaasjade teadlikust korraldamisest ning toimetuleku tugevdamisest rahalise heaolu saavutamiseks;\n•\ton võimeline vältima võlgade tekkimist;\n•\tomab ülevaadet võlanõustamisega seotud abistamise võrgustikust ning toetustest.",
          "outcomesEn": "-Student who has passed the subject:\n• has knowledge of conscious management of everyday financial affairs and strengthening of coping to achieve financial well-being;\n• is able to avoid incurring debts;\n• has an overview of the debt counseling assistance network and grants.",
          "descriptionEt": "Eraisiku rahaasjade planeerimine. Majapidamisaruanne. Lühi- ja pikaajalised finantsplaanid. Igapäevased väljaminekud, väljaminekute eelarvestamine ja finantseerimine. Puhasväärtus. Säästmine, investeerimine. Elukaar ja -sündmused. Reservid. Laen ja laenuvõlglane. Käendus ja käenduse sisu. Solidaarvastutus. Võlanõustamine, teenuse sisu ja eesmärk. Eraisiku pankrot. Sotsiaaltoetused.",
          "descriptionEn": "-Private financial planning. Household report. Short-term and long-term financial plans. Daily expenses, budgeting and financing of expenses. Net worth. Saving, investing. Life cycle and events. Reserves. Loan and borrower. Guarantee and guarantee content. Joint and several liability. Debt counseling, content and purpose of the service. Bankruptcy of a private individual. Social benefits.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30780
      },
      {
        "optional": true,
        "subject": {
          "id": 30416,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MMÕ013",
          "nameEt": "Andmekaitse",
          "nameEn": "Data Protection",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Kujundada teadmised ja oskused andmekaitsenõuete rakendamiseks ning isikuandmete töötlemiseks erialases töös.",
          "objectivesEn": "To develop knowledge and skills for the application of data protection requirements and processing personal data in professional work.",
          "outcomesEt": "Aine läbinud üliõpilane: \n●\trakendab andmekaitse üldmääruse nõudeid ja isikuandmete töötlemise põhimõtteid juhtumite lahendamisel;\n●\tviib läbi andmetöötlustoimingute kaardistamise vastavalt õiguslikule regulatsioonile; \n●\tkoostab andmekaitsealaseid juhendeid isikuandmete töötlemiseks lähtuvalt andmekaitse üldmäärusest ja isikuandmekaitse seadusest.",
          "outcomesEn": "The student having passed the course:\n•\tuses the requirements of the general regulation on data protection and the principles of processing personal data in solving cases;\n•\tmaps data processing activities according to legislative regulations;\n•\tprepares data protection guidelines for processing personal data according to the general regulation on data protection and data protection act.",
          "descriptionEt": "Andmekaitse üldmäärus ja selle rakendamine Eestis. Organisatsioonile kohanduvad andmekaitsenõuded. Vastutav töötleja, volitatud töötleja. Isikuandmete kaitse seadus. Isikuandmete töötlemise põhimõtted. Isikuandmete töötlemise alused. Andmetöötlustoimingute kaardistamine ja ülevaate loomine isikuandmete töötlemisest. Seaduslikkuse, õigluse ja läbipaistvuse põhimõtted isikuandmete töötlemisel. Rikkumine andmete töötlemisel. Jälgimisseadmestiku kasutamine asutuses.",
          "descriptionEn": "General regulation on data protection and its application in Estonia. Data protection requirements for organisations. Data controller, data processor. Personal data protection act. Principles of processing personal data. Basics of processing personal data. Mapping data processing activities and making an overview of personal data processing. Principles of lawfulness, fairness and transparency in processing personal data. Violation in data processing. Use of monitoring equipment in the company.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30416
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 220,
        "nameEt": "Personalijuhtimine",
        "nameEn": "Personnel Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      },
      {
        "id": 218,
        "nameEt": "Finantsjuhtimine",
        "nameEn": "Financial Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Lõputöö",
    "nameEn": "Graduation Thesis",
    "orderNr": null,
    "objectivesEt": "Eesmärgid\t\nLuua võimalused omandatud teadmiste ja oskuste rakendamiseks lõputöö koostamisel, analüüsi läbiviimisel ja tulemuste esitlemisel.\n\nÕpiväljundid\t•\t\nÜliõpilane \narendab, täiendab, süstematiseerib ja süvendab erialaseid teoreetilisi teadmisi ja oskusi uuritavas valdkonnas;\n•\toskab kohaseid meetodeid ja vahendeid kasutades iseseisvalt õppe- ja võõrkeelset informatsiooni koguda ning seda kriitiliselt ja loovalt tõlgendada;\n•\tviib läbi empiirilise uuringu, rakendades sobivaid uurimismeetodeid ning analüüsi- ja üldistusoskust; \n•\tinterpreteerib uuringust saadud tulemusi ja esitleb akadeemilisel viisil.",
    "objectivesEn": "Objective:\nTo enable students utilise their knowledge and skills in preparing their graduation thesis, carrying out the analysis and presenting the results.\n\nLearning outcomes:\nThe student\n•\tdevelops, supplements, systemises and deepens professional theoretical knowledge and skills in the research field;\n•\tis able to independently collect information in a foreign language and interpret it critically and creatively using appropriate methods and tools;\n•\tcarries out an empirical research using appropriate research methods, and analytical and generalisation skills; \n•\tinterprets research results and presents them academically.",
    "outcomesEt": "Eesmärgid\t\nLuua võimalused omandatud teadmiste ja oskuste rakendamiseks lõputöö koostamisel, analüüsi läbiviimisel ja tulemuste esitlemisel.\n\nÕpiväljundid\t•\t\nÜliõpilane \narendab, täiendab, süstematiseerib ja süvendab erialaseid teoreetilisi teadmisi ja oskusi uuritavas valdkonnas;\n•\toskab kohaseid meetodeid ja vahendeid kasutades iseseisvalt õppe- ja võõrkeelset informatsiooni koguda ning seda kriitiliselt ja loovalt tõlgendada;\n•\tviib läbi empiirilise uuringu, rakendades sobivaid uurimismeetodeid ning analüüsi- ja üldistusoskust; \n•\tinterpreteerib uuringust saadud tulemusi ja esitleb akadeemilisel viisil.",
    "outcomesEn": "Objective:\nTo enable students utilise their knowledge and skills in preparing their graduation thesis, carrying out the analysis and presenting the results.\n\nLearning outcomes:\nThe student\n•\tdevelops, supplements, systemises and deepens professional theoretical knowledge and skills in the research field;\n•\tis able to independently collect information in a foreign language and interpret it critically and creatively using appropriate methods and tools;\n•\tcarries out an empirical research using appropriate research methods, and analytical and generalisation skills; \n•\tinterprets research results and presents them academically.",
    "typeNameEt": null,
    "typeNameEn": null,
    "totalCredits": 9,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 9,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Lõputöö",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 30797,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ061",
          "nameEt": "Lõputöö",
          "nameEn": "Graduation Thesis",
          "description": "-",
          "credits": 9,
          "assessment": "eksam (eristav hindamine)",
          "assessmentCode": "HINDAMISVIIS_E",
          "assessmentDescription": "-",
          "objectivesEt": "Toetada erialase rakendusuuringu läbiviimise ja akadeemilise teksti kirjutamise oskust, mis suurendab üliõpilase konkurentsivõimet tööturul ning võimaldab jätkata õpinguid magistri- ja/või elukestvas õppes.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane:\n•\tarendab, täiendab, süstematiseerib ja süvendab erialaseid teoreetilisi teadmisi ja oskusi\nuuritavas valdkonnas;\n•\tkavandab ja viib läbi empiirilise uuringu, rakendades sobivaid uurimismeetodeid ning analüüsi- ja üldistusoskust;\n•\tinterpreteerib uuringust saadud tulemusi ja esitleb akadeemilisel viisil.",
          "outcomesEn": "-",
          "descriptionEt": "Lõputöö on rakendusliku iseloomuga uurimistöö, mis näitab üliõpilase oskust kasutada teoreetilisi teadmisi uuritava valdkonna praktiliste probleemide lahendamisel. Töös on integreeritud nii teoreetiline kui empiiriline käsitlusviis, uurimisülesannete lahendamiseks kasutatakse sobivat uurimistöö metoodikat. \r\nValmis lõputööle annab hinnangu enne kaitsmist retsensent. Lõputöö esitlemine ja kaitsmine toimub komisjoni ees, kes hindab lõputööd vastavalt koolis kehtivatele hindamiskriteeriumitele ja annab tööle lõpliku hinnangu, võttes arvesse retsensendi poolt antud arvamust.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "E",
        "subjectId": 30797
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 220,
        "nameEt": "Personalijuhtimine",
        "nameEn": "Personnel Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      },
      {
        "id": 218,
        "nameEt": "Finantsjuhtimine",
        "nameEn": "Financial Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Praktika. Finantsjuhtimine",
    "nameEn": "Practical Training",
    "orderNr": null,
    "objectivesEt": null,
    "objectivesEn": null,
    "outcomesEt": null,
    "outcomesEn": null,
    "typeNameEt": null,
    "typeNameEn": null,
    "totalCredits": 42,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 42,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Praktika",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 30778,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ040",
          "nameEt": "Strateegilise juhtimise praktika",
          "nameEn": "Strategic Management Practical Training",
          "description": "-",
          "credits": 6,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalus rakendada teoreetilisi teadmisi ja oskusi ettevõtte strateegilises juhtimises ja arendamisel.",
          "objectivesEn": "Create an opportunity to apply theoretical knowledge and skills in the strategic management and development of the company.",
          "outcomesEt": "Praktika läbinud üliõpilane: \r\n•\tanalüüsib ettevõtte tegevuskeskkonda, makro- ja mikrokeskkonda;\r\n•\tkoostab ettevõtte strateegilisi dokumente (arengukava), formuleerib ettevõtte missiooni, visiooni ja eesmärgid;\r\n•\tanalüüsib erinevaid strateegiaid ja nende kasutamise võimalusi organisatsioonis, võttes vastutuse otsuste langetamise eest;\r\n•\tkoostab erinevaid organisatsiooni tegevuse strateegiaid.",
          "outcomesEn": "-",
          "descriptionEt": "Ettevõtte üldiseloomustus. Õiguslik vorm. Tegevusvaldkond ja tegevuskoht. Põhitegevused ja protsessid. Tooted ja/või teenused. Tuumikkompetentsid. Olemasolevad strateegilised dokumendid (millal loodud/kehtestatud, nende kehtivus, arendus jne). Ettevõtte väliskeskkond. Seadusandlus (ka võimalikud lähiaja muudatused). Erinevad valdkonda puudutavad normdokumendid. Maksud ja tegevusload. Konkurendid, hankijad, kliendid. Väliskeskkonnast tulenevad võimalused ja ohud ning nende kasutamine/vältimine. Ettevõtte sisekeskkond. Ettevõtte struktuur ja juhtimine. Kasutatavad juhtimismudelid. Ressursid ja kompetentsid, nende arendamine. Kvaliteedisüsteem. Sisemise toimimise reeglid: juhendid, sise-eeskirjad jne. Strateegilised tegevused. Ettevõtte juhtimine. Strateegiate koostamine. Missioon. Visioon. Eesmärgid. Tegevuskava. Turundusstrateegia sh hinnakujundus. Põhitegevuste juhtimine (sh tootmine, tehnoloogia, kvaliteet ja strateegiad). Arendamine (sh personal, koolitustegevus, õppiv organisatsioon, innovatsioon jne).",
          "descriptionEn": "General nature of the company. Legal form. Field of activity and place of activity. Core activities and processes. Products and/or Services. Core competencies. Existing strategic documents (when created/implemented, their validity, development, etc.). The company's external environment. Legislation (also possible near-term changes). Various normative documents concerning the field. Taxes and licenses. Competitors, suppliers, customers. Opportunities and threats arising from the external environment and their use/avoidance. The company's internal environment. Company structure and management. Management models used. Resources and competences, their development. Quality system. Rules of internal operation: manuals, internal regulations, etc. Strategic actions. Business management. Formulation of strategies. Mission. Vision. Goals. Action plan. Marketing strategy including pricing. Management of core activities (including production, technology, quality and strategies). Development (including personnel, training activities, learning organization, innovation, etc.).",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30778
      },
      {
        "optional": false,
        "subject": {
          "id": 30777,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ039",
          "nameEt": "Finantsjuhtimise praktika",
          "nameEn": "Financial Management Practical Training",
          "description": "-",
          "credits": 9,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada finantsjuhtimise teoreetilisi teadmisi ja oskusi, et arendada finantsjuhtimise alaseid vilumusi.",
          "objectivesEn": "-",
          "outcomesEt": "Aine läbinud üliõpilane: \r\n•\tanalüüsib finantsjuhtimise korraldust ettevõttes;\r\n•\thindab ettevõtte käibekapitali juhtimist ning toob välja ettevõtte võimalused kitsaskohtade vältimiseks ning ettevõtte finantsjuhtimise parendamiseks;\r\n•\tanalüüsib ja teeb ettepanekuid ettevõtte tegevusaruande koostamiseks ja hindab ettevõtte väärtust;\r\n•\thindab oma- ja võõrkapitali kasutamist ning koostab parendusettepanekud;\r\n•\tteostab investeeringute analüüsi ning põhjendab kapitali kasutamist.",
          "outcomesEn": "-",
          "descriptionEt": "Finantsjuhtimise olemus, finantsjuhtimise korraldamine. Käibekapital. Käibekapitali juhtimine. Raha-, varude-, nõuete-, lühiajaliste kohustiste juhtimine. Vastutus. Tegevusaruanne, sh aruande koostamise seadusandlik taust ja regulatsioon. Ettevõtte väärtust kujundavad tegurid, väärtuse hindamise metoodika. Ettevõtte väärtuse hindamine. Finants- ja reaalinvesteeringud. Investeeringute analüüs ja hindamine. Kapitali kaasamine. Oma- ja võõrkapital. Otsused finantsjuhi seisukohast.",
          "descriptionEn": "-",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30777
      },
      {
        "optional": false,
        "subject": {
          "id": 30773,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ035",
          "nameEt": "Ettevõtluse praktika II",
          "nameEn": "Entrepreneurship Practical Training II",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada koolis omandatud teoreetilisi teadmisi ettevõtte põhitegevuste, sise- ja väliskeskkonna, turundustegevuse, dokumendihalduse ning raamatupidamise korraldamise analüüsimisel.",
          "objectivesEn": "To create opportunities to apply the theoretical knowledge acquired at school in the analysis of the company's main activities, internal and external environment, marketing activities, document management and accounting.",
          "outcomesEt": "Praktika läbinud üliõpilane: \n•\tselgitab ettevõtte dokumendihalduse ja raamatupidamise korraldust ning põhimõtteid, \n•\tanalüüsib ettevõtte töökeskkonda, selle regulatsiooni.",
          "outcomesEn": "Internship student:\n• explains the organization and principles of the company's document management and accounting,\n• analyzes the company's working environment, its regulation.",
          "descriptionEt": "Ettevõtte raamatupidamine, selle korraldamine: raamatupidamise sise-eeskirjad; raamatupidamistarkvara. Ettevõtte turundustegevus ja –juhtimine. Turundustegevuse korraldamine ettevõttes, turunduskeskkond, turg, turu segmentimine, positsioneerimine, konkurentsianalüüs, turundusmeetmestiku (tooted/teenused, hinnakujundus, turustuskanalid, müügitoetus) rakendamine ettevõttes., töötervishoid, tööohutus. Töökeskkonna riskianalüüs; ohu-, keelu-, hoiatus-, kohustus- vms märgid; kaitsevahendid. Esmaabi, esmaabiandjad, esmaabivahendid; elektriohutuseeskirjad; töökeskkonnaspetsialisti olemasolu, töötajate sissejuhatav ja esmane instrueerimine, dokumentatsioon.",
          "descriptionEn": "Company accounting, its organization: internal accounting rules; accounting software. Work environment, occupational health, occupational safety. Work environment risk analysis; danger, prohibition, warning, obligation or similar signs; protective equipment. First aid, first aiders, first aid equipment; electrical safety rules; existence of a work environment specialist, introductory and initial instruction of employees, documentation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30773
      },
      {
        "optional": false,
        "subject": {
          "id": 30772,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ034",
          "nameEt": "Ettevõtluse praktika I",
          "nameEn": "Entrepreneurship Practical Training I",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada koolis omandatud teoreetilisi teadmisi ettevõtte põhitegevuste, sise- ja väliskeskkonna (s.h töökeskkonna), dokumendihalduse ning turundustegevuse analüüsimisel.",
          "objectivesEn": "To create opportunities to apply the theoretical knowledge acquired at school in the analysis of the company's main activities, internal and external environment, document management and marketing activities.",
          "outcomesEt": "Praktika läbinud üliõpilane: \n-selgitab ettevõtte tegevusvaldkondi, põhitegevust ning organisatsiooni struktuuri;\n-selgitab ettevõtte dokumendihalduse korraldust ning põhimõtteid;\n-analüüsib ettevõtte turunduse ja selle juhtimisega seotud tegevusi, loetleb turundusmeetmeid ja selgitab nende rakendamist firma eesmärkide täitmisel.",
          "outcomesEn": "Internship student:\n-explains the company's areas of activity, main activities and organizational structure;\n-explains the organization and principles of the company's document management;\n-analyzes the company's marketing and management activities, lists marketing measures and explains their implementation in meeting the company's objectives.",
          "descriptionEt": "Ettevõtte üldiseloomustus. Õiguslik vorm, ettevõtte tegevusvaldkond, põhitegevus, organisatsiooni struktuur. Dokumendihaldus. Juhendid. Asjaajamise korraldamine, ametikirjade vormistamine, dokumendiringlus. Dokumendihaldus-tarkvara. Töökeskkond, töötervishoid, tööohutus. Töökeskkonna riskianalüüs; ohu-, keelu-, hoiatus-, kohustus- vms märgid; kaitsevahendid. Esmaabi, esmaabiandjad, esmaabivahendid; elektriohutuseeskirjad; töökeskkonnaspetsialisti olemasolu, töötajate sissejuhatav ja esmane instrueerimine, dokumentatsioon.",
          "descriptionEn": "General description of the company. Legal form, field of activity of the company, main activity, organizational structure. Document management. Instructions. Administration, preparation of official letters, document circulation. Document management software. Work environment, occupational health, occupational safety. Work environment risk analysis; danger, prohibition, warning, obligation or similar signs; protective equipment. First aid, first aiders, first aid equipment; electrical safety rules; existence of a work environment specialist, introductory and initial instruction of employees, documentation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30772
      },
      {
        "optional": false,
        "subject": {
          "id": 30775,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ037",
          "nameEt": "Finantsaruandluse ja -analüüsi praktika",
          "nameEn": "Financial Reporting and Analysis Practical Training",
          "description": "-",
          "credits": 9,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada teoreetilisi finantsaruandluse ja -analüüsialaseid teadmisi ja oskusi kompaktselt töökeskkonnas.",
          "objectivesEn": "To create opportunities to apply theoretical knowledge and skills holistically in financial reporting and analysis in a work environment.",
          "outcomesEt": "Praktika läbinud üliõpilane:\n•\tiseloomustab ettevõtet, tema tegevusvaldkondi;\n•\tkirjeldab majandusaasta aruande koostist ja koostamise käiku;\n•\tanalüüsib erinevate arvestuspõhimõtete ja hinnangute mõju ettevõtte finantspositsioonile;\n•\tanalüüsib ettevõtte põhilisi finantsaruandeid – bilanssi, kasumiaruannet, rahavoogude aruannet ja ettevõtte finantstegevuse erinevaid valdkondi (maksevõimet, efektiivsust sh tootlikkust, tasuvust, finantsseisundit), kasutades sobivat infobaasi, analüüsi võtteid, meetodeid ja valemeid, põhjendab tehtud valikut;\n•\tteeb finantsanalüüsi põhjal järeldusi ja pakub välja lahendusi ettevõtte finantsolukorra parendamiseks ning vastavate juhtimisotsuste tegemiseks.",
          "outcomesEn": "The student, having passed the practical training:\n●\tcharacterises the company and its fields of activity;\n●\tdescribes the composition of the annual report and the process of its preparation;\n●\tanalyses the impact of various accounting policies and evaluations on the company's financial position;\n●\tanalyses the company's main financial statements - balance sheet, income statement, cash flow statement and various areas of the company's financial activities (solvency, efficiency including productivity, profitability, financial position), using a suitable information base, analysis techniques, methods and formulae, justifies the choice;\n●\tdraws conclusions from the financial analysis and proposes solutions to improve the company's financial situation and makes appropriate management decisions.",
          "descriptionEt": "1.\tTutvub ettevõttega ja kirjeldab õigusvormi, põhitegevust, struktuuriüksusi, tegevuseesmärke.\n2.\tKirjeldab majandusaasta aruande koostist ja koostamist.\n3.\tAnalüüsib erinevate arvestuspõhimõtete ja hinnangute mõju ettevõtte finantspositsioonile.\n4.\tViib läbi ettevõtte finantsanalüüsi:\n4.1 Tutvub ettevõtte finantsanalüüsi infobaasiga sh raamatupidamise aastaaruannetega kahe viimase majandusaasta kohta.\n4.2 Koostab ettevõtte finantsanalüüsi, mis koosneb järgmistest põhiosadest:\n•\tettevõtte üldiseloomustus (asukoht, tegevusvaldkond, töötajate arv, müügitulemused, finantsaruannete koostamise põhimõtted jne),\n•\tbilansi, kasumiaruande ja rahavoogude aruande horisontaal - ja vertikaalanalüüs,\n•\tmaksevõime analüüs, efektiivsuse analüüs, tasuvuse analüüs, pankrotiohu analüüs,\n•\tjäreldused ja ettepanekud juhtimisotsusteks.",
          "descriptionEn": "1.\tGetting acquainted with the company - legal form, main activity, structural units, operational objectives.\n2.\tDescribing the composition and preparation of the annual report.\n3.\tAnalysing the impact of various accounting policies and evaluations on the company's financial position.\n4.\tProducing a financial analysis of the company:\n4.1 examining the company's financial analysis information base, including the annual accounts for the last two financial years;\n4.2 preparing a financial analysis of the company, which consists of the following main parts:\n●\ta general description of the company (location, field of activity, number of employees, sales results, principles of preparation of financial statements, etc.);\n●\thorizontal and vertical analysis of the balance sheet, income statement and cash flow statement;\n●\tsolvency analysis, efficiency analysis, profitability analysis, bankruptcy risk / financial condition analysis;\n●\tconclusions and proposals for management decisions.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30775
      },
      {
        "optional": false,
        "subject": {
          "id": 30774,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ036",
          "nameEt": "Juhtimise praktika",
          "nameEn": "Management Practical Training",
          "description": "-",
          "credits": 6,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalus juhtimise valdkonna teadmiste rakendamiseks praktikas läbi igapäevatöös osalemise ja kogetu analüüsimise.",
          "objectivesEn": "-To create an opportunity to apply knowledge in the field of management in practice through participation in daily work and analysis of experience.",
          "outcomesEt": "Aine läbinud üliõpilane: \n• analüüsib konkreetse organisatsiooni struktuuri, -kultuuri jt juhtimistegevusi ning viib läbi töötajate seas motivatsiooni- ja töörahulolu uuringu;\n• rakendab koolis saadud teoreetilisi süvateadmisi organisatsiooni igapäevases juhtimistegevuses sh keerulistes ja ettearvamatutes olukordades.",
          "outcomesEn": "-Student who has passed the subject:\n• analyzes the structure, culture and other management activities of a specific organization and conducts a survey of motivation and job satisfaction among employees;\n• applies the in-depth theoretical knowledge gained at school in the day-to-day management of the organization, including in complex and unpredictable situations.",
          "descriptionEt": "Tutvumine praktika baasiks oleva ettevõttega – tutvumine organisatsiooni struktuuri ja ametikohtadega, allüksuste ja juhtimistasemetega. Praktikaettevõtte struktuuri analüüs, -kultuuri analüüs. Juhi tööga tutvumine – juhi erinevate rollide täitmine Mintzbergi rollide jaotuse järgi. Juhi (lähijuhendaja) päeva pildistus koos rollide määratlemisega. Isiku ja organisatsiooni vahelised suhted praktikaettevõttes. Delegeerimine. Otsuste tegemine – otsuste liigid. Otsustamisprotsess. Näiteid praktikaettevõttest. Nõupidamised ja rühmaotsused. Koosolekute läbiviimise viisid. Planeerimine ja strateegiline juhtimine – organisatsiooni missioon. Praktikaettevõtte konkurentsi ja turundusstrateegiad/ arengukava analüüs. Aja juhtimine. Juhtimistöö praktikas – töötajate motivatsiooni ja töörahulolu uuringu teostamine praktikaettevõttes. Kvaliteedijuhtimine. Konfliktijuhtimine. Muutuste juhtimine praktikaettevõttes.",
          "descriptionEn": "-\nGetting acquainted with the company that is the basis of the internship - getting acquainted with the organizational structure and positions, subdivisions and management levels. Internship company structure analysis, culture analysis. Getting to know the job of a leader - fulfilling different roles of a leader according to the division of Mintzberg roles. A photo of the driver's (close supervisor) day with the definition of roles. Relationships between a person and an organization in an internship company. Delegation. Decision making - types of decisions. Decision making process. Examples of an internship company. Meetings and group decisions. Ways of holding meetings. Planning and strategic management - the mission of the organization. Internship competition and marketing strategies / development plan analysis. Time management. Management work in practice - conducting a survey of employee motivation and job satisfaction in an internship company. Quality management. Conflict management. Change management in an internship company.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30774
      },
      {
        "optional": false,
        "subject": {
          "id": 30776,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ038",
          "nameEt": "Juhtimisarvestuse praktika",
          "nameEn": "Management Accounting Practical Training",
          "description": "-",
          "credits": 6,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalus juhtimisarvestuse alaste teadmiste rakendamiseks praktikas läbi igapäevatöös osalemise ja kogetu analüüsimise.",
          "objectivesEn": "-",
          "outcomesEt": "Praktika läbinud üliõpilane:\r\n•\tanalüüsib ettevõttes rakendatud kuluarvestuse põhimõtteid ja –süsteemi ning teeb ettepanekuid kuluarvestuse süsteemi parendamiseks;\r\n•\tarvestab toote/teenuse omahinda ning teostab kulu-maht-kasum analüüsi;\r\n•\tesitab põhjendatud ettepanekud omahinna ja optimaalse tootmismahu kujundamiseks; \r\n•\tanalüüsib oma teadmiste, oskuste, väärtuste ja hinnangute kujunemist praktilise kogemuse kaudu;\r\n•\tesitleb praktika käigus sooritatud tegevusi lähtudes praktikaprogrammist",
          "outcomesEn": "-",
          "descriptionEt": "Praktika ülesanded\r\n1.\tTutvub ettevõttega - õigusvormiga, põhitegevusega, struktuuriüksustega, tegevuseesmärkidega. \r\n2.\tTutvub ettevõttes kasutatava kuluarvestussüsteemiga (kululiigid,  kohad, -kandjad) ja:\r\n•\tarvestab toote/teenuse omahinda;\r\n•\tteostab kulu-maht-kasum analüüsi;\r\n•\tsõnastab ettepanekuid omahinna ja optimaalse tootmismahu kujundamiseks.\r\n3.\tAnalüüsib oma teadmiste, oskuste, väärtuste ja hinnangute kujunemist saadud kogemuse põhjal.",
          "descriptionEn": "-Eelnevalt läbitud õpingud / omandatud õpiväljundid:\non kajastanud dokumentide alusel erineva suurusega majandusüksuse majandussündmusi arvestusregistrites;\non koostanud finantsaruandeid, lähtudes kehtivatest õigus- ja normatiivaktidest;\non rakendanud majandusmatemaatilisi- ja statistilisi meetodeid rahandussituatsioonide lahendamisel ning \nanalüüsimisel ja tulemuste tõlgendamisel;\non läbinud finantsanalüüsi ja juhtimisarvestuse kursuse",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30776
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 218,
        "nameEt": "Finantsjuhtimine",
        "nameEn": "Financial Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  },
  {
    "nameEt": "Praktika. Personalijuhtimine",
    "nameEn": "Practical Training",
    "orderNr": null,
    "objectivesEt": null,
    "objectivesEn": null,
    "outcomesEt": null,
    "outcomesEn": null,
    "typeNameEt": null,
    "typeNameEn": null,
    "totalCredits": 42,
    "optionalStudyCredits": 0,
    "compulsoryStudyCredits": 42,
    "electiveModulesNumber": 0,
    "minorSpeciality": false,
    "type": "Praktika",
    "subjects": [
      {
        "optional": false,
        "subject": {
          "id": 30772,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ034",
          "nameEt": "Ettevõtluse praktika I",
          "nameEn": "Entrepreneurship Practical Training I",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada koolis omandatud teoreetilisi teadmisi ettevõtte põhitegevuste, sise- ja väliskeskkonna (s.h töökeskkonna), dokumendihalduse ning turundustegevuse analüüsimisel.",
          "objectivesEn": "To create opportunities to apply the theoretical knowledge acquired at school in the analysis of the company's main activities, internal and external environment, document management and marketing activities.",
          "outcomesEt": "Praktika läbinud üliõpilane: \n-selgitab ettevõtte tegevusvaldkondi, põhitegevust ning organisatsiooni struktuuri;\n-selgitab ettevõtte dokumendihalduse korraldust ning põhimõtteid;\n-analüüsib ettevõtte turunduse ja selle juhtimisega seotud tegevusi, loetleb turundusmeetmeid ja selgitab nende rakendamist firma eesmärkide täitmisel.",
          "outcomesEn": "Internship student:\n-explains the company's areas of activity, main activities and organizational structure;\n-explains the organization and principles of the company's document management;\n-analyzes the company's marketing and management activities, lists marketing measures and explains their implementation in meeting the company's objectives.",
          "descriptionEt": "Ettevõtte üldiseloomustus. Õiguslik vorm, ettevõtte tegevusvaldkond, põhitegevus, organisatsiooni struktuur. Dokumendihaldus. Juhendid. Asjaajamise korraldamine, ametikirjade vormistamine, dokumendiringlus. Dokumendihaldus-tarkvara. Töökeskkond, töötervishoid, tööohutus. Töökeskkonna riskianalüüs; ohu-, keelu-, hoiatus-, kohustus- vms märgid; kaitsevahendid. Esmaabi, esmaabiandjad, esmaabivahendid; elektriohutuseeskirjad; töökeskkonnaspetsialisti olemasolu, töötajate sissejuhatav ja esmane instrueerimine, dokumentatsioon.",
          "descriptionEn": "General description of the company. Legal form, field of activity of the company, main activity, organizational structure. Document management. Instructions. Administration, preparation of official letters, document circulation. Document management software. Work environment, occupational health, occupational safety. Work environment risk analysis; danger, prohibition, warning, obligation or similar signs; protective equipment. First aid, first aiders, first aid equipment; electrical safety rules; existence of a work environment specialist, introductory and initial instruction of employees, documentation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30772
      },
      {
        "optional": false,
        "subject": {
          "id": 30774,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ036",
          "nameEt": "Juhtimise praktika",
          "nameEn": "Management Practical Training",
          "description": "-",
          "credits": 6,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalus juhtimise valdkonna teadmiste rakendamiseks praktikas läbi igapäevatöös osalemise ja kogetu analüüsimise.",
          "objectivesEn": "-To create an opportunity to apply knowledge in the field of management in practice through participation in daily work and analysis of experience.",
          "outcomesEt": "Aine läbinud üliõpilane: \n• analüüsib konkreetse organisatsiooni struktuuri, -kultuuri jt juhtimistegevusi ning viib läbi töötajate seas motivatsiooni- ja töörahulolu uuringu;\n• rakendab koolis saadud teoreetilisi süvateadmisi organisatsiooni igapäevases juhtimistegevuses sh keerulistes ja ettearvamatutes olukordades.",
          "outcomesEn": "-Student who has passed the subject:\n• analyzes the structure, culture and other management activities of a specific organization and conducts a survey of motivation and job satisfaction among employees;\n• applies the in-depth theoretical knowledge gained at school in the day-to-day management of the organization, including in complex and unpredictable situations.",
          "descriptionEt": "Tutvumine praktika baasiks oleva ettevõttega – tutvumine organisatsiooni struktuuri ja ametikohtadega, allüksuste ja juhtimistasemetega. Praktikaettevõtte struktuuri analüüs, -kultuuri analüüs. Juhi tööga tutvumine – juhi erinevate rollide täitmine Mintzbergi rollide jaotuse järgi. Juhi (lähijuhendaja) päeva pildistus koos rollide määratlemisega. Isiku ja organisatsiooni vahelised suhted praktikaettevõttes. Delegeerimine. Otsuste tegemine – otsuste liigid. Otsustamisprotsess. Näiteid praktikaettevõttest. Nõupidamised ja rühmaotsused. Koosolekute läbiviimise viisid. Planeerimine ja strateegiline juhtimine – organisatsiooni missioon. Praktikaettevõtte konkurentsi ja turundusstrateegiad/ arengukava analüüs. Aja juhtimine. Juhtimistöö praktikas – töötajate motivatsiooni ja töörahulolu uuringu teostamine praktikaettevõttes. Kvaliteedijuhtimine. Konfliktijuhtimine. Muutuste juhtimine praktikaettevõttes.",
          "descriptionEn": "-\nGetting acquainted with the company that is the basis of the internship - getting acquainted with the organizational structure and positions, subdivisions and management levels. Internship company structure analysis, culture analysis. Getting to know the job of a leader - fulfilling different roles of a leader according to the division of Mintzberg roles. A photo of the driver's (close supervisor) day with the definition of roles. Relationships between a person and an organization in an internship company. Delegation. Decision making - types of decisions. Decision making process. Examples of an internship company. Meetings and group decisions. Ways of holding meetings. Planning and strategic management - the mission of the organization. Internship competition and marketing strategies / development plan analysis. Time management. Management work in practice - conducting a survey of employee motivation and job satisfaction in an internship company. Quality management. Conflict management. Change management in an internship company.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30774
      },
      {
        "optional": false,
        "subject": {
          "id": 30773,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ035",
          "nameEt": "Ettevõtluse praktika II",
          "nameEn": "Entrepreneurship Practical Training II",
          "description": "-",
          "credits": 3,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada koolis omandatud teoreetilisi teadmisi ettevõtte põhitegevuste, sise- ja väliskeskkonna, turundustegevuse, dokumendihalduse ning raamatupidamise korraldamise analüüsimisel.",
          "objectivesEn": "To create opportunities to apply the theoretical knowledge acquired at school in the analysis of the company's main activities, internal and external environment, marketing activities, document management and accounting.",
          "outcomesEt": "Praktika läbinud üliõpilane: \n•\tselgitab ettevõtte dokumendihalduse ja raamatupidamise korraldust ning põhimõtteid, \n•\tanalüüsib ettevõtte töökeskkonda, selle regulatsiooni.",
          "outcomesEn": "Internship student:\n• explains the organization and principles of the company's document management and accounting,\n• analyzes the company's working environment, its regulation.",
          "descriptionEt": "Ettevõtte raamatupidamine, selle korraldamine: raamatupidamise sise-eeskirjad; raamatupidamistarkvara. Ettevõtte turundustegevus ja –juhtimine. Turundustegevuse korraldamine ettevõttes, turunduskeskkond, turg, turu segmentimine, positsioneerimine, konkurentsianalüüs, turundusmeetmestiku (tooted/teenused, hinnakujundus, turustuskanalid, müügitoetus) rakendamine ettevõttes., töötervishoid, tööohutus. Töökeskkonna riskianalüüs; ohu-, keelu-, hoiatus-, kohustus- vms märgid; kaitsevahendid. Esmaabi, esmaabiandjad, esmaabivahendid; elektriohutuseeskirjad; töökeskkonnaspetsialisti olemasolu, töötajate sissejuhatav ja esmane instrueerimine, dokumentatsioon.",
          "descriptionEn": "Company accounting, its organization: internal accounting rules; accounting software. Work environment, occupational health, occupational safety. Work environment risk analysis; danger, prohibition, warning, obligation or similar signs; protective equipment. First aid, first aiders, first aid equipment; electrical safety rules; existence of a work environment specialist, introductory and initial instruction of employees, documentation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 1,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30773
      },
      {
        "optional": false,
        "subject": {
          "id": 30769,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ031",
          "nameEt": "Töökorralduse praktika",
          "nameEn": "Work Arrangement Practical Training",
          "description": "-",
          "credits": 9,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused rakendada omandatud teoreetilisi teadmisi ja oskusi äriettevõtte töö korraldamisel.",
          "objectivesEn": "To create opportunities to apply the acquired theoretical knowledge and skills in organizing the work of a business enterprise.",
          "outcomesEt": "Aine läbinud üliõpilane: \n• vormistab töökorralduse dokumentatsiooni ning analüüsib tööaja arvestuse, töötasustamise ning puhkusearvestusega seotud dokumente;\n• teostab töökorralduse ja -tasustamisega seotud vajalikke arvutusi;\n• hindab ja analüüsib ettevõtte töökeskkonda ja tööprotsessi, teeb ettepanekuid tööprotsesside paremaks toimimiseks;\n• analüüsib ettevõtte motivatsiooni- ja/või tulemustasusüsteemi ning teeb ettevõttele ettepanekuid süsteemi paremaks toimimiseks;\n• analüüsib ettevõtte töökorralduse vastavust õigusaktides sätestatud nõuetele ja teeb vajadusel ettepanekuid ettevõtte õiguspäraseks toimimiseks.",
          "outcomesEn": "Student who has passed the subject:\n• prepares work organization documentation and analyzes documents related to the calculation of working time, remuneration and holiday accounting;\n• performs the necessary calculations related to work organization and remuneration;\n• evaluates and analyzes the company's work environment and work process, makes proposals for better functioning of work processes;\n• analyzes the company's motivation and / or performance reward system and makes suggestions to the company for the better functioning of the system;\n• analyzes the compliance of the company's work organization with the requirements provided by legislation and, if necessary, makes proposals for the lawful operation of the company.",
          "descriptionEt": "Ettevõtte üldiseloomustus. Ettevõtte ärimudel ja organisatsioonistruktuur. Personali koosseisu lühitutvustus. Töökorralduse üldpõhimõtted ja eesmärgid. Töökorraldusliku suhtlemise tasandid. Töökorralduslik dokumentatsioon. Tööaja regulatsioon ja arvestus. Töökorraldus ja personali motiveerimine. Töö tegemine ja lepingulised suhted; töölepinguga kaasnevad lepingud. Töösuhted ja varalised suhted. Ettevõtte töötasustamise põhimõtted ja tasusüsteem. Töötasu kui motivaator (motivatsioonisüsteemi/tulemustasu süsteemi kirjeldus ja lühianalüüs). Tööefektiivsus ja selle mõõtmine ettevõttes. Puhkusekorraldus ja –arvestus. Töökorralduse vastavus õigusaktides sätestatud nõuetele.",
          "descriptionEn": "General description of the company. Company business model and organizational structure. Brief introduction of staff. General principles and objectives of work organization. Levels of organizational communication. Work organization documentation. Regulation and calculation of working time. Work organization and staff motivation. Work performance and contractual relations; contracts accompanying the employment contract. Employment and property relations. Company remuneration principles and remuneration system. Remuneration as a motivator (description and brief analysis of the motivation system / performance reward system). Work efficiency and its measurement in the company. Holiday organization and calculation. Compliance of work organization with the requirements provided by legislation.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 2,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30769
      },
      {
        "optional": false,
        "subject": {
          "id": 30778,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ040",
          "nameEt": "Strateegilise juhtimise praktika",
          "nameEn": "Strategic Management Practical Training",
          "description": "-",
          "credits": 6,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalus rakendada teoreetilisi teadmisi ja oskusi ettevõtte strateegilises juhtimises ja arendamisel.",
          "objectivesEn": "Create an opportunity to apply theoretical knowledge and skills in the strategic management and development of the company.",
          "outcomesEt": "Praktika läbinud üliõpilane: \r\n•\tanalüüsib ettevõtte tegevuskeskkonda, makro- ja mikrokeskkonda;\r\n•\tkoostab ettevõtte strateegilisi dokumente (arengukava), formuleerib ettevõtte missiooni, visiooni ja eesmärgid;\r\n•\tanalüüsib erinevaid strateegiaid ja nende kasutamise võimalusi organisatsioonis, võttes vastutuse otsuste langetamise eest;\r\n•\tkoostab erinevaid organisatsiooni tegevuse strateegiaid.",
          "outcomesEn": "-",
          "descriptionEt": "Ettevõtte üldiseloomustus. Õiguslik vorm. Tegevusvaldkond ja tegevuskoht. Põhitegevused ja protsessid. Tooted ja/või teenused. Tuumikkompetentsid. Olemasolevad strateegilised dokumendid (millal loodud/kehtestatud, nende kehtivus, arendus jne). Ettevõtte väliskeskkond. Seadusandlus (ka võimalikud lähiaja muudatused). Erinevad valdkonda puudutavad normdokumendid. Maksud ja tegevusload. Konkurendid, hankijad, kliendid. Väliskeskkonnast tulenevad võimalused ja ohud ning nende kasutamine/vältimine. Ettevõtte sisekeskkond. Ettevõtte struktuur ja juhtimine. Kasutatavad juhtimismudelid. Ressursid ja kompetentsid, nende arendamine. Kvaliteedisüsteem. Sisemise toimimise reeglid: juhendid, sise-eeskirjad jne. Strateegilised tegevused. Ettevõtte juhtimine. Strateegiate koostamine. Missioon. Visioon. Eesmärgid. Tegevuskava. Turundusstrateegia sh hinnakujundus. Põhitegevuste juhtimine (sh tootmine, tehnoloogia, kvaliteet ja strateegiad). Arendamine (sh personal, koolitustegevus, õppiv organisatsioon, innovatsioon jne).",
          "descriptionEn": "General nature of the company. Legal form. Field of activity and place of activity. Core activities and processes. Products and/or Services. Core competencies. Existing strategic documents (when created/implemented, their validity, development, etc.). The company's external environment. Legislation (also possible near-term changes). Various normative documents concerning the field. Taxes and licenses. Competitors, suppliers, customers. Opportunities and threats arising from the external environment and their use/avoidance. The company's internal environment. Company structure and management. Management models used. Resources and competences, their development. Quality system. Rules of internal operation: manuals, internal regulations, etc. Strategic actions. Business management. Formulation of strategies. Mission. Vision. Goals. Action plan. Marketing strategy including pricing. Management of core activities (including production, technology, quality and strategies). Development (including personnel, training activities, learning organization, innovation, etc.).",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": false,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": false,
        "spring": true,
        "assessment": "A",
        "subjectId": 30778
      },
      {
        "optional": false,
        "subject": {
          "id": 30771,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ033",
          "nameEt": "Personalijuhtimise praktika",
          "nameEn": "Personnel Management Practical Training",
          "description": "-",
          "credits": 9,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused personalijuhtimise praktiliste oskuste rakendamiseks ettevõttes.",
          "objectivesEn": "Create opportunities to apply practical human resource management skills in the company.",
          "outcomesEt": "Praktika läbinud üliõpilane: \r\n•\tkasutab personaliülesannete lahendamisel asja- ja ajakohast personalidokumentatsiooni ja õigusteavet;\r\n•\tplaneerib tööjõudu ja personalivaldkondade tegevusi sh koostab koolitusvajadustele vastava (osakonna, struktuuriüksuse) koolitusplaani; \r\n•\tanalüüsib töötajate värbamise kampaania ja tööintervjuu kavandamist;\r\n•\tanalüüsib personali hindamise ja arendamise meetodite rakendamist;\r\n•\trakendab personaliarvestuse protseduure ja võtteid.",
          "outcomesEn": "Practical training student:\n• uses relevant and up-to-date personnel documentation and legal information when solving personnel tasks;\n• plans the activities of the workforce and personnel areas, incl. Prepares a training plan corresponding to the training needs (department, structural unit);\n• analyzes the planning of the recruitment campaign and job interview;\n• analyzes the implementation of personnel evaluation and development methods;\n• implements personnel accounting procedures and techniques.",
          "descriptionEt": "Ettevõtte üldiseloomustus, organisatsiooni struktuur, personali koosseisu lühitutvustus. Personalivajaduse prognoosimine. Värbamisvajaduse väljaselgitamine. Tööpakkumise koostamine ja avalikustamine. Värbamismeetodite kasutamine. Hindamismeetodite (CV analüüs, vestluste läbiviimine, testimine jne) kasutamine valikuprotsessis. Kandidaatidele tagasiside andmine. Töötajate hindamine. Arendus- ja koolitusvajaduse väljaselgitamine, koolitusplaani koostamine. Töölepingute sõlmimine, muutmine ja lõpetamine. Personalialaste statistiliste andmete kogumine, töötlemine ja analüüs. Personaliuuringud. Isikuandmete kaitse. Sisekommunikatsioon.",
          "descriptionEn": "General description of the company, organizational structure, brief introduction to the staff. Staffing forecasting. Identifying the need for recruitment. Preparation and publication of a job offer. Use of recruitment methods. Use of evaluation methods (CV analysis, interviews, testing, etc.) in the selection process. Giving feedback to candidates. Employee evaluation. Identification of development and training needs, preparation of a training plan. Conclusion, amendment and termination of employment contracts. Collection, processing and analysis of personnel statistics. Personnel surveys. Protection of personal data. Internal communication.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 4,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30771
      },
      {
        "optional": false,
        "subject": {
          "id": 30770,
          "school": "Tallinna Tehnikakõrgkool",
          "code": "MÄJ032",
          "nameEt": "Personalitöö praktika",
          "nameEn": "Personnel Work Practical Training",
          "description": "-",
          "credits": 6,
          "assessment": "arvestus (mitteeristav)",
          "assessmentCode": "HINDAMISVIIS_A",
          "assessmentDescription": "-",
          "objectivesEt": "Luua võimalused personalitöö praktiliste oskuste rakendamiseks ettevõttes.",
          "objectivesEn": "To create opportunities for applying the practical skills of personnel work in the company.",
          "outcomesEt": "Praktika läbinud üliõpilane: \r\n•\tleiab andmed personaliandmebaasist, teeb etteantud korralduste alusel päringuid ja koostab kokkuvõtteid (töötajate arv, haiguspäevade arv, koolituspäevade arv jms);\r\n•\tdokumenteerib personali värbamise, valiku ja hindamisega seotud materjale ja teateid;\r\n•\tdemonstreerib koolituse tehnilise korralduse, info edastamise ja koolitusega seonduva info kogumise oskust;\r\n•\tkoostab personalile info edastamiseks teateid.",
          "outcomesEn": "-",
          "descriptionEt": "Ettevõtte iseloomustus, ärimudel ja organisatsioonistruktuur. Personali koosseisu lühitutvustus. Personalialaste statistiliste andmete kogumine ja töötlemine. Isikuandmete kaitse. Personalivajaduse prognoosimine. Värbamisvajaduse väljaselgitamine. Tööpakkumise koostamine ja avalikustamine. Värbamismeetodite kasutamine. Hindamismeetodite (CV analüüs, vestluste läbiviimine, testimine jne) kasutamine valikuprotsessis. Kandidaatidele tagasiside andmine. Töötajate hindamine. Arendus- ja koolitusvajaduse väljaselgitamine.",
          "descriptionEn": "Company profile, business model and organizational structure. Brief introduction of staff. Collection and processing of personnel statistics. Protection of personal data. Staffing forecasting. Identifying the need for recruitment. Preparation and publication of a job offer. Use of recruitment methods. Use of evaluation methods (CV analysis, interviews, testing, etc.) in the selection process. Giving feedback to candidates. Employee evaluation. Identifying development and training needs.",
          "studyLiterature": "-",
          "evaluationEt": "-",
          "evaluationEn": "-",
          "independentStudyEt": "-",
          "independentStudyEn": "-",
          "additionalInfo": "-",
          "isPractice": true,
          "schoolDepartment": "Teenusmajanduse instituut",
          "subjectLanguages": ["Eesti keel"]
        },
        "studyYearNumber": 3,
        "autumn": true,
        "spring": false,
        "assessment": "A",
        "subjectId": 30770
      }
    ],
    "electiveModules": [],
    "specialities": [
      {
        "id": 220,
        "nameEt": "Personalijuhtimine",
        "nameEn": "Personnel Management",
        "credits": 0,
        "description": null,
        "occupationEt": null,
        "occupationEn": null,
        "occupation": null
      }
    ]
  }
]
